{
  "status": "ok",
  "totalResults": 30,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Brian Kemp Puts Donald Trump on Blast for COVID Response",
      "description": "Kemp slammed Trump, saying he \"parroted media talking points\" while opposing Georgia's attempt to re-open amid the pandemic.",
      "url": "https://www.newsweek.com/brian-kemp-puts-donald-trump-blast-covid-response-1825794",
      "urlToImage": "https://d.newsweek.com/en/full/2280218/kemp-blasts-trump-over-covid-response.png",
      "publishedAt": "2023-09-09T23:14:47Z",
      "content": "Georgia Governor Brian Kemp mocked former President Donald Trump on Saturday for his response to the COVID-19 pandemic, accusing him of following orders from top U.S. infectious disease expert Dr. Anthony Fauci, saying he \"parroted media talking poin... [4096 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "Kemp, DeSantis campaign push back on Trump's Covid ‘tyrants’ comments",
      "description": "“The fact is former president Trump led the opposition to my decision to reopen Georgia — the first state in the country to do so,” Kemp wrote in a post.",
      "url": "https://www.politico.com/news/2023/09/09/brian-kemp-trump-covid-00114881",
      "urlToImage": "https://static.politico.com/6c/0d/997dc9a94181994b0aa299c55130/https-delivery-gettyimages.com/downloads/1608045838",
      "publishedAt": "2023-09-09T21:32:19Z",
      "content": "At a rally in South Dakota on Friday night, Trump praised Gov. Kristi Noem, who was among a number of governors who did not impose statewide stay-at-home orders during the pandemic.\n“Unlike other governors, she never locked down South Dakota,” Trump ... [1250 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Huffington Post"
      },
      "author": "The Huffington Post",
      "title": "Trump, DeSantis And Other 2024 GOP Prospects Vie For Attention At Iowa-Iowa State Football Game",
      "description": "Donald Trump crossed paths with some his presidential campaign rivals when he attended Iowa’s biggest annual college football game.",
      "url": "https://www.huffpost.com/entry/trump-desantis-2024-presidential-candidates-football-game-iowa_n_64fcd000e4b08f0f4ebd988a",
      "urlToImage": "https://img.huffingtonpost.com/asset/64fcd0022200007708b25c0d.jpeg?cache=OlbGHSbGvZ&ops=1200_630",
      "publishedAt": "2023-09-09T20:10:01Z",
      "content": "LOADING ERROR LOADING\nDES MOINES, Iowa (AP) — Donald Trump crossed paths with several Republican rivals Saturday as he attended Iowa's in-state college football grudge match, one of the former president's few visits so far to the state that holds the... [3482 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Trump's Lawyers Realize Their Legal Argument 'Ain't Working': Ex-RNC Chair",
      "description": "Meadows is facing two criminal counts, accused of trying to overturn the 2020 presidential election results in Georgia.",
      "url": "https://www.newsweek.com/trumps-lawyers-realize-their-legal-argument-aint-working-ex-rnc-chair-1825785",
      "urlToImage": "https://d.newsweek.com/en/full/2280210/mark-meadows.jpg",
      "publishedAt": "2023-09-09T19:50:52Z",
      "content": "Former President Donald Trump's legal team may need to come up with a more \"creative argument\" in defending him as their legal one \"ain't working,\" former Republican National Committee (RNC) chairman Michael Steele said on Saturday.\nSteele's comments... [3226 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "Trump, DeSantis and other 2024 GOP prospects vie for attention at the Iowa-Iowa State football game",
      "description": "Trump has largely skipped holding town halls or participating in many of the state's cherished campaign traditions, but has not paid a price so far.",
      "url": "https://www.politico.com/news/2023/09/09/gop-candidates-iowa-football-00114880",
      "urlToImage": "https://static.politico.com/9a/17/b539ed614d6ea7ca9b54f6c1ab03/election-2024-trump-49837.jpg",
      "publishedAt": "2023-09-09T19:45:41Z",
      "content": "Trump has made a habit of visiting Iowa on the same day as DeSantis, whom Trump treats as his main threat. Both were in and around the stadium before kickoff, reminiscent of the scene last month when Trump drew huge crowds to Iowa State Fair in Des M... [2834 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Trump, DeSantis and other 2024 GOP prospects vie for attention at the Iowa-Iowa State football game",
      "description": "Donald Trump crossed paths with several Republican rivals Saturday as he attended Iowa’s in-state college football grudge match, one of the former president’s few visits so far to the state that holds the first nominating caucus next year.",
      "url": "https://www.chicagotribune.com/nation-world/ct-aud-nw-iowa-football-game-2024-presidential-candidates-20230909-54vqo74vorhzpa2lde2ssniuxe-story.html",
      "urlToImage": "https://www.chicagotribune.com/resizer/GSIfceiI8kiMbEjcWx1ruMfmYV8=/1200x630/filters:format(jpg):quality(70):focal(2815x1294:2825x1304)/cloudfront-us-east-1.images.arcpublishing.com/tronc/WHZZEWBFD7XYLSMOT2KPTHJ7YA.jpg",
      "publishedAt": "2023-09-09T18:39:00Z",
      "content": "Former President Donald Trump holds a spatula with a hamburger on it as he works the grill during a stop at the Alpha Gamma Rho, agricultural fraternity, at Iowa State University before an NCAA college football game between Iowa State and Iowa, Satur... [3942 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Georgia Grand Jury Report Could Still Be Bad News for Lindsey Graham",
      "description": "The nine-page report recommended charges against Graham, the South Carolina senator and an ardent Trump supporter.",
      "url": "https://www.newsweek.com/georgia-grand-jury-report-could-still-bad-news-lindsey-graham-1825778",
      "urlToImage": "https://d.newsweek.com/en/full/2280199/lindsey-graham.jpg",
      "publishedAt": "2023-09-09T17:40:42Z",
      "content": "The Fulton County grand jury's full report could still be bad news for Senator Lindsey Graham, a South Carolina Republican, as it could \"serve as a basis for federal charges,\" former U.S. Attorney Barbara McQuade told Newsweek on Saturday.\nThe report... [4165 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The New York Times"
      },
      "author": "The New York Times",
      "title": "Takeaways From a New Elon Musk Biography: Ukraine, Trump and More",
      "description": "The biography, by Walter Isaacson, portrays Mr. Musk as a complex, tortured figure.",
      "url": "https://www.nytimes.com/2023/09/09/technology/elon-musk-walter-isaacson-takeaways.html",
      "urlToImage": "https://static01.nyt.com/images/2023/09/09/multimedia/09isaacson-book-2-bpcw/09isaacson-book-2-bpcw-facebookJumbo.jpg",
      "publishedAt": "2023-09-09T17:21:13Z",
      "content": "A new biography of Elon Musk portrays the billionaire entrepreneur as a complex, tortured figure whose brilliance is often overshadowed by his inability to relate on a human level to the people around him — his wives, his children and those on whom h... [796 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "What is Project 2025? Trump Shadow Network Plans to Overhaul 'Deep State'",
      "description": "More than 50 conservative-leaning groups have united to create a program of government for the next Republican president.",
      "url": "https://www.newsweek.com/what-project-2025-trump-shadow-network-plans-overhaul-deep-state-1825780",
      "urlToImage": "https://d.newsweek.com/en/full/2280200/former-president-donald-trump.jpg",
      "publishedAt": "2023-09-09T16:24:05Z",
      "content": "In August, conservative think tank The Heritage Foundation, in collaboration with a slew of other right-leaning groups, published its 'Project 2025'. This effectively amounted to a program of government for a future Republican president, should the p... [4851 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Can the hated Trump be correct about the ‘madness’ of electric vehicles - or any other policy?",
      "description": "In the minds of those who hate him, has Trump ever been correct about any policy? Ever?",
      "url": "https://thehill.com/opinion/energy-environment/4194460-can-the-hated-trump-be-correct-about-the-madness-of-electric-vehicles-or-any-other-policy/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/04/643495ce143fd9.86989364-e1694199682608.jpeg?w=1280",
      "publishedAt": "2023-09-09T16:00:00Z",
      "content": "There is no shortage of Democrats, liberals, academics, entertainers and members of the media who seemingly hate former President Donald Trump with every fiber of their being. And guess what? There is absolutely nothing wrong with that. Such expressi... [5332 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump says DeSantis ‘sided with the communists in China’ over US farmers",
      "description": "At a rally in South Dakota Friday, former President Donald Trump said Florida Gov. Ron Desantis had “sided with the communists in China” over U.S. farmers. “He strongly opposed my protection for our farmers,” Trump said of DeSantis. “I protected our farmers, very simply, and by the way those farmers got big checks.” When DeSantis…",
      "url": "https://thehill.com/homenews/campaign/4195789-trump-says-desantis-sided-with-the-communists-in-china-over-us-farmers/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/07/TOP-Trump-Desantis_072723_The-Hill_Madeline-Monroe.jpg?w=1280",
      "publishedAt": "2023-09-09T15:31:41Z",
      "content": "At a rally in South Dakota Friday, former President Donald Trump said Florida Gov. Ron Desantis had “sided with the communists in China” over U.S. farmers.\n“He strongly opposed my protection for our farmers,” Trump said of DeSantis. “I protected our ... [1060 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Trump first choice for majority of Iowa Caucus voters: poll",
      "description": "Florida Governor Ron DeSantis came in a distant second with 14% support, while former U.N. Ambassador and South Carolina Governor Nikki Haley came as the first choice of 10% of likely voters.",
      "url": "https://nypost.com/2023/09/09/trump-first-choice-for-majority-of-iowa-caucus-voters-poll/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/09/NYPICHPDPICT000032791338.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2023-09-09T15:10:51Z",
      "content": "A majority of likely Iowa caucus voters said former President Trump was their top choice in the pivotal contest kicking off primary season.\nA total of 51% of voters said Trump would be their first pick, according to the survey conducted by Iowa State... [1728 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump told Masters he’d likely lose to Lake in Arizona: report",
      "description": "Former President Trump warned Blake Masters that he is likely to lose an Arizona Senate primary to Kari Lake in 2024, The New York Times reported Friday. The Times report claims Trump called Masters on Sunday to make the blunt prediction, in what would be a move inconsistent with his 2024 strategy so far of…",
      "url": "https://thehill.com/homenews/campaign/4195711-trump-told-masters-hed-likely-lose-to-lake-in-arizona-report/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/09/MastersBlake_LakeKari.jpeg?w=1280",
      "publishedAt": "2023-09-09T14:58:39Z",
      "content": "Former President Trump warned Blake Masters that he is likely to lose an Arizona Senate primary to Kari Lake in 2024, The New York Times reported Friday.\nThe Times report claims Trump called Masters on Sunday to make the blunt prediction, in what wou... [2183 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump blasts ‘slime balls’ who sued to keep him off Colorado ballot",
      "description": "Former President Trump isn’t too pleased with a lawsuit filed earlier this week to try and keep him off the ballot in 2024 in Colorado. The lawsuit was filed by Citizens for Responsibility and Ethics in Washington (CREW) Wednesday. It tries to use the 14th Amendment to say the former president is disqualified for actions…",
      "url": "https://thehill.com/homenews/campaign/4195727-trump-blasts-slime-balls-who-sued-to-keep-him-off-colorado-ballot/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/08/trumpdonald_jan6_selectcomm.jpg?w=1280",
      "publishedAt": "2023-09-09T14:36:52Z",
      "content": "Former President Trump isn’t too pleased with a lawsuit filed earlier this week to try and keep him off the ballot in 2024 in Colorado.\nThe lawsuit was filed by Citizens for Responsibility and Ethics in Washington (CREW) Wednesday. It tries to use th... [1316 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Sheriff calls Trump’s attitude while surrendering ‘stoic’",
      "description": "In an interview on CNN Friday, Fulton County Sheriff Patrick Labat described Donald Trump’s demeanor when surrendering at the Fulton County Jail as unemotional.  “He came out, he was very stoic, really in a space that he was able to really lean on what we were doing, what we planned, and so we took his…",
      "url": "https://thehill.com/regulation/court-battles/4195705-sheriff-calls-trumps-attitude-while-surrendering-stoic/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/08/AP23236516644883-1-e1692915167796.jpg?w=1280",
      "publishedAt": "2023-09-09T13:57:39Z",
      "content": "In an interview on CNN Friday, Fulton County Sheriff Patrick Labat described Donald Trump’s demeanor when surrendering at the Fulton County Jail as unemotional.\n“He came out, he was very stoic, really in a space that he was able to really lean on wha... [880 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Giuliani says Trump ‘really, really upset’ by conviction of ex-White House adviser",
      "description": "Trump ally describes ex-president’s reaction to news his former adviser Peter Navarro convicted of contempt of Congress",
      "url": "https://www.theguardian.com/us-news/2023/sep/09/donald-trump-upset-peter-navarro-conviction-rudy-giuliani",
      "urlToImage": "https://i.guim.co.uk/img/media/b8a7679ab223e8fd9b54daad1de324f412b9785a/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e2ebf3911a8ef42133d93cd6203d34d1",
      "publishedAt": "2023-09-09T13:49:29Z",
      "content": "Donald Trump was “really, really upset” when he learned that his former White House adviser Peter Navarro had been convicted of contempt of Congress, according to the ex-president’s close ally Rudy Giuliani.\n“This one really got to me,” Giuliani – th... [3366 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Who will be at the Iowa-Iowa state game",
      "description": "The top three Republican presidential candidates will feature in the crowd of the Iowa-Iowa State football game on Saturday afternoon, for what will likely be the largest sports crowd in the state for the prestigious rivalry game. Former President Trump, Florida Gov. Ron DeSantis and businessman Vivek Ramaswamy have confirmed their attendance, alongside lesser candidates…",
      "url": "https://thehill.com/homenews/campaign/4195666-who-will-be-at-the-iowa-iowa-state-game/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/08/Trump-DeSantis-Iowa-2023.png?w=1280",
      "publishedAt": "2023-09-09T13:28:12Z",
      "content": "The top three Republican presidential candidates will feature in the crowd of the Iowa-Iowa State football game on Saturday afternoon, for what will likely be the largest sports crowd in the state for the prestigious rivalry game.\nFormer President Tr... [1679 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "The group that won Trump the election in 2016 may win it for him again in 2024",
      "description": "President Joe Biden continues to be plagued by approval ratings well below 50%. Under normal circumstances, that might be worrying for an incumbent heading into his reelection year. But Biden likes to rely on a common refrain: “Don’t compare me to the Almighty, compare me to the alternative.”",
      "url": "https://edition.cnn.com/2023/09/09/politics/president-election-trump-biden-cnn-poll/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230907203544-trump-biden-split-0907.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2023-09-09T12:16:28Z",
      "content": "CNN —\nPresident Joe Biden continues to be plagued by approval ratings well below 50%. Under normal circumstances, that might be worrying for an incumbent heading into his reelection year. But Biden likes to rely on a common refrain: “Don’t compare me... [3844 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump's eligibility under 14th Amendment raises questions",
      "description": "Donald Trump’s campaign for a second term alongside his prosecution for seeking to block the transfer of power has raised questions over whether the former president can be barred from the ballot under a 14th Amendment provision targeting those involved in insurrections. A handful of Colorado residents have launched a suit to remove Trump from the ballot…",
      "url": "https://thehill.com/homenews/campaign/4195050-trump-ballot-14th-amendment-eligibility/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/09/trump-merch_090823getty_blocking-trump.jpg?w=1280",
      "publishedAt": "2023-09-09T10:00:00Z",
      "content": "Donald Trump’s campaign for a second term alongside his prosecution for seeking to block the transfer of power has raised questions over whether the former president can be barred from the ballot under a 14th Amendment provision targeting those invol... [8911 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Associated Press"
      },
      "author": "The Associated Press",
      "title": "Trump, DeSantis and other 2024 GOP prospects vie for attention at Iowa-Iowa State football game",
      "description": "Donald Trump will cross paths with many of his rivals when he attends Iowa’s biggest annual college football game.",
      "url": "https://apnews.com/article/donald-trump-ron-desantis-iowa-iowa-state-football-game-f398a634ce11048c5e49b207263994c2",
      "urlToImage": "https://dims.apnews.com/dims4/default/cddbd19/2147483647/strip/true/crop/3437x1933+0+179/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd9%2F16%2Fd0519c748535a9b797c9005edf3d%2Fce9b0ed43f8c42d2a8a4b723c3903c5e",
      "publishedAt": "2023-09-09T08:18:50Z",
      "content": "DES MOINES, Iowa (AP) — Donald Trump will cross paths with several Republican rivals Saturday when he attends Iowa’s in-state college football grudge match, one of the former president’s few visits so far to the state that holds the first nominating ... [3156 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "‘We have to come to grips with history’: Robert P Jones on The Hidden Roots of White Supremacy",
      "description": "The US scholar finds the source of Trump’s racist appeal – and current culture wars over the teaching of the American past – in papal doctrine and deadly Christian certainties",
      "url": "https://www.theguardian.com/books/2023/sep/09/robert-p-jones-book-roots-white-supremacy-trump-biden-race",
      "urlToImage": "https://i.guim.co.uk/img/media/babc003d38fe16756476f67d989c38072c311ae9/0_200_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e1f8aa0b5f4ea0de36db145f1cd7f474",
      "publishedAt": "2023-09-09T06:00:16Z",
      "content": "How did Donald Trump win the 2016 presidential election despite the Access Hollywood tape? How did he gain even more votes in 2020 despite an administration of chaos, lies and pandemic blunders? How can he be running neck and neck with Joe Biden for ... [14091 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "South Dakota Gov. Kristi Noem endorses Trump for president",
      "description": "Republican South Dakota Gov. Kristi Noem endorsed former President Donald Trump’s 2024 White House bid on Friday, calling him “the fighter that our country needs.”",
      "url": "https://nypost.com/2023/09/09/south-dakota-gov-kristi-noem-endorses-trump-for-president/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/09/noem.jpg?quality=75&strip=all&1694218405&w=1024",
      "publishedAt": "2023-09-09T04:13:49Z",
      "content": "Republican South Dakota Gov. Kristi Noem endorsed former President Donald Trump’s 2024 White House bid on Friday, calling him “the fighter that our country needs.”\nNoem’s endorsement came during a South Dakota GOP rally headlined by the 77-year-old, ... [3035 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Boston Globe"
      },
      "author": "The Boston Globe",
      "title": "Guess who’s running for president from his basement now? Donald Trump.",
      "description": "Amid four separate criminal indictments and all the court maneuverings involved, Trump isn’t actually, you know, campaigning. But for now, maybe he doesn't have to.",
      "url": "https://www.bostonglobe.com/2023/09/09/nation/guess-whos-running-president-his-basement-now-donald-trump/",
      "urlToImage": "https://bostonglobe-prod.cdn.arcpublishing.com/resizer/9jsnBV2NEd2shMGQL2q2Q1Pocxc=/506x0/cloudfront-us-east-1.images.arcpublishing.com/bostonglobe/ZYUM54JLRW3HJARPGDM3RADX3A.jpg",
      "publishedAt": "2023-09-09T04:00:00Z",
      "content": "Amid four separate criminal indictments and all the court maneuverings involved, Trump, the leading candidate for the Republican nomination, isn’t actually, you know, campaigning.\nIt was the first time in exactly a month that Trump spoke at a major p... [3060 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "News18"
      },
      "author": "News18",
      "title": "'No One Knows Dhoni?': Thala Playing Golf With Donald Trump Leaves Cricket Fans in Funny Banter",
      "description": "MS Dhoni's viral pic with former US President Donald Trump attracts memes on social media.",
      "url": "https://www.news18.com/viral/dhoni-playing-golf-with-donald-trump-viral-pic-cricket-fans-reactions-on-x-memes-8570015.html",
      "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/09/untitled-2023-09-09t085150.729-1-169422999016x9.jpg",
      "publishedAt": "2023-09-09T03:28:28Z",
      "content": "MS Dhoni is known for his penchant for the unexpected, often leaving everyone pleasantly surprised. This time, it happened during his golf outing with former US President Donald Trump, who hosted the cricketer for a match at his place. The delightful... [2076 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Australian Financial Review"
      },
      "author": "The Australian Financial Review",
      "title": "Georgia special grand jury recommended charging Lindsey Graham in Trump case",
      "description": "Two other former senators, David Perdue and Kelly Loeffler of Georgia, and Michael Flynn, the former president’s national security adviser, were also singled out.",
      "url": "https://www.afr.com/world/north-america/georgia-special-grand-jury-recommended-charging-lindsey-graham-in-trump-case-20230909-p5e3cl",
      "urlToImage": "https://static.ffx.io/images/$zoom_0.2796%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_95%2C$y_0/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/e84d6ff5f2612825cdeef40347eeeeddaae61f06",
      "publishedAt": "2023-09-09T02:54:58Z",
      "content": "It was then disbanded so a conventional grand jury could be summoned to vote on which of the potential defendants should be indicted.\nThere are many reasons Ms Willis might have chosen not to charge all those recommended, including immunity deals wit... [2226 chars]"
    }
  ]
}
