{
  "status": "ok",
  "totalResults": 40,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "FBI slowed investigation into Trump's role in January 6 for fear of appearing political, Washington Post reports",
      "description": "The FBI, mindful of not wanting to appear partisan, had for months held off on launching a formal investigation into former President Donald Trump’s role in efforts to subvert the 2020 election, The Washington Post reported Monday, though the episode doesn’t appear to have significantly hampered prosecutors’ ability to look at Trump for federal crimes in the past two years.",
      "url": "https://edition.cnn.com/2023/06/19/politics/fbi-doj-trump-investigation-january-6/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230619161246-02-donald-trump-210106-file.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2023-06-19T23:52:34Z",
      "content": "CNN —\nThe FBI, mindful of not wanting to appear partisan, had for months held off on launching a formal investigation into former President Donald Trump’s role in efforts to subvert the 2020 election, The Washington Post reported Monday, though the e... [3768 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Brit Hume: Trump defense of taking documents ‘incoherent’",
      "description": "Fox News analyst Brit Hume said Monday that former President Trump’s defense for keeping classified documents was borderline “incoherent.” “His answers on the matter of the law seem to verge on incoherent,” Hume said after a portion of Trump’s interview with Fox anchor Bret Baier aired on the network.  “He seemed to be saying the…",
      "url": "https://thehill.com/homenews/campaign/4057630-brit-hume-trump-defense-of-taking-documents-incoherent/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/06/Donald-Trump-2023-2.png?w=1280",
      "publishedAt": "2023-06-19T23:15:46Z",
      "content": "Fox News analyst Brit Hume said Monday that former President Trump’s defense for keeping classified documents was borderline “incoherent.”\n“His answers on the matter of the law seem to verge on incoherent,” Hume said after a portion of Trump’s interv... [2100 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo News"
      },
      "author": "Yahoo News",
      "title": "'I was very busy.' Trump gives new reason he didn't hand over classified documents",
      "description": "In an interview with Bret Baier, Donald Trump said he didn't give back classified documents because he first wanted to take out his personal possessions.",
      "url": "https://news.yahoo.com/very-busy-trump-gives-reason-230342087.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/FEf.kD4172OhyDltZSfBkw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/usa_today_news_641/cf301492bb3126cdda0efecf231020a0",
      "publishedAt": "2023-06-19T23:03:42Z",
      "content": "Former President Donald Trump offered a new explanation Monday as to why he didn't return classified documents he took with him from the White House, saying he was \"very busy\" and didn't have time to separate them from his personal belongings.\nTrump ... [2008 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "BreakingNews.ie"
      },
      "author": "BreakingNews.ie",
      "title": "Lawyer faces disciplinary hearing over plot to keep Donald Trump in power",
      "description": "John Eastman faces 11 disciplinary charges stemming from his development of a dubious legal strategy aimed at helping Mr Trump overturn the election.",
      "url": "https://www.breakingnews.ie/world/lawyer-faces-disciplinary-hearing-over-plot-to-keep-donald-trump-in-power-1491894.html",
      "urlToImage": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjNcXFwvMDZcXFwvMjAxODU0MTJcXFwvOGViOTFkNTJjNmI1NDcxY2JhYzlkMzZmY2E1MmM2YmUtZTE2ODcyODc0NzI3NDQuanBnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5icmVha2luZ25ld3MuaWVcXFwvaW1hZ2VzXFxcL25vLWltYWdlLnBuZ1wiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiI2MzFlYjA1M2Q3NGI1ODRkNzA5OTNkMDZjODZmNDg3ZDYyNWM1YTA2In0=/lawyer-faces-disciplinary-hearing-over-plot-to-keep-donald-trump-in-power.jpg",
      "publishedAt": "2023-06-19T23:00:00Z",
      "content": "Lawyer John Eastman, a lead architect of some of former US president Donald Trump’s efforts to remain in power after the 2020 election, faces possible disbarment in disciplinary proceedings that began on Tuesday in Los Angeles.\nEastman faces 11 disci... [1886 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump, Fox’s Bret Baier spar over former president’s 2020 election claims",
      "description": "Former President Trump and Fox News anchor Bret Baier argued over Trump’s false claims of a rigged election in 2020 during a contentious interview that aired Monday on the network. “First of all, I won in 2020 by a lot,” Trump said when Baier asked him how he plans to appeal to independent voters in…",
      "url": "https://thehill.com/homenews/4057551-trump-foxs-bret-baier-spar-over-his-2020-election-claims/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/06/Trump_BretBaier.jpeg?w=1280",
      "publishedAt": "2023-06-19T22:38:36Z",
      "content": "Former President Trump and Fox News anchor Bret Baier argued over Trump’s false claims of a rigged election in 2020 during a contentious interview that aired Monday on the network.\n“First of all, I won in 2020 by a lot,” Trump said when Baier asked h... [1217 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump defends keeping classified docs in contentious exchange with Fox’s Baier",
      "description": "Former President Donald Trump on Monday defended his retention of classified materials after leaving the White House, telling Fox News he did not have time to go through the boxes filled with the documents. “Why not just hand them over then?” Fox anchor Bret Baier asked in Trump’s first interview since being arraigned last week…",
      "url": "https://thehill.com/homenews/campaign/4057556-trump-defends-keeping-classified-docs-in-contentious-exchange-with-foxs-baier/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/06/AP23165036929546-e1686962246499.jpg?w=1280",
      "publishedAt": "2023-06-19T22:26:44Z",
      "content": "Former President Donald Trump on Monday defended his retention of classified materials after leaving the White House, telling Fox News he did not have time to go through the boxes filled with the documents.\n“Why not just hand them over then?” Fox anc... [1754 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Former Trump lawyer Alan Dershowitz bashes indictments against ex-president",
      "description": "Famed attorney Alan Dershowitz said the indictment of former President Donald Trump in New York is the \"worst case\" he has ever seen.",
      "url": "https://nypost.com/2023/06/19/former-trump-lawyer-alan-dershowitz-bashes-indictments-against-ex-president/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/06/newspress-collage-07z5pipba-1687212347880.jpg?quality=75&strip=all&1687197997&w=1024",
      "publishedAt": "2023-06-19T22:19:57Z",
      "content": "Justice isn’t that simple\nAlan Dershowitz, Harvard prof, author of seven best sellers, 84, most famous lawyer anywhere, you believe all your clients?\n“Of course not. Many charged with crimes are guilty of something. Innocence is in Iran, China, Cuba.... [3370 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "I wanted to 'get all my personal things out' of classified doc boxes 'and I was very busy'",
      "description": "Former President Donald Trump suggested Monday that he just didn't have time to comply with a federal subpoena for his White House documents, claiming he needed to \"go through the boxes and get all my personal things out ... and I was very busy.\"",
      "url": "https://nypost.com/2023/06/19/trump-i-wanted-to-get-all-my-personal-things-out-of-classified-doc-boxes-and-i-was-very-busy/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/06/NYPICHPDPICT000012922929.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2023-06-19T22:14:13Z",
      "content": "WASHINGTON — Former President Donald Trump suggested Monday that he just didn’t have time to comply with a federal subpoena for his White House documents, claiming he needed to “go through the boxes and get all my personal things out … and I was very... [3885 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Deadline",
      "title": "Donald Trump Talks Ballot-Stuffing With Fox News’ Bret Baier, Who Then Says, “You Lost The 2020 Election”",
      "description": "UPDATE: Donald Trump offered a fusillade of unfounded claims and falsehoods in his interview with Fox News' Bret Baier, who seems to have gone into the sit down with a strategy to challenge the former president on certain topics and move on at other moments.",
      "url": "https://deadline.com/2023/06/donald-trump-fox-news-bret-baier-1235420347/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2023/06/Donald-Trump-Bret-Baier.jpg?w=1000",
      "publishedAt": "2023-06-19T21:28:44Z",
      "content": "UPDATE: Donald Trump offered a fusillade of unfounded claims and falsehoods in his interview with Fox News’ Bret Baier, who seems to have gone into the sit down with a strategy to challenge the former president on certain topics and move on at other ... [6452 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Globe and Mail"
      },
      "author": "The Globe and Mail",
      "title": "U.S. judge orders Donald Trump’s lawyers not to release evidence in documents probe",
      "description": "Order from U.S. Magistrate Judge Bruce Reinhart also put strict conditions on the former president’s access to the materials",
      "url": "https://www.theglobeandmail.com/world/article-us-judge-orders-donald-trumps-lawyers-not-to-release-evidence-in/",
      "urlToImage": "https://www.theglobeandmail.com/resizer/3_ocIZiviTlpnMYKaEoBwtBab3E=/1200x800/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/7LFTVAZXO5LTHFMBC3Z2MMO3RY.JPG",
      "publishedAt": "2023-06-19T21:10:57Z",
      "content": "Open this photo in gallery: Former U.S. president Donald Trump is pictured after his arraignment on classified document charges at Trump National Golf Club in Bedminster, N.J., on June 13.AMR ALFIKY/Reuters\nA U.S. judge in Florida on Monday ordered d... [2135 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sky News"
      },
      "author": "Sky News",
      "title": "Politics latest: Johnson 'spewing Trump-like conspiracies', MPs at partygate debate told; Sunak under fire for not showing up; Rees-Mogg told 'that's a mic drop' after he interrupts",
      "description": "MPs are debating the partygate report on Boris Johnson - watch live in the stream below. Rishi Sunak has not turned up for the debate, while the former PM's allies are expected to boycott a vote on whether to accept the findings of the report later this evening.",
      "url": "https://news.sky.com/story/politics-latest-johnson-spewing-trump-like-conspiracies-mps-at-partygate-debate-told-sunak-under-fire-for-not-showing-up-rees-mogg-told-thats-a-mic-drop-after-he-interrupts-12593360",
      "urlToImage": "https://e3.365dm.com/23/06/1600x900/skynews-boris-johnson-sotwell_6189058.jpg?20230616100515",
      "publishedAt": "2023-06-19T20:29:00Z",
      "content": "'Dangerous' to assume democracy is inevitable and unshakeable - Green Party MP\nGreen Party MP Caroline Lucas also warned that it was \"dangerous\" to assume that democracy was \"inevitable and unshakeable\".\nShe said that the day the report was published... [886 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Washington Examiner"
      },
      "author": "Washington Examiner",
      "title": "Sketch artist responds to critics who say he made Trump 'too young,' 'good looking'",
      "description": "A courtroom sketch artist is speaking out after critics attacked him for making former President Donald Trump look \"too young\" and \"good looking\" during his arraignment last week.",
      "url": "https://www.washingtonexaminer.com/news/trump-sketch-artist-responds-to-critics",
      "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/47e01cd/2147483647/strip/true/crop/5808x3049+0+411/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Feb%2Ffe%2F76821d5343ab9fe7b4bc9e1d63ea%2Fap22111613558721.jpg",
      "publishedAt": "2023-06-19T20:13:15Z",
      "content": "A courtroom sketch artist is speaking out after critics attacked him for making former President Donald Trump look \"too young\" and \"good looking\" during his arraignment last week.\nTrump was indicted on 37 federal charges in relation to retaining nati... [1585 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Democrat Stacey Plaskett says Trump ‘needs to be shot' in TV stumble over alleged mishandling of classified documents",
      "description": "Del. Stacey Plaskett (D-Virgin Islands) stumbled over her words during a Sunday interview on MSNBC, saying former President Donald Trump “needs to be shot” over his alleged mishandling of classified documents before quickly correcting herself that he should be “stopped.”",
      "url": "https://nypost.com/2023/06/19/democrat-stacey-plaskett-says-trump-needs-to-be-shot/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/06/NYPICHPDPICT000012917713.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2023-06-19T20:01:21Z",
      "content": "Del. Stacey Plaskett (D-Virgin Islands) tripped over her tongue during a Sunday interview on MSNBC, saying former President Donald Trump “needs to be shot” over his alleged mishandling of classified documents before quickly correcting herself to say ... [2895 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump rips Quinnipiac, Fox News over poll",
      "description": "Former President Trump tore into Quinnipiac and Fox News over a poll showing him trailing President Biden in a head-to-head matchup. “The Quinnipiac Poll FoxNews keeps showing on “TRUMP” vs. Biden is not just an old Poll, it is a BAD Poll,” Trump wrote Monday on Truth Social. “It under samples Republicans by 10 points,…",
      "url": "https://thehill.com/homenews/campaign/4057251-trump-rips-quinnipiac-fox-news-over-poll/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/06/AP23165038619751-1-e1686708198931.jpg?w=1280",
      "publishedAt": "2023-06-19T19:23:14Z",
      "content": "Former President Trump tore into Quinnipiac and Fox News over a poll showing him trailing President Biden in a head-to-head matchup.\n“The Quinnipiac Poll FoxNews keeps showing on “TRUMP” vs. Biden is not just an old Poll, it is a BAD Poll,” Trump wro... [1356 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Donald Trump Restricted From Info in His Criminal Case",
      "description": "A federal judge passed an order Monday forbidding the former president from sharing information related to discovery materials on social media.",
      "url": "https://www.newsweek.com/donald-trump-restricted-info-criminal-case-1807717",
      "urlToImage": "https://d.newsweek.com/en/full/2248253/former-us-president-donald-trump.jpg",
      "publishedAt": "2023-06-19T19:21:02Z",
      "content": "U.S. Magistrate Judge Bruce Reinhart ordered a series of restrictions for former President Donald Trump's legal team to follow when handling discovery materials from the Department of Justice (DOJ) in his criminal case.\nTrump, who was indicted earlie... [3316 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "PerthNow"
      },
      "author": "PerthNow",
      "title": "Julia Louis-Dreyfus: Popular Seinfeld actor talks new show You Hurt My Feelings and Donald Trump",
      "description": "Julia Louis-Dreyfus’ performance in the brilliantly slow-burn comedy You Hurt My Feelings shows just how far she’s come since reaching icon status in Seinfeld.",
      "url": "https://www.perthnow.com.au/entertainment/movies/julia-louis-dreyfus-on-seinfeld-reunion--c-10987071",
      "urlToImage": "https://images.perthnow.com.au/publication/C-10987071/6518c47e552bbb2fa42837abde9544fca24baaa1-16x9-x0y578w3000h1688.jpg?imwidth=1200",
      "publishedAt": "2023-06-19T18:00:00Z",
      "content": "Julia Louis-Dreyfus’ performance in the brilliantly slow-burn comedy You Hurt My Feelings shows just how far she’s come since reaching icon status in Seinfeld, but the actor admits Elaine is never far from her mind.\n“I often get, ‘No soup for you’; p... [3638 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sky News"
      },
      "author": "Sky News",
      "title": "Politics latest: Boris Johnson 'spewing Trump-like conspiracies', MPs debating partygate report told; Rees-Mogg told 'that's a mic drop' after he interrupts",
      "description": "MPs are debating the partygate report on Boris Johnson - watch live in the stream below. Rishi Sunak has not turned up for the debate, while the former PM's allies are expected to boycott the vote.",
      "url": "https://news.sky.com/story/politics-latest-boris-johnson-spewing-trump-like-conspiracies-mps-debating-partygate-report-told-rees-mogg-told-thats-a-mic-drop-after-he-interrupts-12593360",
      "urlToImage": "https://e3.365dm.com/23/06/1600x900/skynews-boris-johnson-sotwell_6189058.jpg?20230616100515",
      "publishedAt": "2023-06-19T17:16:00Z",
      "content": "Johnson gets it in the neck from May and Harman\nHarriet Harman declared that she and Theresa May share a great deal, including a necklace. And so they did. The chunky red chain necklace they both were wearing were almost identical.\nBut in two blockbu... [1982 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Pioneer"
      },
      "author": "The Pioneer",
      "title": "Trump faces questions about whether he'll drag down the Republican Party after his indictments",
      "description": "For now, no one comes close to Donald Trump in his command of the voters who'll decide the...",
      "url": "https://www.bigrapidsnews.com/news/politics/article/trump-faces-questions-about-whether-he-ll-drag-18159627.php",
      "urlToImage": "https://s.hdnux.com/photos/01/33/27/71/23952964/3/rawImage.jpg",
      "publishedAt": "2023-06-19T16:56:00Z",
      "content": "Donald Trump's grip on the Republican faithful was evident from the moment he left the federal courthouse in Miami last week.\nFresh off becoming the first former president to face criminal charges levied by the government he once oversaw, Trump's mot... [6717 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "WDIV ClickOnDetroit"
      },
      "author": "WDIV ClickOnDetroit",
      "title": "Trump faces questions about whether he'll drag down the Republican Party after his indictments",
      "description": "For now, no one comes close to Donald Trump in his command of the voters who'll decide the Republican Party's presidential nominee next year.",
      "url": "https://www.clickondetroit.com/news/politics/2023/06/19/trump-faces-questions-about-whether-hell-drag-down-the-republican-party-after-his-indictments/",
      "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/LOU5QJKXD5BNNG6QWKLUTUWPAE.jpg?_a=ATCqVhC0",
      "publishedAt": "2023-06-19T16:29:07Z",
      "content": "FILE - Former President Donald Trump greets supporters at Versailles restaurant on Tuesday, June 13, 2023, in Miami. Trump appeared in federal court Tuesday on dozens of felony charges accusing him of illegally hoarding classified documents and thwar... [7060 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New Statesman"
      },
      "author": "New Statesman",
      "title": "Is Johnson now so different from Trump?",
      "description": "The Conservatives have failed to learn from the Republicans’ mistakes.",
      "url": "https://www.newstatesman.com/quickfire/2023/06/conservatives-supporting-boris-johnson-republicans-donald-trump",
      "urlToImage": "https://dl6pgk4f88hky.cloudfront.net/2023/06/19/Trump-Johnson-800x418.jpg?1688400795",
      "publishedAt": "2023-06-19T16:17:49Z",
      "content": "Photo by Stefan Rousseau / Getty Images\nI used to resist the comparison between Donald Trump and Boris Johnson. They were too easy, too obvious, lacking subtlety. Though it seemed they were riding similar (political) waves, the individual surfers wer... [9239 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FOX 4 News"
      },
      "author": "FOX 4 News",
      "title": "Trump pleads not guilty to federal charges that he illegally kept classified documents",
      "description": "Former President Donald Trump has pleaded not guilty to federal charges alleging he hoarded classified documents detailing sensitive military secrets and schemed to thwart government efforts to get them back.",
      "url": "https://www.fox4news.com/news/trump-to-appear-in-court-over-charges-he-mishandled-secret-government-documents",
      "urlToImage": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2023/06/1280/720/GettyImages-1258668232.jpg?ve=1&tl=1",
      "publishedAt": "2023-06-19T15:14:48Z",
      "content": "Donald Trump became the first former president to face a judge on federal charges as he pleaded not guilty in a Miami courtroom Tuesday to dozens of felony counts accusing him of hoarding classified documents and refusing government demands to give t... [7431 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FOX 4 News"
      },
      "author": "FOX 4 News",
      "title": "Key takeaways from Trump's court appearance in Miami",
      "description": "The former president, accused of being careless with some of the country’s most sensitive secrets and obstructing authorities as they tried to recover critical documents, pleaded not guilty to 37 charges.",
      "url": "https://www.fox4news.com/news/trump-arraignment-miami-key-takeaways",
      "urlToImage": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2023/06/1280/720/GettyImages-1258674575.jpg?ve=1&tl=1",
      "publishedAt": "2023-06-19T15:14:48Z",
      "content": "Donald Trump's four years in the White House, even on some of the most consequential days of his presidency, were punctuated by the spectacle and attempts at showmanship he cultivated from years as a tabloid fixture and reality star.\nThe former presi... [7211 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Boston.com"
      },
      "author": "Boston.com",
      "title": "Federal case against Trump is ‘entirely of his own making’",
      "description": "Former AG Bill Barr, in an interview with CBS News’ “Face the Nation,” walked through the severity of the charges against Trump.",
      "url": "https://www.boston.com/news/national-news/2023/06/19/barr-says-documents-case-against-trump-is-entirely-of-his-own-making/",
      "urlToImage": "https://www.boston.com/wp-content/uploads/2023/06/https___www.nytsyn.com_images_feed_support_photos_download_0b73b497-d814-43d3-af2f-a7779bded1cb-64906cb8d5225-scaled.jpg",
      "publishedAt": "2023-06-19T15:05:48Z",
      "content": "National News Barr says documents case against Trump is ‘entirely of his own making’ The former AG described Trump’s actions as harmful not only to the country but to the Republican Party. Donald Trump and William Barr walk off Air Force One at Joint... [2906 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FOX 4 News"
      },
      "author": "FOX 4 News",
      "title": "Texas Congressman Randy Weber talks why GOP continues to back Trump",
      "description": "On tonight's edition of Texas, The Issue Is: we speak with Congressman Randy Weber, who like most of Texas Republican delegation, is hanging tough with Donald Trump despite mounting criminal charges the former president faces.",
      "url": "https://www.fox4news.com/news/texas-congressman-randy-weber-talks-why-gop-continues-to-back-trump",
      "urlToImage": "https://images.foxtv.com/static.fox4news.com/www.fox4news.com/content/uploads/2023/06/1280/720/601a176a-snapshot-20.jpg?ve=1&tl=1",
      "publishedAt": "2023-06-19T15:05:12Z",
      "content": "On tonight's edition of Texas - The Issue Is: we speak with Congressman Randy Weber, who like most of our state's Republican delegation, is hanging tough with Donald Trump despite the mounting criminal charges faced by the former president.\nSUGGESTED... [2865 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Judge orders Trump not to disclose evidence in documents case",
      "description": "A federal magistrate judge Monday agreed to a motion from the Justice Department to block former President Trump from disclosing information relating to the Mar-a-Lago case, after prosecutors said the investigation remains ongoing. The order sides with the Justice Department in allowing Trump to see evidence collected in the case — including classified documents — but…",
      "url": "https://thehill.com/regulation/court-battles/4056871-judge-orders-trump-not-to-disclose-evidence-in-documents-case/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/06/648ba23e521898.84976245-e1686878590376.jpeg?w=1280",
      "publishedAt": "2023-06-19T14:40:59Z",
      "content": "A federal magistrate judge Monday agreed to a motion from the Justice Department to block former President Trump from disclosing information relating to the Mar-a-Lago case, after prosecutors said the investigation remains ongoing.\nThe order sides wi... [995 chars]"
    }
  ]
}
