{
  "status": "ok",
  "totalResults": 26,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "The New York Times"
      },
      "author": "The New York Times",
      "title": "Inside Trump’s Decision to Skip the G.O.P. Debate",
      "description": "Fox News leaned on the former president privately and publicly to join the debate. But all the while he was proceeding with a plan for his own counterprogramming.",
      "url": "https://www.nytimes.com/2023/08/19/us/politics/trump-fox-debate.html",
      "urlToImage": "https://static01.nyt.com/images/2023/08/19/multimedia/19pol-fox-debate-kjqf/19pol-fox-debate-kjqf-facebookJumbo.jpg",
      "publishedAt": "2023-08-19T20:44:06Z",
      "content": "The former president has told aides that he has made up his mind not to participate in the debate and has decided to post an online interview with Tucker Carlson that night instead. The interview with Mr. Carlson has already been taped, according to ... [1530 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Sunday shows preview: Trump Georgia charges cast shadow on debate; Maui reels from deadly wildfires",
      "description": "Ahead of next week’s Republican presidential primary debate, former President Trump’s latest indictment in Georgia and his potential absence from the debate stage will likely dominate the Sunday talk show circuit this weekend. Trump and 18 others were indicted by a Georgia grand jury on Monday, following a more than two-year investigation into efforts to overturn the…",
      "url": "https://thehill.com/homenews/sunday-talk-shows/4160309-sunday-shows-preview-trump-georgia-charges-cast-shadow-on-debate-maui-reels-from-deadly-wildfires/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/08/wildfires_-_trump.png?w=1280",
      "publishedAt": "2023-08-19T20:33:46Z",
      "content": "Ahead of next week’s Republican presidential primary debate, former President Trump’s latest indictment in Georgia and his potential absence from the debate stage will likely dominate the Sunday talk show circuit this weekend.\nTrump and 18 others wer... [4614 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "DeSantis’ ‘listless vessels’ remark causes MAGA world to lash out",
      "description": "Trump campaign and supporters push comparisons to Hillary Clinton's 'deplorables' remark.",
      "url": "https://www.politico.com/news/2023/08/19/desantis-trump-listless-vessels-00111971",
      "urlToImage": "https://static.politico.com/22/23/f3da8d8749bdb33cd2063c695ad9/https-delivery-gettyimages.com/downloads/1608116142",
      "publishedAt": "2023-08-19T20:17:12Z",
      "content": "A Trump-aligned super PAC also blasted DeSantis’ statement.\n“To Hillary Clinton, Trump supporters are ‘deplorables.’ To Ron DeSantis, they are ‘listless vessels.’ The truth is, Trump supporters are patriots,” MAGA, Inc. spokesperson Karoline Leavitt ... [1792 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "TheJournal.ie"
      },
      "author": "TheJournal.ie",
      "title": "Larry Donnelly: If we had no Trump or Biden for 2024",
      "description": "Our columnist says despite the expected rerun of the 2020 elections with Biden and Trump, it’s worth asking if there are any alternatives.",
      "url": "https://www.thejournal.ie/readme/trump-biden-2024-6145727-Aug2023/",
      "urlToImage": "https://img2.thejournal.ie/article/6145727/river/?height=400&version=6145733",
      "publishedAt": "2023-08-19T20:00:26Z",
      "content": "IN MEDIA CIRCLES, August is often described as the silly season. It is a month when many people take holidays and try to enjoy a period of rest and relaxation prior to September and going back to the daily grind or to school or university. Some engag... [8652 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Democrats' Ultimate 'Hail Mary' Against Trump Won't Work: Legal Analyst",
      "description": "Lawyers say that Trump's attempts to overturn the 2020 election amount to insurrection, thus making it unconstitutional for him to run for president.",
      "url": "https://www.newsweek.com/democrats-ultimate-hail-mary-against-trump-wont-work-legal-analyst-1821073",
      "urlToImage": "https://d.newsweek.com/en/full/2271938/donald-trump.jpg",
      "publishedAt": "2023-08-19T16:24:53Z",
      "content": "Democrats who have pushed the 14th Amendment theory in regard to Donald Trump becoming president again in 2024 have bet on a \"Hail Mary pass\" that won't work, according to Jonathan Turley, a law professor at George Washington University.\nThe 14th Ame... [4483 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CNN Philippines"
      },
      "author": "CNN Philippines",
      "title": "Legal scholars increasingly raise constitutional argument that Trump should be barred from presidency",
      "description": "Prominent conservative legal scholars are increasingly raising a constitutional argument that 2024 Republican candidate Donald Trump should be barred from the presidency because of his actions to overturn the previous presidential election result.",
      "url": "https://www.cnnphilippines.com/world/2023/8/20/Legal-scholars-argue-Trump-should-be-barred-from-presidency.html",
      "urlToImage": "https://www.cnnphilippines.com/.imaging/default/dam/cnn/2023/8/20/Donald-Trump-0820_CNNPH.jpg/jcr:content.jpg?width=750&height=450&crop:1:1,smart",
      "publishedAt": "2023-08-19T16:00:00Z",
      "content": "(CNN) — Prominent conservative legal scholars are increasingly raising a constitutional argument that 2024 Republican candidate Donald Trump should be barred from the presidency because of his actions to overturn the previous presidential election re... [5573 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Biden sells border wall parts to thwart GOP push to use them",
      "description": "President Biden is quietly selling off millions of dollars' worth of unused parts from former President Trump’s border wall for peanuts – apparently to stymie pending legislation in Congress.",
      "url": "https://nypost.com/2023/08/19/biden-sells-border-wall-parts-to-thwart-gop-push-to-use-them/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/08/newspress-collage-3pbqqgios-1692456879291.jpg?quality=75&strip=all&1692442524&w=1024",
      "publishedAt": "2023-08-19T14:53:44Z",
      "content": "The Biden administration is quietly auctioning off millions of dollars’ worth of unused parts from former President Trump’s border wall for peanuts – in an apparent end-run around pending legislation in Congress.\nSince April, GovPlanet, an online auc... [7106 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Chris Christie Blasts 'Coward' Donald Trump Ahead of GOP Debate",
      "description": "Trump appeared to rule out participating in debates by pointing to his polling lead and citing Ronald Reagan.",
      "url": "https://www.newsweek.com/chris-christie-blasts-coward-donald-trump-gop-debate-1821051",
      "urlToImage": "https://d.newsweek.com/en/full/2271909/chris-christie-speaks-new-hampshire.jpg",
      "publishedAt": "2023-08-19T14:18:05Z",
      "content": "Former New Jersey Governor Chris Christie has called former President Donald Trump a \"coward\" ahead of next week's Republican presidential debate where Trump is not expected to attend.\nChristie, who is running for the GOP's 2024 presidential nominati... [4326 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Trump Saying He Was Apple of Putin's Eye Sparks Condemnation",
      "description": "The former president suggested again that the Russia-Ukraine war would not have happened if he was still in office.",
      "url": "https://www.newsweek.com/trump-saying-he-was-apple-putins-eye-sparks-condemnation-1821060",
      "urlToImage": "https://d.newsweek.com/en/full/2271922/trump-condemned-putin-remarks.jpg",
      "publishedAt": "2023-08-19T13:48:11Z",
      "content": "Former President Donald Trump faced condemnation on social media for saying he was the apple of Russian President Vladimir Putin's eye.\nTrump touted his relationship with Putin during an interview on Fox Business on Thursday. The former president has... [4232 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "UPI News"
      },
      "author": "UPI News",
      "title": "Judge in E. Jean Carroll defamation suit dismisses Trump's request for trial delay",
      "description": "The federal judge in writer E. Jean Carroll's defamation lawsuit against former President Donald Trump has dismissed the latest effort by Trump's attorneys to delay a trial scheduled for January.",
      "url": "https://www.upi.com/Top_News/US/2023/08/19/Judge-Trump-defamation-lawsuit-dismisses-request-trial-delay/5541692447481/",
      "urlToImage": "https://cdnph.upi.com/sv/ph/og/upi/5541692447481/2023/1/ae479eb78b9dbcdfebaaa8f429fe7b9c/v1.5/Judge-in-E-Jean-Carroll-defamation-suit-dismisses-Trumps-request-for-trial-delay.jpg",
      "publishedAt": "2023-08-19T13:15:15Z",
      "content": "A federal judge has ruled that a trial in E. Jean Carroll's defamation suit against former president Donald Trump should not be stayed as Trump's legal team files \"frivolous\" appeals. File Photo by Louis Lanzano /UPI | License Photo\nAug. 19 (UPI) -- ... [2019 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CP24 Toronto"
      },
      "author": "CP24 Toronto",
      "title": "Trump looms large over Iowa State Fair, but many GOP voters still mulling their caucus choices",
      "description": "The loop Donald Trump's private jet made above the Iowa State Fair before his visit last weekend was more than just a gesture to the hundreds of supporters — and a few rival candidates — on the ground. It was a reminder that the four-time indicted former president casts a Boeing 757-sized shadow over the race for the 2024 Republican presidential nomination.",
      "url": "https://www.cp24.com/world/trump-looms-large-over-iowa-state-fair-but-many-gop-voters-still-mulling-their-caucus-choices-1.6526025",
      "urlToImage": "https://www.cp24.com/polopoly_fs/1.6520329.1692125956!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
      "publishedAt": "2023-08-19T12:44:24Z",
      "content": "The Associated Press\nDES MOINES, Iowa (AP) — The loop Donald Trump's private jet made above the Iowa State Fair before his visit last weekend was more than just a gesture to the hundreds of supporters — and a few rival candidates — on the ground. It ... [8027 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "Why the latest abortion pill ruling has enviros rolling their eyes",
      "description": "Courts have said that people who like plants and animals can sue when wildlife is harmed. People who \"delight\" in fetuses should have the same right, a Trump-appointed judge wrote.",
      "url": "https://www.politico.com/news/2023/08/19/abortion-pill-ruling-environment-00111843",
      "urlToImage": "https://static.politico.com/ba/85/b0a0327a4e11943f288cfdf1e03f/mag-ward-commongood-secondary6.jpg",
      "publishedAt": "2023-08-19T11:00:00Z",
      "content": "“Unborn babies are a source of profound joy for those who view them,” he continued. “Expectant parents eagerly share ultrasound photos with loved ones. Friends and family cheer at the sight of an unborn child. Doctors delight in working with their un... [5002 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "‘It baffles me’: what drew a mild lawyer with a liberal past into Trump’s election plot?",
      "description": "Kenneth Chesebro – low-profile, bright, seemingly decent – is not your average Trump guy. So how did he become the architect of the election subversion scandal?",
      "url": "https://www.theguardian.com/us-news/2023/aug/19/kenneth-chesebro-trump-georgia-indictment-fake-electors",
      "urlToImage": "https://i.guim.co.uk/img/media/53d2ab37462ee27b46677d636e096bb1a54fe27d/214_0_6362_3819/master/6362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4a55e38f00e5770cd77c8c8938c0f3bc",
      "publishedAt": "2023-08-19T10:00:16Z",
      "content": "One individual stands out among the 18 Donald Trump acolytes who were indicted in Georgia this week over their participation in the former president’s alleged racketeering enterprise to overturn the 2020 election.\nHe is distinct not for his chutzpah ... [11339 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "‘America First 2.0’: Vivek Ramaswamy pitches to be Republicans’ next Trump",
      "description": "The candidate is emerging as a challenger – however slight – in a race still thoroughly dominated by the former president",
      "url": "https://www.theguardian.com/us-news/2023/aug/19/vivek-ramaswamy-republican-presidential-nomination-candidate",
      "urlToImage": "https://i.guim.co.uk/img/media/361b77980bf1d98e3a264296c2d83e19db82e466/0_364_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d88ea6be626e7fd3e1d35fd3466adaf6",
      "publishedAt": "2023-08-19T10:00:16Z",
      "content": "Vivek Ramaswamy was at the Iowa state fair, a must-visit destination for any presidential candidate, when he decided to rap.\nWearing a red cap and a baggy white polo shirt, the millennial founder of a biotech company launched into a spirited renditio... [11129 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Slate"
      },
      "author": "Slate",
      "title": "Donald Trump should turn himself in to jail and create a diversion.",
      "description": "It’s his best option for sucking up all the attention.",
      "url": "https://slate.com/news-and-politics/2023/08/the-surge-donald-trump-ron-desantis-vivek-ramaswamy-debate.html",
      "urlToImage": "https://compote.slate.com/images/1c9e493b-750e-44da-ba1c-597538c374b8.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560",
      "publishedAt": "2023-08-19T09:45:00Z",
      "content": "Welcome to this weekend of the Surge, Slate’s newsletter that, through the veneer of “politics news,” muses on the nature of man’s place in the universe.\nThe first Republican presidential debate is coming up next week. And while we don’t know whether... [497 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Inquisitr"
      },
      "author": "The Inquisitr",
      "title": "Trump Breaks Silence on Georgia Indictment in On-Camera Statement, ‘I Have Four of Them Now’",
      "description": "The charges are the result of a careful examination of the of Donald Trump and his supporters to overturn President Joe Biden's victory in the state.",
      "url": "https://www.inquisitr.com/trump-breaks-silence-on-georgia-indictment-in-on-camera-statement-i-have-four-of-them-now",
      "urlToImage": "https://dab57h0r8ahff.cloudfront.net/639954/uploads/29dc4690-3db9-11ee-8949-2114cbfc73d4_800_420.jpeg",
      "publishedAt": "2023-08-19T09:00:07Z",
      "content": "Former President Donald Trump has spoken out on camera about the recently revealed Georgia indictment against him, calling the accusations a \"witch hunt\" and expressing fear for the consequences for the nation. Trump is charged in the indictment with... [3789 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "If Trump Wins Election Before Georgia Trial Ends, All Hell Breaks Loose",
      "description": "Trump could be an incoming president or already in office by the time a Fulton County jury returns its verdict in Fani Willis' RICO case.",
      "url": "https://www.newsweek.com/donald-trump-win-2024-election-fani-willis-georgia-trial-1820880",
      "urlToImage": "https://d.newsweek.com/en/full/2271623/donald-trump-georgia.jpg",
      "publishedAt": "2023-08-19T07:00:01Z",
      "content": "There is the potential for an unprecedented legal and constitutional battle next year involving Donald Trump, his trial in Georgia, and the results of the 2024 election, a legal expert has told Newsweek.\nTrump was indicted under Fulton County Distric... [5015 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sky News"
      },
      "author": "Sky News",
      "title": "Donald Trump chooses Tucker Carlson interview over Republican primary debate",
      "description": "The former president has long suggested he would give the event a miss, arguing it made no sense for him to give the other candidates a chance to attack him.",
      "url": "https://news.sky.com/story/donald-trump-chooses-tucker-carlson-interview-over-republican-primary-debate-12942747",
      "urlToImage": "https://e3.365dm.com/23/08/1600x900/skynews-donald-trump-tucker-carlson_6255361.jpg?20230819040111",
      "publishedAt": "2023-08-19T07:00:00Z",
      "content": "Donald Trump will skip the first Republican primary debate next week in favour of an interview with former Fox News host Tucker Carlson, according to reports.\nThe former president has hinted for months that he would sidestep the Milwaukee-based event... [2575 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "ThePrint"
      },
      "author": "ThePrint",
      "title": "Trump expected to surrender in Georgia next week - 4 indictments brought against former US president",
      "description": "Former US President Trump faced four indictments in as many months, adding up to 91 criminal counts across 4 separate cases in Georgia, Florida, Washington & New York.",
      "url": "https://theprint.in/theprint-essential/trump-expected-to-surrender-in-georgia-next-week-4-indictments-brought-against-former-us-president/1720690/",
      "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/08/Donald-Trump-file-COMMONS.jpg",
      "publishedAt": "2023-08-19T05:15:50Z",
      "content": "Trump has been facing a wave of legal investigations on a series of charges including forgery, soliciting public officers, hoarding classified documents in his private residence in Mar-a-Lago and attempting to overturn the 2020 election. On the whole... [9548 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo News"
      },
      "author": "Yahoo News",
      "title": "Ex-Adviser Predicts Trump Will 'Suck All The Oxygen' From GOP Debate With 1 Move",
      "description": "Jason Osborne, an ex-Trump adviser, named how the former president will try to overshadow the GOP debate \"right before\" or during the event.",
      "url": "https://news.yahoo.com/ex-adviser-predicts-trump-suck-045044937.html",
      "urlToImage": "https://media.zenfs.com/en/the_huffington_post_584/bac738350d80be5a880b282c04a98a64",
      "publishedAt": "2023-08-19T04:50:44Z",
      "content": "Jason Osborne, an adviser for Donald Trump’s 2016 campaign, broke down how the former president could “suck all the oxygen out of the room” if he turns himself in to Georgia authorities just before – or during – the first GOP primary debate on Wednes... [1718 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Georgia election meddling case: Trump expected to surrender next week",
      "description": "United States former President Donald Trump is expected to surrender himself to the Fulton County jail next week in connection with the efforts to overturn the 2020 election results.",
      "url": "https://www.devdiscourse.com/article/international/2563349-georgia-election-meddling-case-trump-expected-to-surrender-next-week",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_08_2023_03_47_34_5131403.jpg?width=920&format=jpeg",
      "publishedAt": "2023-08-19T03:47:36Z",
      "content": "United States former President Donald Trump is expected to surrender himself to the Fulton County jail next week in connection with the efforts to overturn the 2020 election results in Georgia, CNN reported citing sources. On Monday, Trump and 18 co-... [2138 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Reuters"
      },
      "author": "Reuters",
      "title": "Trump to skip Republican debate, interview with ex-Fox host Carlson -NYT",
      "description": "Former U.S. President Donald Trump plans to skip the first Republican primary debate next week and instead sit for an online interview with former Fox News host Tucker Carlson, the New York Times reported, citing people briefed on the matter.",
      "url": "https://www.reuters.com/world/us/trump-plans-skip-republican-debate-interview-with-ex-fox-host-carlson-nyt-2023-08-18/",
      "urlToImage": "https://www.reuters.com/resizer/V6rA9RzBqnJb98EfLNYV5jJCH5s=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/DO6TJSI5KVO4FPQNXGLH2K4GYE.jpg",
      "publishedAt": "2023-08-19T03:22:15Z",
      "content": "WASHINGTON, Aug 18 (Reuters) - Former U.S. President Donald Trump plans to skip the first Republican primary debate next week and instead sit for an online interview with former Fox News host Tucker Carlson, the New York Times reported, citing people... [2592 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Washington Examiner"
      },
      "author": "Washington Examiner",
      "title": "Chris Christie pressures Donald Trump on RNC debate: 'Stop being such a coward'",
      "description": "Former New Jersey GOP Gov. Chris Christie attempted to pressure former President Donald Trump on Friday into participating in the first Republican presidential debate next week by calling the former president a \"coward.\"",
      "url": "https://www.washingtonexaminer.com/news/campaigns/chris-christie-pressures-trump-rnc-debate",
      "urlToImage": "https://mediadc.brightspotcdn.com/dims4/default/9f6aeea/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F26%2F8d%2Fee687c3f4036970c5cc0d5a0095c%2Fcollage-maker-14-jul-2023-10-09-pm-5486.jpg",
      "publishedAt": "2023-08-19T02:52:00Z",
      "content": "Former New Jersey GOP Gov. Chris Christie attempted to pressure former President Donald Trump on Friday into participating in the first Republican presidential debate next week by calling the former president a \"coward.\"\nChristie urged the former pre... [2401 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo News"
      },
      "author": "Yahoo News",
      "title": "Former White House lawyer on Trump’s expected surrender in Georgia: ‘He won’t enjoy it’",
      "description": "Former White House lawyer Ty Cobb on Friday said while former President Trump’s expected surrender in Georgia next week likely won’t rattle him, “he won’t enjoy it.” Asked how the reputation of the jail in Fulton County, Ga., may affect Trump psychologically, Cobb suggested the impact would be miniscule. “I do think it will have…",
      "url": "https://news.yahoo.com/former-white-house-lawyer-trump-023852020.html",
      "urlToImage": "https://media.zenfs.com/en/the_hill_articles_341/b199cf48543c2bcac58dacdc57717e4d",
      "publishedAt": "2023-08-19T02:38:52Z",
      "content": "Former White House lawyer Ty Cobb on Friday said while former President Trump’s expected surrender in Georgia next week likely won’t rattle him, “he won’t enjoy it.”\nAsked how the reputation of the jail in Fulton County, Ga., may affect Trump psychol... [2392 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "The Indian Express",
      "title": "Express View on US politics: The Vivek Ramaswamy test",
      "description": "India-origin dark horse for Republican nomination is making waves. His entry provides insight into post-Trump politics",
      "url": "https://indianexpress.com/article/opinion/editorials/express-view-on-us-politics-the-vivek-ramaswamy-test-8898965/",
      "urlToImage": "https://images.indianexpress.com/2023/08/express-view-23.jpg",
      "publishedAt": "2023-08-19T01:55:38Z",
      "content": "Attack Joe Biden 3-5 times” is rather obvious. But two other pieces of advice in the leaked memos about what Florida Governor and contender for the Republican presidential nomination (as reported by The New York Times), Ron DeSantis, should do in the... [2610 chars]"
    }
  ]
}
