{
  "status": "ok",
  "totalResults": 476,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Trump announces picks for IRS, SEC, NASA and a new 'hostage affairs' envoy",
      "description": "President-elect Donald Trump announced a slew of new administration picks on Wednesday, including his choices to head the Securities and Exchange Commission, the IRS and NASA — as well as the first ever envoy for \"hostage affairs.\"",
      "url": "https://nypost.com/2024/12/04/us-news/trump-announces-picks-for-irs-sec-nasa-and-a-new-hostage-affairs-envoy/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/12/republican-presidential-nominee-former-president-94751311.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-12-04T23:56:39Z",
      "content": "President-elect Donald Trump announced a slew of new administration picks on Wednesday, including his choices to head the Securities and Exchange Commission, the IRS and NASA — as well as the first ever envoy for “hostage affairs.”\nThe move comes as ... [9085 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Bold Appointments Amidst Legal Battles and Policy Shifts",
      "description": "The summary discusses recent U.S. domestic news headlines, including Trump's legal attempts to dismiss a Georgia case against him and his controversial appointments to key government positions. Additionally, a notable incident involving the targeted killing of a UnitedHealth executive highlights ongoing safety concerns.",
      "url": "https://www.devdiscourse.com/article/politics/3182159-trumps-bold-appointments-amidst-legal-battles-and-policy-shifts",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/24_07_2024_05_00_43_2881022.png?width=920&format=jpeg",
      "publishedAt": "2024-12-04T23:53:24Z",
      "content": "In a series of dynamic moves, President-elect Donald Trump has sought the dismissal of a Georgia case alleging his efforts to overturn the 2020 election results, challenging their constitutional validity. Meanwhile, Trump's strategic appointments sig... [620 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Hegseth on shaky ground",
      "description": "Welcome to The Hill’s Defense & NatSec newsletter {beacon} Defense &National Security Defense &National Security   The Big Story  Hegseth doubles down amid growing scrutiny Pete Hegseth, President-elect Trump’s embattled pick for Defense secretary, spent Wednesday racing to keep his nomination moving forward amid growing scrutiny on Capitol Hill. © AP He reiterated Wednesday afternoon that he…",
      "url": "https://thehill.com/newsletters/defense-national-security/5023252-hegseth-on-shaky-ground/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/12/Top-Hegseth_112124_AP_Rob-Lamkey.jpg?w=1280",
      "publishedAt": "2024-12-04T23:53:00Z",
      "content": "He reiterated Wednesday afternoon that he wouldn’t back down from the fight. In an op-ed published by the Wall Street Journal, he condemned the press for what he described as a “manufactured media takedown” of him.\nHe also appeared on conservative co... [1262 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Democrats Want Republicans to Confirm Donald Trump Can't Serve Third Term",
      "description": "The resolution addresses Trump's jokes about serving beyond two terms, which have raised concerns among Democrats.",
      "url": "https://www.newsweek.com/democrats-want-republicans-confirm-donald-trump-third-term-1995774",
      "urlToImage": "https://d.newsweek.com/en/full/2536427/donald-trump.jpg",
      "publishedAt": "2024-12-04T23:49:00Z",
      "content": "Democrats in Congress are pressing their Republican colleagues to unequivocally confirm that President-elect Donald Trump is constitutionally barred from serving a third term.\nRepresentative Dan Goldman, a New York Democrat, introduced a resolution i... [2663 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Inquisitr"
      },
      "author": "The Inquisitr",
      "title": "Don Jr. Looks Unrecognizable in Old Photo With Both Vanessa Trump And Kimberly Guilfoyle",
      "description": "His life took a drastic turn once Vanessa filed for divorce and both pursued a new chapter after their 12-year marriage.",
      "url": "https://www.inquisitr.com/don-jr-looks-unrecognizable-in-old-photo-with-both-vanessa-trump-and-kimberly-guilfoyle",
      "urlToImage": "https://dab57h0r8ahff.cloudfront.net/727106/uploads/b459f170-b23c-11ef-9de0-b965bd35abb7_1200_630.jpeg",
      "publishedAt": "2024-12-04T23:45:00Z",
      "content": "In the world of high-profile personalities, personal evolution at times can be as dramatic as political landscapes. Donald Trump Jr. recently found himself back in the spotlight after resurfaced pictures revealed a strikingly different version of him... [4002 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "UPI News"
      },
      "author": "UPI News",
      "title": "Trump asks Georgia court to toss election interference case after presidential win",
      "description": "President-elect Donald Trump's legal team is asking the Georgia Court of Appeals to toss the state's election interference case against him on the grounds prosecution is unconstitutional.",
      "url": "https://www.upi.com/Top_News/US/2024/12/04/Donald-Trump-motion-georgia-election-interference-dismissal/5081733353223/",
      "urlToImage": "https://cdnph.upi.com/sv/ph/og/upi/5081733353223/2024/1/fa5089a1997521044cd41648d685f411/v1.5/Trump-asks-Georgia-court-to-toss-election-interference-case-after-presidential-win.jpg",
      "publishedAt": "2024-12-04T23:42:41Z",
      "content": "President-elect Donald Trump and his legal team filed a motion Wednesday, asking the Georgia Court of Appeals to toss the state's election interference case against him on the grounds \"a sitting president is completely immune from indictment or any c... [2682 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Kash Patel, Trump’s pick to be FBI director, targeted in Iranian-backed cyberattack",
      "description": "The FBI recently told Kash Patel, President-elect Donald Trump’s pick to be the bureau’s next director, that he was the target of an Iranian cyberattack",
      "url": "https://www.nbcnews.com/investigations/kash-patel-trumps-pick-fbi-director-targeted-iranian-backed-cyberattac-rcna182905",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241113-Kash-Patel-ch-1040-4b7875.jpg",
      "publishedAt": "2024-12-04T23:38:04Z",
      "content": "The FBI recently told Kash Patel, President-elect Donald Trump’s pick to be the bureau’s next director, that he was the target of an Iranian cyberattack, two senior law enforcement officials told NBC News.\nThe exact timing of the cyberattack is uncle... [1699 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Trump picks former Sen. Kelly Loeffler for small business administrator",
      "description": "President-elect Donald Trump announced Wednesday that he will nominate former Sen.",
      "url": "https://www.nbcnews.com/politics/donald-trump/trump-kelly-loeffler-small-business-administration-rcna181412",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241122-Kelly-Loeffler-aa-158p-0d926d.jpg",
      "publishedAt": "2024-12-04T23:33:00Z",
      "content": "President-elect Donald Trump announced Wednesday that he will nominate former Sen. Kelly Loeffler, R-Ga., to lead the Small Business Administration in his second term.\n\"I am very pleased to nominate business leader and former U.S. Senator Kelly Loeff... [2146 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Washington Examiner"
      },
      "author": "Washington Examiner",
      "title": "Trump to join NBC’s Meet the Press in first post-election network interview",
      "description": "President-elect Donald Trump will sit down with NBC's Sunday show \"Meet the Press\" in his first network interview since winning the presidential election.",
      "url": "https://www.washingtonexaminer.com/politics/3250440/trump-nbc-meet-the-press-post-election-interview/",
      "urlToImage": "https://www.washingtonexaminer.com/wp-content/uploads/2024/12/Donald-Trump.webp",
      "publishedAt": "2024-12-04T23:32:38Z",
      "content": "President-elect Donald Trump will sit down with NBC’s Sunday show Meet the Press in his first network interview since winning the presidential election.\nThe interview will be pretaped on Friday and will air on Sunday, Dec. 8.\nThe NBC interview will b... [1743 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "manilastandard.net"
      },
      "author": "manilastandard.net",
      "title": "Trump names billionaire private astronaut as next NASA chief",
      "description": "US President-elect Donald Trump on Wednesday nominated Jared Isaacman, a billionaire online payments entrepreneur and the first private astronaut to",
      "url": "https://manilastandard.net/news/314532211/trump-names-billionaire-private-astronaut-as-next-nasa-chief.html",
      "urlToImage": "https://cdn.manilastandard.net/wp-content/uploads/2024/05/nasa.jpg",
      "publishedAt": "2024-12-04T23:30:00Z",
      "content": "US President-elect Donald Trump on Wednesday nominated Jared Isaacman, a billionaire online payments entrepreneur and the first private astronaut to conduct a spacewalk, as the next head of NASA.\nThe nod raises questions about potential conflicts of ... [3697 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump names Kelly Loeffler for SBA",
      "description": "President-elect Trump announced plans to nominate former Sen. Kelly Loeffler (R-Ga.) to serve as administrator of the Small Business Administration (SBA). “Small Businesses are the backbone of our Great Economy. Kelly will bring her experience in business and Washington to reduce red tape, and unleash opportunity for our Small Businesses to grow, innovate, and thrive,”…",
      "url": "https://thehill.com/homenews/administration/5023192-trump-kelly-loeffler-small-business-administration/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/09/AP23251524587127-1-e1694206742238.jpg?w=1280",
      "publishedAt": "2024-12-04T23:27:53Z",
      "content": "President-elect Trump announced plans to nominate former Sen. Kelly Loeffler (R-Ga.) to serve as administrator of the Small Business Administration (SBA).\n“Small Businesses are the backbone of our Great Economy. Kelly will bring her experience in bus... [903 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBC.ca"
      },
      "author": "CBC.ca",
      "title": "Trudeau accuses Poilievre of failing to put politics aside in face of Trump tariff threat",
      "description": "Prime Minister Justin Trudeau accused Conservative Leader Pierre Poilievre on Wednesday of being unable to put partisanship aside in the face of Donald Trump’s tariff threat.",
      "url": "https://www.cbc.ca/news/politics/trudeau-poilievre-trump-tariffs-1.7401284",
      "urlToImage": "https://i.cbc.ca/1.7401309.1733345599!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/commons-20241127.JPG",
      "publishedAt": "2024-12-04T23:23:09Z",
      "content": "Prime Minister Justin Trudeau accused Conservative Leader Pierre Poilievre on Wednesday of being unable to put partisanship aside in the face of Donald Trump's tariff threat.\nTrudeau flew to Florida last week to meet with the U.S. president-elect aft... [5703 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump names Billy Long as IRS head",
      "description": "President-elect Donald Trump said he would nominate Rep. Billy Long (R-Miss.) to serve as the Commissioner of the Internal Revenue Service (IRS) in a post on Truth Social.",
      "url": "https://thehill.com/homenews/administration/5023124-trump-names-billy-long-as-irs-head/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/12/AP17123558469182.jpg?w=1280",
      "publishedAt": "2024-12-04T23:16:15Z",
      "content": "President-elect Trump said he would nominate former Rep. Billy Long (R-Mo.) to serve as the commissioner of the Internal Revenue Service (IRS) in a Wednesday post on Truth Social.\n“I am pleased to announce that former Congressman Billy Long, of the G... [1776 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Salon"
      },
      "author": "Salon",
      "title": "\"Outrageously powerful and incredibly secret\": Yes, Trump can wield CIA, FBI for his own ends",
      "description": "Intelligence veterans say Trump can quickly move to reshape agencies and launch surveillance of his opponents",
      "url": "https://www.salon.com/2024/12/04/outrageously-powerful-and-incredibly-secret-yes-can-wield-cia-fbi-for-his-own-ends/",
      "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media2.salon.com/2024/12/tulsi_gabbard_john_ratcliffe_donald_trump_1679579829_1211871035_2184849126.jpg",
      "publishedAt": "2024-12-04T23:10:15Z",
      "content": "Donald Trump's war against the \"deep state\" and his political opponents appears to be on a collision course with U.S. intelligence and law enforcement agencies. Those familiar with Trump's plans say that after his incoming administration takes power ... [13862 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Associated Press"
      },
      "author": "The Associated Press",
      "title": "Trump taps crypto advocate Paul Atkins to lead SEC",
      "description": "President-elect Donald Trump says he intends to nominate cryptocurrency advocate Paul Atkins to chair the Securities and Exchange Commission.",
      "url": "https://apnews.com/article/sec-chair-atkins-gensler-investors-financial-markets-d1c544f1846071b33c75b9f2dd0c1ba4",
      "urlToImage": "https://dims.apnews.com/dims4/default/72e71b8/2147483647/strip/true/crop/3998x2249+0+208/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fe5%2Fd3%2F3c8094fde7ef13a434a4163320b4%2F5cb751d63ddc4b808ea4469a68ae1bdd",
      "publishedAt": "2024-12-04T23:07:35Z",
      "content": "President-elect Donald Trump announced Wednesday that he intends to nominate cryptocurrency advocate Paul Atkins to chair the Securities and Exchange Commission.\nTrump said Atkins, the CEO of Patomak Partners and a former SEC commissioner, was a “pro... [4117 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump Taps Kelly Loeffler to Lead SBA",
      "description": "President-elect Donald Trump announced the appointment of former Senator Kelly Loeffler to lead the Small Business Administration. Trump praised Loeffler's business and political experience, emphasizing her ability to reduce regulations and promote growth for small businesses.",
      "url": "https://www.devdiscourse.com/article/politics/3182146-trump-taps-kelly-loeffler-to-lead-sba",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_12_2024_09_46_56_5920296.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-04T23:03:59Z",
      "content": "President-elect Donald Trump has selected former Senator Kelly Loeffler to head the Small Business Administration, according to a statement released Wednesday.\nTrump cited Loeffler's extensive experience in both business and the political sphere, sta... [268 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FreightWaves"
      },
      "author": "FreightWaves",
      "title": "Despite tariff talk, CPKC expects to tap cross-border traffic growth",
      "description": "Canadian Pacific Kansas City CEO Keith Creel is confident that free trade will continue in North America despite President-elect Donald J. Trump’s threat to impose 25% tariffs on goods imported from Mexico and Canada.",
      "url": "https://www.freightwaves.com/news/despite-tariff-talk-cpkc-expects-to-tap-cross-border-traffic-growth",
      "urlToImage": "https://www.freightwaves.com/uploads/2024/12/05/CP_KCS_4.jpg",
      "publishedAt": "2024-12-04T23:00:00Z",
      "content": "This story originally appeared on Trains.com.\nPALM BEACH, Fla. — Canadian Pacific Kansas City CEO Keith Creel is confident that free trade will continue in North America despite President-elect Donald J. Trump’s threat to impose 25% tariffs on goods ... [4379 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Unrealistic Deportation: Cuba Criticizes Trump's Immigration Plan",
      "description": "Cuba's Vice Foreign Minister Carlos Fernandez de Cossio criticized the Trump administration's unrealistic deportation plan targeting mass numbers of immigrants, including Cubans. De Cossio emphasized the need for deportation plans to comply with existing U.S.-Cuba accords. The Trump proposal wasn't discussed in recent U.S.-Cuba dialogues.",
      "url": "https://www.devdiscourse.com/article/law-order/3182145-unrealistic-deportation-cuba-criticizes-trumps-immigration-plan",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/14_08_2024_18_23_07_6625992.png?width=920&format=jpeg",
      "publishedAt": "2024-12-04T22:59:03Z",
      "content": "Cuba has voiced strong opposition to the Trump administration's plan to deport large numbers of immigrants living in the U.S., criticizing it as both unrealistic and unjust.\nVice Foreign Minister Carlos Fernandez de Cossio emphasized that any deporta... [328 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "GOP Sen. Bill Cassidy draws primary challenger citing Trump impeachment vote",
      "description": "Louisiana State Treasurer John Fleming announced he would challenge GOP Sen. Bill Cassidy, who voted to convict Trump after his 2021 impeachment trial.",
      "url": "https://www.nbcnews.com/politics/congress/gop-sen-bill-cassidy-draws-primary-challenger-trump-impeachment-rcna182940",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-05/220523-bill-cassidy-ac-425p-44f772.jpg",
      "publishedAt": "2024-12-04T22:53:00Z",
      "content": "Sen. Bill Cassidy, R-La., will face at least one primary challenger in 2026, with Louisiana Treasurer John Fleming announcing Wednesday that he will run for the seat held by the two-term senator, citing Cassidy’s vote to convict Donald Trump after hi... [2104 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Variety"
      },
      "author": "Variety",
      "title": "Jeff Bezos Willing to Work With Trump to Remove Regulatory Barriers",
      "description": "Amazon founder Jeff Bezos said he's willing to work with Donald Trump to dismantle government regulations that hinder economic growth.",
      "url": "https://variety.com/2024/biz/news/jeff-bezos-work-with-trump-remove-regulations-1236235126/",
      "urlToImage": "https://variety.com/wp-content/uploads/2024/12/Jeff-Bezos.jpg?w=1000&h=563&crop=1",
      "publishedAt": "2024-12-04T22:52:55Z",
      "content": "Amazon founder Jeff Bezos said he’s willing to work with President-elect Donald Trump to dismantle government regulations that hinder economic growth.\nThe U.S. imposes “excessive permitting and regulation,” Bezos said, speaking at the New York Times’... [3775 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Huffington Post"
      },
      "author": "The Huffington Post",
      "title": "Pete Hegseth Vows To Stay Sober If Confirmed As Secretary Of Defense",
      "description": "President-elect Trump supposedly told Hegseth he still had his support amid an onslaught of misconduct accusations.",
      "url": "https://www.huffpost.com/entry/pete-hegseth-vows-to-stay-sober-if-confirmed-as-secretary-of-defense_n_675080c0e4b09625c75666e0",
      "urlToImage": "https://img.huffingtonpost.com/asset/6750ab581900002c0090077a.jpeg?cache=8DVitfcai6&ops=1200_630",
      "publishedAt": "2024-12-04T22:49:26Z",
      "content": "LOADING ERROR LOADING\nFormer Fox News host Pete Hegseth addressed concerns over his use of alcohol in an interview with a former colleague, Megyn Kelly, pledging not to drink on the job if confirmed to oversee the vast U.S. military apparatus.\nSince ... [4636 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Verge"
      },
      "author": "The Verge",
      "title": "Jeff Bezos says he’s ‘very optimistic this time around’ about Trump",
      "description": "Even though he clashed with Trump before, the Amazon and Blue Origin founder is very bullish on Donald Trump’s second term and Elon Musk’s DOGE.",
      "url": "https://www.theverge.com/2024/12/4/24313549/bezos-trump-optimistic-dealbook-summit-doge",
      "urlToImage": "https://cdn.vox-cdn.com/thumbor/noFcZEjUsNriHVwnYO2X9PStFbw=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23951506/VRG_Illo_STK173_L_Normand_JeffBezos_Positive2.jpg",
      "publishedAt": "2024-12-04T22:45:38Z",
      "content": "Jeff Bezos and President-elect Donald Trump famously didn’t get along the last time Trump was in the White House. This time, Bezos says he’s “very optimistic” and even wants to help out.\n“I’m actually very optimistic this time around,” Bezos said of ... [1193 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "TechCrunch"
      },
      "author": "TechCrunch",
      "title": "A billionaire private astronaut and SpaceX supporter may be the next NASA head",
      "description": "Incoming President Donald Trump has nominated Jared Isaacman, a billionaire entrepreneur and private astronaut, to lead NASA through what could be one of",
      "url": "https://techcrunch.com/2024/12/04/a-billionaire-private-astronaut-and-spacex-supporter-may-be-the-next-nasa-head/",
      "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/02/Jared_Isaacman_at_SpaceX_2.jpg?resize=1200,800",
      "publishedAt": "2024-12-04T22:44:15Z",
      "content": "Incoming President Donald Trump has nominated Jared Isaacman, a billionaire entrepreneur and private astronaut, to lead NASA through what could be one of the most consequential periods in the agency’s history.\nDuring the four years of Trump’s second ... [3228 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Ex-soldier, Iraq War vet is Trump’s pick for Army secretary",
      "description": "President-elect Donald Trump said Wednesday that he has selected a former soldier and Iraq War veteran to serve as his secretary of the Army, Daniel P. Driscoll.",
      "url": "https://www.chicagotribune.com/2024/12/04/trump-army-secretary-nominee/",
      "urlToImage": "https://www.chicagotribune.com/wp-content/uploads/2024/12/Trump_Army_Secretary_79737.jpg?w=1024&h=682",
      "publishedAt": "2024-12-04T22:31:02Z",
      "content": "WASHINGTON — President-elect Donald Trump said Wednesday that he has selected a former soldier and Iraq War veteran to serve as his secretary of the Army.\nDaniel P. Driscoll, who is from North Carolina, had been serving as a senior advisor to Vice Pr... [1823 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Donald Trump's Financial Legacy: Nominations and Economic Agenda",
      "description": "U.S. President-elect Donald Trump nominates University of Maryland finance professor Michael Faulkender as deputy U.S. Treasury secretary. Faulkender previously aided in implementing a pandemic relief program and has served as Treasury's assistant secretary of economic policy. His nomination aligns with Trump's America First Economic Agenda.",
      "url": "https://www.devdiscourse.com/article/politics/3182134-donald-trumps-financial-legacy-nominations-and-economic-agenda",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/11_03_2020_13_22_31_2034832.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-04T22:26:45Z",
      "content": "On Wednesday, President-elect Donald Trump announced the nomination of Michael Faulkender, a finance professor at the University of Maryland, for the role of deputy U.S. Treasury secretary. Faulkender's return to the Treasury Department marks a signi... [804 chars]"
    }
  ]
}