{
  "status": "ok",
  "totalResults": 435,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Trump should let SCOTUS back bans on puberty blockers for gender-confused kids",
      "description": "President-elect Donald Trump should let the Supreme Court rule in the Skrmetti case on puberty blockers for kids. It would then likely OK state bans on them, which would be a huge victory for child welfare.",
      "url": "https://nypost.com/2024/12/03/opinion/trump-should-let-scotus-back-bans-on-puberty-blockers-for-gender-confused-kids/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/12/newspress-collage-v8mevcv9y-1733268100576.jpg?quality=75&strip=all&1733252256&w=1024",
      "publishedAt": "2024-12-03T23:58:32Z",
      "content": "Parents of gender-distressed children are following the Supreme Court case US vs. Skrmetti with great anxiety.\nThe case raises the question of whether a Tennessee law banning puberty blockers and cross-sex hormones for purposes of changing a minor’s ... [5010 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Trump team agrees to DoJ background checks for nominees",
      "description": "Transition officials sign agreement after weeks-long delay as teams of investigators ready to process clearances",
      "url": "https://www.theguardian.com/us-news/2024/dec/03/trump-team-background-checks",
      "urlToImage": "https://i.guim.co.uk/img/media/149e0a972411ffcd443b8dc23a025eb48451f93a/0_112_7610_4566/master/7610.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=761618fed71cbfa5a303d5f0382fe035",
      "publishedAt": "2024-12-03T23:58:07Z",
      "content": "Donald Trump’s transition team on Tuesday signed an agreement to allow the US justice department conduct background checks on his nominees and appointees, after a weeks-long delay.\nThe step lets transition aides and future administration staffers of ... [2281 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Deadline",
      "title": "Bill Maher Threatens To Quit HBO’s ‘Real Time’ Over Donald Trump",
      "description": "Bill Maher revealed that he is considering quitting Real Time with Bill Maher, his HBO show that has been on the air since 2003.",
      "url": "https://deadline.com/2024/12/bill-maher-threatens-to-quit-real-time-1236193202/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2024/03/Real-Time-with-Bill-Maher.png?w=1024",
      "publishedAt": "2024-12-03T23:57:50Z",
      "content": "Bill Maher is considering throwing in the towel.\nThe comedian revealed that he is considering quitting Real Time with Bill Maher, his HBO show that has been on the air since 2003.\nSpeaking on his Club Random podcast alongside guest Jane Fonda, Maher ... [1289 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "US Politics Unveiled: Behind Closed Doors and Beyond",
      "description": "A glance at U.S. news highlights Senate Republicans gearing up for Trump’s legislative agenda, a cooling labor market, Texas’s power grid concerns, postal service hearings, and political calls for pardons. Also discussed are a recent election loss, bird flu impacts in California, booming Thanksgiving sales, and Trump’s ongoing legal challenges.",
      "url": "https://www.devdiscourse.com/article/politics/3180652-us-politics-unveiled-behind-closed-doors-and-beyond",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/21_08_2024_20_31_28_8830021.png?width=920&format=jpeg",
      "publishedAt": "2024-12-03T23:55:31Z",
      "content": "Amidst a shifting political landscape, U.S. Senate Republicans are planning a strategic push for President-elect Donald Trump's agenda. Their focus begins on border security and energy before transitioning to tax cuts, employing a parliamentary tacti... [628 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Page Six"
      },
      "author": "Page Six",
      "title": "Sean Penn goes on anti-Oscars rant, praises Trump biopic",
      "description": "Sean Penn went on an anti-Oscars rant and praised the new Donald Trump biopic while chain-smoking at a press conference.",
      "url": "https://pagesix.com/2024/12/03/entertainment/sean-penn-goes-on-anti-oscars-rant-praises-trump-biopic/",
      "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2024/12/94695608.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-12-03T23:50:21Z",
      "content": "Two-time Academy Award winner Sean Penn slammed the Oscars while speaking — and chain-smoking — at a press conference during the Marrakech Film Festival.\n“The Academy have exercised really extraordinary cowardice when it comes to being part of the bi... [4340 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Chad Chronister Withdraws from DEA Nomination",
      "description": "President-elect Donald Trump's pick for the DEA head, Chad Chronister, has withdrawn his nomination. Chronister, a Florida sheriff, cited the weight of the role as his reason. His decision follows similar withdrawals and was met with criticism over prior actions and perceived lack of experience.",
      "url": "https://www.devdiscourse.com/article/politics/3180651-chad-chronister-withdraws-from-dea-nomination",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_05_2019_12_10_51_4304562.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-03T23:49:14Z",
      "content": "In a surprising turn of events, Chad Chronister, President-elect Donald Trump's nominee for the head of the Drug Enforcement Administration (DEA), has withdrawn his name from consideration. Announced just days ago, his potential appointment had alrea... [640 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's DEA Pick Withdraws: Chad Chronister Bows Out",
      "description": "Chad Chronister, President-elect Donald Trump's nominee for DEA leader, has withdrawn from consideration. Chronister, a Florida sheriff, cited the responsibility's gravity as his reason. Trump announced Chronister's nomination to curb fentanyl at the U.S.-Mexico border. Trump's previous Justice Department pick also withdrew, altering the transition process.",
      "url": "https://www.devdiscourse.com/article/politics/3180650-trumps-dea-pick-withdraws-chad-chronister-bows-out",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_05_2019_11_50_05_8739542.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-03T23:48:51Z",
      "content": "Chad Chronister, the nominee for the Drug Enforcement Administration (DEA) under President-elect Donald Trump, has decided to step down from consideration. Citing the gravity of the role, Chronister, a Florida sheriff, announced his withdrawal on X.\n... [558 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Canada Joke Sparks Trade and Tariff Debate",
      "description": "During a dinner with Prime Minister Justin Trudeau, President-elect Donald Trump jokingly suggested Canada become the 51st US state, causing a stir in trade discussions. Trudeau argues against Trump's proposed tariffs on Canada, and Canadian officials emphasize the minimal impact on drug and migrant flow from Canada to the US.",
      "url": "https://www.devdiscourse.com/article/business/3180649-trumps-canada-joke-sparks-trade-and-tariff-debate",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/03_12_2024_09_46_56_5920296.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-03T23:47:14Z",
      "content": "In recent developments, President-elect Donald Trump triggered discussions over potential tariffs with Canada while humorously suggesting the nation become the 51st state. This remark, made during a dinner with Canadian Prime Minister Justin Trudeau,... [796 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's 51st State Joke: Diplomacy in Jest",
      "description": "During a recent dinner, President-elect Donald Trump jokingly suggested to Canadian Prime Minister Justin Trudeau that Canada should become the 51st US state. The quip emerged amid discussions about potential US tariffs on Canadian goods. While some found humor in Trump's jest, the exchange highlighted ongoing trade and border negotiations between the two nations.",
      "url": "https://www.devdiscourse.com/article/law-order/3180648-trumps-51st-state-joke-diplomacy-in-jest",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_05_2019_11_52_07_9391333.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-03T23:46:41Z",
      "content": "During a dinner meeting with Canadian Prime Minister Justin Trudeau, President-elect Donald Trump made headlines by jokingly suggesting that Canada should become the 51st state of the United States. The light-hearted comment came amidst discussions o... [728 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "KABC-TV"
      },
      "author": "KABC-TV",
      "title": "Chad Chronister, Donald Trump's pick to run the DEA, withdraws name from consideration",
      "description": "Chad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration.",
      "url": "https://abc7.com/post/chad-chronister-donald-trumps-pick-run-dea-withdraws-name-consideration/15620857/",
      "urlToImage": "https://cdn.abcotvs.com/dip/images/15620851_trump-transition-img.jpg?w=1600",
      "publishedAt": "2024-12-03T23:41:00Z",
      "content": "Chad Chronister, Donald Trump's pick to run the DEA, withdraws name from consideration\nChad Chronister, Donald Trump's pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second p... [3900 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CNBC"
      },
      "author": "CNBC",
      "title": "Trump's pick for defense secretary, Pete Hegseth, is in peril in the Senate",
      "description": "As many as six GOP senators aren't currently comfortable supporting Hegseth following allegations about drinking and his treatment of women, sources told NBC News.",
      "url": "https://www.cnbc.com/2024/12/03/trumps-pick-for-defense-secretary-pete-hegseth-is-in-peril-in-the-senate.html",
      "urlToImage": "https://image.cnbcfm.com/api/v1/image/108070826-1733264178378-gettyimages-2187520647-hegseth476_120324.jpeg?v=1733264193&w=1920&h=1080",
      "publishedAt": "2024-12-03T23:39:24Z",
      "content": "Pete Hegseth, President-elect Donald Trump's nominee to be defense secretary, makes his way to a meeting with Sen. Ted Budd, R-N.C., in Russell building on Tuesday, December 3, 2024.\nPresident-elect Donald Trump's pick to lead the Defense Department,... [4697 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Some GOP senators seem tepid on Hegseth nomination as allegations pile up",
      "description": "The concern could put another one of President-elect Donald Trump's Cabinet picks at risk of falling short of the support needed for confirmation.",
      "url": "https://www.cbsnews.com/news/pete-hegseth-allegations-republican-senators/",
      "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/12/03/68d39450-ddb8-4217-8280-325a71cec7b4/thumbnail/1200x630/0d64363df4feedec0759423be2521f44/gettyimages-2187520647.jpg?v=0c07a24f1ac5eb64b06f31185829f707",
      "publishedAt": "2024-12-03T23:38:27Z",
      "content": "Washington — A number of Republican senators have expressed concern about Pete Hegseth, President-elect Donald Trump's choice to lead the Defense Department, potentially putting his intended nomination at risk.\nHegseth, who has been meeting with Sena... [3687 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Dallas Morning News"
      },
      "author": "The Dallas Morning News",
      "title": "Trump’s pick to run DEA withdraws from consideration",
      "description": "Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration.",
      "url": "https://www.dallasnews.com/news/politics/2024/12/03/trumps-pick-to-run-dea-withdraws-from-consideration/",
      "urlToImage": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/BZ5CP2HF4ZE35CQWD2PWU3BH2A.jpg?auth=075d53e26a689556c2b4fc9920df16ee0469ed19146f232f455e0d135c253d1a&height=630&width=1200&smart=true&quality=80",
      "publishedAt": "2024-12-03T23:36:51Z",
      "content": "NEW YORK — Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominat... [2504 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CNBC"
      },
      "author": "CNBC",
      "title": "U.S. may have reached 'high water mark' in China tensions",
      "description": "CNBC's Jim Cramer wondered how President-elect Donald Trump's relationship with Tesla CEO Elon Musk will affect his administration's approach to China.",
      "url": "https://www.cnbc.com/2024/12/03/jim-cramer-us-may-have-reached-high-water-mark-in-china-tensions.html",
      "urlToImage": "https://image.cnbcfm.com/api/v1/image/106349568-1579719779301img_3380r.jpg?v=1693521799&w=1920&h=1080",
      "publishedAt": "2024-12-03T23:36:20Z",
      "content": "CNBC's Jim Cramer on Tuesday addressed the many unknowns regarding Donald Trump's trade policies and wondered if the president-elect may be more amiable towards China than many think — perhaps in part because of his close relationship with Tesla CEO ... [1621 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Donald Trump Jr. joins e-commerce company PublicSquare as its shares soar 270%",
      "description": "PublicSquare, which describes itself as catering to \"patriotic Americans,\" is adding the son of President-elect Donald Trump Jr. to its board.",
      "url": "https://www.cbsnews.com/news/donald-trump-jr-publicsquare-psq-stock-price/",
      "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/11/13/0cf332b5-55bf-40cd-8441-d416fd240985/thumbnail/1200x630/981731218af6250c502bd8cbadc0fd18/cbsn-fusion-donald-trump-jr-to-testify-again-in-civil-fraud-trial-this-time-as-defense-witness-thumbnail-2446921-640x360.jpg?v=0c07a24f1ac5eb64b06f31185829f707",
      "publishedAt": "2024-12-03T23:35:33Z",
      "content": "PSQ Holdings, an online commerce and payments company that describes itself as \"valuing life, family and liberty,\" saw its shares shoot up more than 270% on Tuesday amid news that Donald Trump Jr. is joining its board of directors.\nPSQ, based in West... [1438 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "The GOP's post-election challenge: Turning Trump voters into full-fledged Republicans: From the Politics Desk",
      "description": "Even with their success, this election revealed a challenge for Republicans going forward: The “Trump coalition” and the “GOP coalition” are not quite the same.",
      "url": "https://www.nbcnews.com/politics/gop-post-election-challenge-trump-voters-politics-desk-rcna182707",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-11/241106-how-trump-won-wm-317p-261fcf.jpg",
      "publishedAt": "2024-12-03T23:34:49Z",
      "content": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the White House, Capitol Hill and the campaign trail.\nIn today’s edition, national politica... [9378 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Fani Willis Update as Judge Deciding Subpoena Fate Over Trump Case",
      "description": "Willis indicted Trump on felony election subversion and racketeering charges in August 2023.",
      "url": "https://www.newsweek.com/fani-willis-update-subpoena-trump-case-1995171",
      "urlToImage": "https://d.newsweek.com/en/full/2535542/fani-willis-update-subpoena-hearing-state-senate.jpg",
      "publishedAt": "2024-12-03T23:23:17Z",
      "content": "A judge is considering whether a Republican-led Georgia State Senate committee has the power to subpoena Fulton County District Attorney Fani Willis regarding her prosecution of President-elect Donald Trump.\nThe Georgia Senate's Special Committee on ... [2162 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "Trump's request for hush money dismissal - citing Biden pardon - wasn't for judge: Expert",
      "description": "Legal experts ripped apart Donald Trump's latest request to have his guilty verdict in New York tossed, in which he cited Hunter Biden's sweeping pardon. Trump's lawyers filed a motion to dismiss the guilty verdict, handed down by a New York state jury in May. The questionable filing prompted legal ...",
      "url": "https://www.rawstory.com/trump-new-york-fraud-case/",
      "urlToImage": "https://www.rawstory.com/media-library/donald-trump-shutterstock-com.jpg?id=31177280&width=1200&height=600&coordinates=0%2C25%2C0%2C25",
      "publishedAt": "2024-12-03T23:21:58Z",
      "content": "Legal experts ripped apart Donald Trump's latest request to have his guilty verdict in New York tossed, in which he cited Hunter Biden's sweeping pardon.\nTrump's lawyers filed a motion to dismiss the guilty verdict, handed down by a New York state ju... [1604 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Trump Nominees Live Updates: DEA Pick Chad Chronister Withdraws Amid Backlash",
      "description": "Hillsborough County Sheriff Chad Chronister has withdrawn as nominee for the head of the DEA. Follow Newsweek's live blog for updates.",
      "url": "https://www.newsweek.com/trump-nominees-live-updates-dea-pick-chad-chronister-withdraws-amid-backlash-1995189",
      "urlToImage": "https://d.newsweek.com/en/full/2535537/chad-chronister.jpg",
      "publishedAt": "2024-12-03T23:20:13Z",
      "content": "Hillsborough County Sheriff Chad Chronister has withdrawn as nominee for the head of the Drug Enforcement Administration (DEA). Chronister thanked President-elect Donald Trump for his nomination which he called \"the honor of a lifetime.\" But he said ... [1956 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Chad Chronister, Donald Trump’s pick to run the DEA, withdraws",
      "description": "Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration.",
      "url": "https://www.chicagotribune.com/2024/12/03/chad-chronister-dea-pick-withdraws/",
      "urlToImage": "https://www.chicagotribune.com/wp-content/uploads/2024/12/Trump_Tariffs_83518.jpg?w=1024&h=683",
      "publishedAt": "2024-12-03T23:19:50Z",
      "content": "NEW YORK — Chad Chronister, Donald Trump’s pick to run the Drug Enforcement Administration, said Tuesday he was withdrawing his name from consideration, becoming the second person selected by the president-elect to bow out quickly after being nominat... [2459 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "RCMP says it has ‘contingency plans’ to tackle the border",
      "description": "Trudeau government hasn't yet \"finalized\" the decisions as it fends off criticisms that it is too slow to act to counter Trump's tariff threat.",
      "url": "https://www.thestar.com/politics/rcmp-has-contingency-plans-to-bolster-the-canada-u-s-border-but-heres-what-it/article_391146b4-b1a9-11ef-9913-c74b6b87a658.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/6/3d/63d9d3d4-6a27-5c5b-aa5c-841ad36a65ab/674f8cbe596d0.image.jpg?crop=1762%2C925%2C0%2C125&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2024-12-03T23:15:00Z",
      "content": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada N... [719 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Inquisitr"
      },
      "author": "The Inquisitr",
      "title": "Tiffany Trump Gave Kimberly Guilfoyle A 'Stink-Eye' For Her See-Through Dress at Dad's Fundraiser",
      "description": "After the photos and videos of the party reached social media, people had some very biting and unfiltered opinions regarding her and her choice.",
      "url": "https://www.inquisitr.com/tiffany-trump-gave-kimberly-guilfoyle-a-stink-eye-for-her-see-through-dress-at-dads-fundraiser",
      "urlToImage": "https://dab57h0r8ahff.cloudfront.net/726994/uploads/095be990-b160-11ef-bb6e-2b021a5cde99_1200_630.jpeg",
      "publishedAt": "2024-12-03T23:15:00Z",
      "content": "The world of politics is like a tightrope; one wrong step can leave you struggling to recover for years. The way people present themselves in this world is often keenly observed and knowing this, Kimberly Guilfoyle could have made a better choice of ... [3358 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Senate Republicans Strategize to Propel Trump's Agenda Forward",
      "description": "U.S. Senate Republicans plan a two-step strategy to advance President-elect Donald Trump's agenda, emphasizing border security and energy before addressing tax cuts. The plan, proposed by incoming Senate Majority Leader John Thune, seeks to bypass filibuster rules to enact legislative priorities including energy deregulation and extending tax cuts.",
      "url": "https://www.devdiscourse.com/article/politics/3180637-senate-republicans-strategize-to-propel-trumps-agenda-forward",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/21_08_2024_20_31_28_8830021.png?width=920&format=jpeg",
      "publishedAt": "2024-12-03T23:10:32Z",
      "content": "In a strategic move, U.S. Senate Republicans are crafting a two-step plan to advance President-elect Donald Trump's key agenda items. The approach will initially focus on enhancing border security and energy policies, then pivot toward implementing t... [627 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "GOP senator downplays Pete Hegseth allegations: I'm interested in who he is today",
      "description": "Sen. Kevin Cramer (R-ND) appears unfazed by allegations against Donald Trump's Pentagon chief nominee — and had an interesting choice of words when pressed on the matter by CNN congressional correspondent Manu Raju on Tuesday.The nomination of Pete Hegseth, a Fox News personality, is currently in je...",
      "url": "https://www.rawstory.com/us-sen-kevin-cramer-2670299357/",
      "urlToImage": "https://www.rawstory.com/media-library/senator-kevin-cramer-of-north-dakota-speaking-at-the-2013-conservative-political-action-conference-cpac-in-national-harbor-ma.jpg?id=29853718&width=1200&height=600&coordinates=0%2C67%2C0%2C67",
      "publishedAt": "2024-12-03T23:06:26Z",
      "content": "Sen. Kevin Cramer (R-ND) appears unfazed by allegations against Donald Trump's Pentagon chief nominee — and had an interesting choice of words when pressed on the matter by CNN congressional correspondent Manu Raju on Tuesday.\nThe nomination of Pete ... [1656 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Trump's pick to lead the DEA withdraws from consideration",
      "description": "Chad Chronister, President-elect Donald Trump's pick to lead the Drug Enforcement Administration, said Tuesday that he would withdraw his name from consideration for the post.",
      "url": "https://www.nbcnews.com/politics/donald-trump/trump-pick-dea-administrator-withdraws-consideration-rcna182755",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-12/241203-sheriff-chad-chronister-2021-ac-556p-14c645.jpg",
      "publishedAt": "2024-12-03T23:01:00Z",
      "content": "Chad Chronister, President-elect Donald Trump's pick to lead the Drug Enforcement Administration, said Tuesday that he would withdraw his name from consideration for the post.\nChronister, who serves as sheriff in Hillsborough County, Florida, announc... [755 chars]"
    }
  ]
}