{
  "status": "ok",
  "totalResults": 601,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "NY State Ed has fallen into total irrelevancy - and should be abolished",
      "description": "When Team Trump takes office, here's hoping they — maybe with some help from Congress — have time to investigate the persistent, willful malfeasance of New York's State Education Department.",
      "url": "https://nypost.com/2024/11/19/opinion/ny-state-ed-has-fallen-into-total-irrelevancy-and-should-be-abolished/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/11/commissioner-education-president-university-state-17829692_d9a9d0-e1732056144536.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-11-19T23:56:34Z",
      "content": "When Team Trump takes office, here’s hoping they — maybe with some help from Congress — have time to investigate the persistent, willful malfeasance of New York’s State Education Department.\nThe feds sure have standing, given all the cash Uncle Sam s... [3008 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Strategic Moves Amidst Controversies",
      "description": "Current U.S. news includes developments around Donald Trump's legal cases, strategic appointments like Dr. Oz for Medicare, contentious bills on transgender rights, Texas's domestic policies, and other significant headlines. Wide-ranging topics reflect political maneuvers and pressing social issues shaping the nation's trajectory.",
      "url": "https://www.devdiscourse.com/article/technology/3163308-trumps-strategic-moves-amidst-controversies",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_11_2024_11_54_30_0859659.jpg?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:53:29Z",
      "content": "Among the notable developments in recent U.S. news, prosecutors have opposed Donald Trump's attempt to dismiss a hush money case. They are urging the court to set a schedule for litigation as Trump prepares for his presidency.\nIn Congress, a Republic... [442 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Texas Offers Land for Mass Deportation Facilities",
      "description": "Texas has offered 1,402 acres to President-elect Trump for building detention facilities to deport illegal immigrants. The Texas General Land Office expresses readiness to assist the Trump administration in fulfilling its promise to remove over 11 million illegal immigrants from the U.S., including violent criminals.",
      "url": "https://www.devdiscourse.com/article/law-order/3163306-texas-offers-land-for-mass-deportation-facilities",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/14_06_2024_05_37_30_6571647.png?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:53:00Z",
      "content": "Texas has put forth a bold proposal, offering 1,402 acres to President-elect Donald Trump for the development of infrastructure facilities aimed at facilitating the mass deportation of illegal immigrants.\nThe Texas General Land Office, led by Commiss... [503 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Global Tensions and Political Dynamo: The Latest World Incidents",
      "description": "A summary of the latest global news, including Argentina's President Milei bringing a Trump-like presence to the G20, Germany's Scholz facing pressure, Ukraine's missile strikes on Russia, Blinken recognizing Venezuela's Gonzalez as president-elect, US-Israel talks on Gaza, gang violence in Haiti, SpaceX's Starship launch, Lebanese army struggles, Liam Payne's funeral, and Lula's early G20 exit.",
      "url": "https://www.devdiscourse.com/article/politics/3163305-global-tensions-and-political-dynamo-the-latest-world-incidents",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/23_08_2024_06_40_38_9275061.png?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:52:51Z",
      "content": "The G20 summit in Brazil witnessed a controversial appearance by Argentina's President Javier Milei, who echoed former U.S. President Donald Trump on issues like climate skepticism and economic policies.\nMeanwhile, in Germany, Chancellor Olaf Scholz ... [421 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Lutnick's Rise: Leading U.S. Trade Strategy Amid U.S.-China Economic Tensions",
      "description": "President-elect Donald Trump plans to nominate Howard Lutnick as head of the Commerce Department, focusing on trade tactics, especially tariffs targeting China. Lutnick's nomination aligns with Trump's vision to revitalize U.S. manufacturing and control sensitive technology exports. His appointment impacts other Trump allies seeking key roles.",
      "url": "https://www.devdiscourse.com/article/law-order/3163304-lutnicks-rise-leading-us-trade-strategy-amid-us-china-economic-tensions",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/01_04_2019_17_12_02_6631371.jpg?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:52:34Z",
      "content": "In a strategic move to bolster U.S. trade policies, President-elect Donald Trump has selected Wall Street executive Howard Lutnick to lead the Commerce Department. Lutnick, a noted tariff proponent, will guide trade and tariff strategies, significant... [588 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Joe Scarborough visits Donald Trump and raises ire of Dems",
      "description": "Aging-hipster MSNBC host Joe Scarborough of “Morning Joe” frequently blasted Donald Trump for apparent “hypocrisy,” yet last Sunday at Mar-a-Lago Scarborough, 61, and co-host wife Mika Brzezinski, 57, met president elect Donald Trump in a bid to settle their differences.",
      "url": "https://nypost.com/2024/11/19/us-news/joe-scarborough-visits-donald-trump-and-raises-ire-of-dems/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/11/joe-scarborough.jpg?quality=75&strip=all&1732033308&w=1024",
      "publishedAt": "2024-11-19T23:51:28Z",
      "content": "One of Joe Scarborough’s favorite words seems to be “hypocrite.”\nThe aging-hipster MSNBC host of liberal “Morning Joe” frequently blasted Donald Trump for apparent “hypocrisy,” fuming in October he makes hypocritical statements “every day.”\nYet despi... [4979 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Trump taps TV personality Dr. Mehmet Oz to lead key Medicare and Medicaid agency",
      "description": "Dr. Mehmet Oz unsuccessfully ran for Senate in 2022. Now he's Trump's choice to lead the Centers for Medicare and Medicaid Services.",
      "url": "https://www.cbsnews.com/news/trump-taps-dr-mehmet-oz-to-lead-medicare-and-medicaid-agency/",
      "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/08/7487a749-5fef-4934-9b1a-876890312647/thumbnail/1200x630g2/ac64880bd4213789b714b0af2419f6dc/gettyimages-1341712236.jpg?v=6056e68389c16974d8d95eeea60b7a3a",
      "publishedAt": "2024-11-19T23:51:00Z",
      "content": "Washington — President-elect Donald Trump announced Tuesday that he has selected Dr. Mehmet Oz — a celebrity heart surgeon who hosted a daytime television show — to lead the Centers for Medicare and Medicaid Services.\nThe agency falls under the Depar... [2287 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "FEMA chief testifies over agency skipping Trump homes",
      "description": "Click for the latest from The Hill {beacon} Energy & Environment Energy & Environment   The Big Story  FEMA chief testifies over agency skipping Trump homes The head of the Federal Emergency Management Agency (FEMA) faced intense questioning from Republicans over a since-fired employee’s directive that staff avoid houses with Trump campaign signage after Hurricane…",
      "url": "https://thehill.com/newsletters/energy-environment/4999031-fema-chief-testifies-over-agency-skipping-trump-homes/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/11/AP24324735749805-e1732052676762.jpg?w=1280",
      "publishedAt": "2024-11-19T23:48:03Z",
      "content": "The Big Story FEMA chief testifies over agency skipping Trump homes The head of the Federal Emergency Management Agency (FEMA) faced intense questioning from Republicans over a since-fired employee’s directive that staff avoid houses with Trump campa... [1450 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Canberra Times"
      },
      "author": "The Canberra Times",
      "title": "SpaceX launches Starship rocket, aborts booster catch",
      "description": "SpaceX has launched another Starship rocket in its sixth test flight, with US President-elect Donald Trump on hand...",
      "url": "https://www.canberratimes.com.au/story/8824718/spacex-launches-starship-rocket-aborts-booster-catch/",
      "urlToImage": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/silverstone-feed-data/7f444305-b8b3-4462-a176-17e8d103c0fc.jpg/r0_90_800_510_w1200_h630_fmax.jpg",
      "publishedAt": "2024-11-19T23:44:30Z",
      "content": "Among the new objectives that were achieved: igniting one of the spacecraft's engines in space, which would be necessary when returning from orbit. There were also thermal protection experiments aboard the spacecraft, with some areas stripped of heat... [268 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Texas Land Lease Fuels Deportation Plans",
      "description": "Texas offers over 1,400 acres to the Trump administration for building facilities aimed at mass deportation of immigrants. The state is prepared to lease land for processing and detention to assist in the largest deportation efforts in the nation's history.",
      "url": "https://www.devdiscourse.com/article/politics/3163303-texas-land-lease-fuels-deportation-plans",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/31_05_2024_16_02_12_2930948.png?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:43:07Z",
      "content": "In a significant move, Texas is leasing over 1,400 acres of land along the Mexico border to the incoming Trump administration, aiming to support a mass deportation strategy. This development highlights the state's backing of federal immigration enfor... [591 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "LA unanimously passes sanctuary city ordinance to protect migrants ahead of Trump's planned deportations",
      "description": "The Los Angeles City Council on Tuesday unanimously passed a \"sanctuary city\" ordinance to protect immigrants living in the city.",
      "url": "https://nypost.com/2024/11/19/us-news/la-unanimously-passes-sanctuary-city-ordinance-to-protect-migrants-ahead-of-trumps-planned-deportations/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/11/newspress-collage-wvkdcm8mb-1732058637210.jpg?quality=75&strip=all&1732040793&w=1024",
      "publishedAt": "2024-11-19T23:37:16Z",
      "content": "LOS ANGELES — The Los Angeles City Council on Tuesday unanimously passed a “sanctuary city” ordinance to protect immigrants living in the city, a policy that would prohibit the use of city resources and personnel to carry out federal immigration enfo... [2085 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Memphis florist refuses to work with Trump supporters",
      "description": "Memphis florist Kristin Wolter received vile voicemails after saying Everbloom Design would not serve supporters of President-elect Donald Trump — causing her to temporarily shutter the business.",
      "url": "https://nypost.com/2024/11/19/us-news/memphis-florist-refuses-to-work-with-trump-supporters/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/11/93967630.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-11-19T23:33:10Z",
      "content": "A Memphis florist who refused to serve customers who voted for President-elect Donald Trump has been forced to close up shop temporarily after receiving nasty backlash over her decision.\nEverbloom Design owner Kristin Wolter announced her shop would ... [3051 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Dallas Morning News"
      },
      "author": "The Dallas Morning News",
      "title": "Dr. Oz tapped by Trump to oversee Medicare, Medicaid",
      "description": "President-elect Donald Trump on Tuesday tapped Dr. Mehmet Oz, a former television talk show host and heart surgeon, to head the agency that oversees health...",
      "url": "https://www.dallasnews.com/news/politics/2024/11/19/dr-oz-tapped-by-trump-to-oversee-medicare-medicaid/",
      "urlToImage": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/4LQ4OXMTTVJJPDWUHDBG4SNCLU.jpg?auth=d7ab9a58d0c66a90fbafd3323ed38937f7801fcadb1429ee667693f7aff9292d&height=630&width=1200&smart=true&quality=80",
      "publishedAt": "2024-11-19T23:32:53Z",
      "content": "WASHINGTON (AP) — President-elect Donald Trump on Tuesday tapped Dr. Mehmet Oz, a former television talk show host and heart surgeon, to head the agency that oversees health insurance programs for millions of older, poor and disabled Americans. Trump... [4962 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Sharpton blasts Trump for lack of Black Cabinet members",
      "description": "The Rev. Al Sharpton criticized President-elect Trump for lacking Black cabinet or high-level administration appointees thus far.",
      "url": "https://thehill.com/homenews/4999041-sharpton-blasts-trump-for-lack-of-black-cabinet-members/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/06/Donald-Trump-Al-Sharpton-06.14.png?w=1280",
      "publishedAt": "2024-11-19T23:20:01Z",
      "content": "The Rev. Al Sharpton criticized President-elect Trump for lacking Black Cabinet or high-level administration appointees thus far.\n“In the two weeks since Donald Trump was elected to a second term, he has put forth a dozen troubling nominees, yet the ... [1994 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Irish Times"
      },
      "author": "The Irish Times",
      "title": "Trump names TV doctor Mehmet Oz as Medicare, Medicaid chief",
      "description": "Oz was an informal health adviser to Trump during Covid-19, when he promoted the use of hydroxychloroquine, an anti-malaria drug that was not approved to treat the coronavirus",
      "url": "https://www.irishtimes.com/world/us/2024/11/19/trump-names-tv-doctor-mehmet-oz-as-medicare-medicaid-chief/",
      "urlToImage": "https://www.irishtimes.com/resizer/v2/4VL6AUBQLWOG2XEDMTYTX7W33M.jpg?smart=true&auth=6be7d2d83742564047d5dc50e7f886d7fa05fad9770460c61c724aa79e8e6956&width=1200&height=630",
      "publishedAt": "2024-11-19T23:16:00Z",
      "content": "Dr Mehmet Oz speaks during a campaign event in 2022. President-elect Donald Trump has announced that he is nominating Oz to serve as the administrator of the Centers for Medicare and Medicaid Services. Photograph: Hilary Swift/The New York Times\nPres... [1891 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Cabinet: A New Era of Bold Appointments",
      "description": "President-elect Donald Trump has announced a series of high-profile appointments for his upcoming administration, selecting key figures for defense, intelligence, health, and more. These appointments include Marco Rubio as secretary of state and John Ratcliffe as CIA director, among others. Each brings a distinct approach to their respective fields.",
      "url": "https://www.devdiscourse.com/article/politics/3163295-trumps-cabinet-a-new-era-of-bold-appointments",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/07_08_2024_06_22_58_2044361.png?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:14:06Z",
      "content": "President-elect Donald Trump is making waves with his cabinet appointments, naming a mix of seasoned leaders and loyal allies to key positions. Notably, he has chosen Senator Marco Rubio as secretary of state, putting a prominent voice in foreign pol... [528 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Trump loyalist Kash Patel in contention to be named FBI director",
      "description": "Interviews for key role conducted at Mar-a-Lago on Monday night as Trump appears intent on firing Christopher Wray",
      "url": "https://www.theguardian.com/us-news/2024/nov/19/trump-kash-patel-fbi-director",
      "urlToImage": "https://i.guim.co.uk/img/media/1e22bd5fa164f741b14bf2e8ce51cffe065d7041/0_28_1000_600/master/1000.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e23c74b60bfb2438595ffd9ded635e71",
      "publishedAt": "2024-11-19T23:14:00Z",
      "content": "Donald Trump is keeping his controversial adviser Kash Patel in the running to be the next FBI director, according to two people familiar with the matter, as the transition team conducted interviews for the role on Monday night at the Mar-a-Lago club... [3822 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump taps Dr. Oz for CMS chief",
      "description": "Click in for more news from The Hill {beacon} Health Care Health Care   The Big Story  Trump taps Dr. Oz to run Medicare, Medicaid agency  The television personality and doctor would lead a powerful agency that oversees health coverage for more than 150 million people. © AP Trump announced Tuesday that Oz, a heart surgeon…",
      "url": "https://thehill.com/newsletters/health-care/4999003-trump-taps-dr-oz-for-cms-chief/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2022/06/OzMehmet_051122ap.jpg?w=1280",
      "publishedAt": "2024-11-19T23:13:31Z",
      "content": "Trump announced Tuesday that Oz, a heart surgeon he previously endorsed for an unsuccessful 2022 Pennsylvania GOP Senate bid, was his pick to lead the Centers for Medicare and Medicaid Services (CMS).\nCMS regulates federal insurance policy and determ... [1443 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Globe and Mail"
      },
      "author": "The Globe and Mail",
      "title": "Trump and Musk solidify their bond with Texas trip for rocket launch",
      "description": "Musk spent around $200-million to help Trump beat Democrat Kamala Harris in the presidential race",
      "url": "https://www.theglobeandmail.com/world/article-trump-and-musk-solidify-their-bond-with-texas-trip-for-rocket-launch/",
      "urlToImage": "https://www.theglobeandmail.com/resizer/v2/4X5XCVPPJZEGPLLQUUGKCA67BE.jpg?auth=bb4a2864a07ad8271157f2d56eee1dc3e41afe87882b5b101b6ac0fb448e55a0&width=1200&height=800&quality=80&smart=true",
      "publishedAt": "2024-11-19T23:12:48Z",
      "content": "Open this photo in gallery: Elon Musk speaks as President-elect Donald Trump and Donald Trump Jr., left, listen before the launch of the sixth test flight of the SpaceX Starship rocket on Nov. 19, 2024, in Boca Chica, Texas.Brandon Bell/The Associate... [4987 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Linda McMahon May Be America's Last Education Secretary",
      "description": "The WWE co-founder could be the last U.S. education secretary if Trump is able to shut down the federal department.",
      "url": "https://www.newsweek.com/donald-trump-linda-mcmahon-education-secretary-department-1985464",
      "urlToImage": "https://d.newsweek.com/en/full/2525132/linda-mcmahon-education-secretary.jpg",
      "publishedAt": "2024-11-19T23:12:25Z",
      "content": "President-elect Donald Trump has named the next—and possibly the nation's last—education secretary.\nTrump on Tuesday night announced the pick on Truth Social, his social media platform, saying in part, \"Linda has been a fierce advocate for Parents' R... [5778 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Trump's FCC pick, Brendan Carr, wrote Project 2025's chapter on the agency. Here's what he wants.",
      "description": "Brendan Carr wrote Project 2025's chapter on overhauling the Federal Communications Commission. Here's what to know.",
      "url": "https://www.cbsnews.com/news/trump-fcc-brendan-carr-project-2025-what-to-know/",
      "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/11/19/cc5d13cb-5318-4a57-aff2-e673af51684e/thumbnail/1200x630/db2482010fabd0b15e820438254c56e2/gettyimages-2028793337.jpg?v=b1635869826311f914073798d8df6484",
      "publishedAt": "2024-11-19T23:09:55Z",
      "content": "Trump to announce more cabinet picks this week Trump to announce more cabinet picks this week 03:10\nPresident-elect Donald Trump's pick to run the Federal Communications Commission, Brendan Carr, will oversee the agency that regulates U.S. internet a... [6214 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump Taps Dr. Oz for Medicare-Role in Bold Healthcare Overhaul",
      "description": "Donald Trump has appointed Dr. Mehmet Oz as administrator of Medicare and Medicaid Services, aiming to tackle the 'illness industrial complex.' The appointment comes as Robert F. Kennedy Jr. takes charge of the Department of Health and Human Services, with a promise to reform rather than dismantle Obamacare.",
      "url": "https://www.devdiscourse.com/article/health/3163294-trump-taps-dr-oz-for-medicare-role-in-bold-healthcare-overhaul",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_18_59_53_6525806.jpg?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:04:19Z",
      "content": "In a strategic healthcare move, President-elect Donald Trump announced his selection of Dr. Mehmet Oz as the new head of the Centers for Medicare and Medicaid Services, an agency responsible for a $2.6 trillion budget. Oz, a popular TV personality an... [909 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Unconventional Cabinet Picks Stir Controversy",
      "description": "President-elect Donald Trump appointed Dr. Mehmet Oz and Howard Lutnick to key roles in his administration. Oz will lead health insurance programs, while Lutnick will head the Commerce Department. Oz's controversial medical advice and Lutnick's stance on tariffs have sparked debate.",
      "url": "https://www.devdiscourse.com/article/politics/3163293-trumps-unconventional-cabinet-picks-stir-controversy",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_16_56_48_7796591.jpg?width=920&format=jpeg",
      "publishedAt": "2024-11-19T23:03:46Z",
      "content": "In a surprise move, President-elect Donald Trump announced Dr. Mehmet Oz, known for his career as a television talk show host and heart surgeon, will lead the agency managing health insurance programs crucial to older, poor, and disabled Americans. A... [983 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Gaetz vs. Big Tech",
      "description": "Welcome to The Hill’s Technology newsletter {beacon} Technology Technology   The Big Story  Matt Gaetz and his battle with Big Tech President-elect Trump’s decision to nominate former Rep. Matt Gaetz (R-Fla.) as attorney general signals a rough road ahead for major technology firms. © AP Photo/Evan Vucci Gaetz was a known critic of Big Tech throughout his…",
      "url": "https://thehill.com/newsletters/technology/4999023-gaetz-vs-big-tech/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/11/AP24199844536759-e1731950043454.jpg?w=1280",
      "publishedAt": "2024-11-19T23:03:39Z",
      "content": "Gaetz was a known critic of Big Tech throughout his tenure in Congress, teaming up with Democrats and lauding Biden administration’s attempts to rein in the power of the industry.\nThere are still serious doubts about his ability to be confirmed as at... [2150 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Republicans fume as GOP absences help Democrats move judicial nominees",
      "description": "Senate Republicans aired frustrations Tuesday after Vice President-elect Vance and other party members skipped votes Monday, greasing the skids for Democratic-backed judicial nominees to be greenlighted as part of a final push to fill the bench with lifetime appointees before President-elect Trump takes office. Republicans on Monday attempted to slow down an effort by Senate…",
      "url": "https://thehill.com/homenews/senate/4998960-senate-republicans-frustrated-judicial-nominees-vance/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/10/AP24298823840570-e1730200423787.jpg?w=1280",
      "publishedAt": "2024-11-19T23:01:51Z",
      "content": "Senate Republicans aired frustrations Tuesday after Vice President-elect Vance and other party members skipped votes Monday, greasing the skids for Democratic-backed judicial nominees to be greenlighted as part of a final push to fill the bench with ... [4350 chars]"
    }
  ]
}