{
  "status": "ok",
  "totalResults": 106,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "The Australian Financial Review"
      },
      "author": "The Australian Financial Review",
      "title": "Trump’s NATO scorn is built on a false premise",
      "description": "The former president misleadingly presents the alliance as a sort of protection racket where those who do not “pay up” will be abandoned by the United States.",
      "url": "https://www.afr.com/world/north-america/trump-s-scorn-for-nato-is-built-on-a-false-premise-20240212-p5f43u",
      "urlToImage": "https://static.ffx.io/images/$zoom_0.3845%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_187%2C$y_32/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_analysis_no_age_social_wm/3b8892f08008ef04e7735cdbfa36350c22604b31",
      "publishedAt": "2024-02-11T23:22:52Z",
      "content": "“No money in the form of foreign aid should be given to any country unless it is done as a loan, not just a giveaway,” he wrote on social media in all capital letters. “We should never give money anymore,” he added, “without the hope of a payback, or... [6770 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Opinion: Trump comments on Nikki Halye’s husband do the impossible. Trump sinks even lower",
      "description": "Former President Donald Trump reminded us again this weekend that there’s no bottom to his vileness, writes Dean Obeidallah.",
      "url": "https://edition.cnn.com/2024/02/11/opinions/trump-nato-comments-michael-haley-obeidallah/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap23168638637325.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-02-11T23:10:42Z",
      "content": "Editor’s Note: Dean Obeidallah, a former attorney, is the host of SiriusXM radio’s daily program “The Dean Obeidallah Show.” Follow him on Threads. The opinions expressed in this commentary are his own. Read more opinion at CNN.\nCNN —\nFormer Presiden... [5187 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Live 5 News WCSC"
      },
      "author": "Live 5 News WCSC",
      "title": "Trump to campaign in N. Charleston ahead of SC Republican presidential primary",
      "description": "Former President Donald Trump plans to make another campaign stop in the Lowcountry this week.",
      "url": "https://www.live5news.com/2024/02/11/trump-campaign-n-charleston-ahead-sc-republican-presidential-primary/",
      "urlToImage": "https://gray-wcsc-prod.cdn.arcpublishing.com/resizer/v2/LUULQVB22RE6LKAHZCLKSVT4YE.jpg?auth=3f8ea3d7a2ffe2ea70356c52a367d2be9b9c2a654f2decdc477512533dfdc50f&width=1200&height=600&smart=true",
      "publishedAt": "2024-02-11T22:38:50Z",
      "content": "NORTH CHARLESTON, S.C. (WCSC) - Former President Donald Trump plans to make another campaign stop in the Lowcountry this week.\nTrump will speak at the Charleston Area Convention Center in North Charleston on Wednesday, according to his campaign team.... [294 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Irish Sun"
      },
      "author": "The Irish Sun",
      "title": "Trump warns Taylor Swift not to be 'disloyal to man who made her so much money' by endorsing Biden in Super Bowl rant",
      "description": "DONALD Trump says that he expects Taylor Swift to be loyal to him during this year's upcoming election — not for his politics, but because of the mo",
      "url": "https://www.thesun.ie/news/12186154/trump-warns-taylor-swift-not-to-be-disloyal/",
      "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2024/02/OFF-PLAT-JS-trump.jpg?strip=all&quality=100&w=1920&h=1080&crop=1",
      "publishedAt": "2024-02-11T22:15:33Z",
      "content": "There's another reason she should be loyal too, Trump said\nDON THE MONEY Trump warns Taylor Swift not to be ‘disloyal to man who made her so much money’ by endorsing Biden in Super Bowl rant\nDONALD Trump says that he expects Taylor Swift to be loyal ... [3491 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sky News"
      },
      "author": "Sky News",
      "title": "NATO and Joe Biden criticise Donald Trump for comments that 'put American and European soldiers at risk'",
      "description": "NATO made the intervention after Mr Trump said he would let Russia \"do whatever the hell they want\" to members of the alliance that don't pay enough for defence at a rally in South Carolina on Saturday.",
      "url": "https://news.sky.com/story/nato-and-joe-biden-criticise-donald-trump-for-comments-that-put-american-and-european-soldiers-at-risk-13069315",
      "urlToImage": "https://e3.365dm.com/24/02/1600x900/skynews-donald-trump-south-carolina_6451964.jpg?20240211142909",
      "publishedAt": "2024-02-11T22:02:00Z",
      "content": "NATO has criticised comments made by Donald Trump at a campaign event - claiming they \"put American and European soldiers at increased risk\".\nThe former US president had said he would let Russia \"do whatever the hell they want\" to members of the alli... [2842 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump, Biden diverging approaches sealed different fates on doc cases",
      "description": "The decision to not recommend charges for President Biden following his mishandling of classified records has Republicans complaining about a double standard given the Espionage Act prosecution faced by former President Trump. But the claims ignore key differences between Biden’s mishandling of records and the conduct that led to Trump being slapped with a 40-count…",
      "url": "https://thehill.com/homenews/administration/4459034-trump-biden-diverging-approaches-sealed-different-fates-on-doc-cases/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/02/Biden-Trump_021024_photo_AP.png?w=1280",
      "publishedAt": "2024-02-11T22:00:00Z",
      "content": "The decision to not recommend charges for President Biden following his mishandling of classified records has Republicans complaining about a double standard given the Espionage Act prosecution faced by former President Trump.\nBut the claims ignore k... [6707 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Huffington Post"
      },
      "author": "The Huffington Post",
      "title": "Donald Trump: Taylor Swift Is 'Disloyal' If She Endorses President Biden",
      "description": "The former president also commented on the singer's relationship with Travis Kelce.",
      "url": "https://www.huffpost.com/entry/donald-trump-taylor-swift-biden-endorsement_n_65c92cb5e4b0fb721d617f17",
      "urlToImage": "https://img.huffingtonpost.com/asset/65c9352f2300001f008084f2.jpeg?cache=fww23uRGtS&ops=1200_630",
      "publishedAt": "2024-02-11T21:41:23Z",
      "content": "At HuffPost, we believe that everyone needs high-quality journalism, but we understand that not everyone can afford to pay for expensive news subscriptions. That is why we are committed to providing deeply reported, carefully fact-checked news that i... [477 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Biden calls Trump’s NATO remarks ‘appalling and dangerous’",
      "description": "President Biden went after former President Trump on Sunday for his comments admitting he once threatened NATO allies he would “encourage” Russian aggression, calling the remarks “appalling and dangerous.” Trump recounted the remarks during a campaign rally Saturday, saying he “would encourage” Russia “to do whatever the hell they want” to countries that are “delinquent”…",
      "url": "https://thehill.com/homenews/campaign/4461838-biden-calls-trumps-nato-remarks-appalling-and-dangerous/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/07/AP23192374373097-e1689161269495.jpg?w=1280",
      "publishedAt": "2024-02-11T21:40:56Z",
      "content": "President Biden went after former President Trump on Sunday for his comments admitting he once threatened NATO allies he would “encourage” Russian aggression, calling the remarks “appalling and dangerous.”\nTrump recounted the remarks during a campaig... [2186 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "Biden slams Trump's 'appalling and dangerous' NATO comments",
      "description": "WASHINGTON — President Joe Biden slammed as \"appalling and dangerous\" comments by Donald Trump downplaying his commitment to NATO, warning Sunday that the former president intends to give Russian leader Vladimir Putin \"a greenlight for more war and violence.\" Biden spoke after Trump said in a speech...",
      "url": "https://www.rawstory.com/biden-slams-trump-s-appalling-and-dangerous-nato-comments/",
      "urlToImage": "https://www.rawstory.com/media-library/image.jpg?id=51444475&width=980",
      "publishedAt": "2024-02-11T21:38:53Z",
      "content": "But over the weekend, it got considerably worse when the Times did a profile on Trump speaking so favorably of him that it even touted him for being \"tan\" and filled with youth.\n\"Mr. Trump, by contrast, does not appear to be suffering the effects of ... [3447 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Poland Defense Minister Scoffs at Donald Trump's NATO Comments",
      "description": "\"No election campaign is an excuse for playing with the security of the alliance,\" Władysław Kosiniak-Kamysz wrote on Sunday.",
      "url": "https://www.newsweek.com/poland-defense-minister-dismissed-donald-trump-nato-comment-1868884",
      "urlToImage": "https://d.newsweek.com/en/full/2347512/polish-defense-minister-wadysaw-kosiniak-kamysz.jpg",
      "publishedAt": "2024-02-11T21:36:12Z",
      "content": "Polish Defense Minister Władysław Kosiniak-Kamysz dismissed Donald Trump's comment about the North Atlantic Treaty Organization (NATO) on Sunday after the former president suggested he would \"encourage\" Russia to attack member states who fall short o... [4903 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "'Foggier': Biographer thinks Trump has 'degraded' his already 'weak memory'",
      "description": "One of Donald Trump's biographers, Bloomberg editorial editor Tim O'Brien, explained that there is a noticeable difference in the ex-president since he last ran for office. Speaking to MSNBC on Sunday, host Alex Witt questioned the \"gaffes\" Trump keeps making on the campaign trail. O'Brien explained...",
      "url": "https://www.rawstory.com/biographer-thinks-trump-has-degraded-his-already-weak-memory/",
      "urlToImage": "https://www.rawstory.com/media-library/trump-kiss.jpg?id=51326473&width=1200&height=600&coordinates=0%2C25%2C0%2C25",
      "publishedAt": "2024-02-11T21:21:50Z",
      "content": "The covid-19 pandemic would be a wake-up call for America, advocates for the elderly predicted: incontrovertible proof that the nation wasn’t doing enough to care for vulnerable older adults.\nThe death toll was shocking, as were reports of chaos in n... [7012 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Irish Mirror"
      },
      "author": "Irish Mirror",
      "title": "NATO boss says Donald Trump is putting lives at risk by 'encouraging' Russia to attack",
      "description": "The ex-president said he would \"encourage\" Moscow to attack NATO allies in a move that the bloc says may put US and EU lives at risk",
      "url": "https://www.irishmirror.ie/news/world-news/nato-boss-says-donald-trump-32102041",
      "urlToImage": "https://i2-prod.irishmirror.ie/incoming/article32101667.ece/ALTERNATES/s1200/2_TOPSHOT-US-POLITICS-VOTE-TRUMP.jpg",
      "publishedAt": "2024-02-11T20:56:27Z",
      "content": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet daily headlines and breaking news alerts for FREE by signing up to our newsletter\nSomething went wrong, please try again later.\nGet daily he... [3661 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Biden defends Nikki Haley from Trump jab on her deployed husband's whereabouts",
      "description": "President Biden swooped to Nikki Haley's defense against attacks by former President Donald Trump over her deployed husband's absence from the campaign trail.",
      "url": "https://nypost.com/2024/02/11/news/biden-defends-nikki-haley-from-trump-jab-on-her-deployed-husbands-whereabouts/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/02/biden_haley_trump_comp1.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-02-11T20:45:54Z",
      "content": "President Biden swooped to Nikki Haley’s defense against attacks from former President Donald Trump over her deployed husband’s absence from the campaign trail.\nAt a rally in Conway, South Carolina Saturday, Trump sounded off on Maj. Michael Haley, “... [3690 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Clinton adviser warns Biden needs to ‘do more’ than focus on Trump in 2024",
      "description": "An adviser to former President Clinton warned Sunday that President Biden must broaden his appeal to 2024 voters instead of just focusing on attacks against former President Trump if he wants to be reelected. Doug Sosnik, a senior adviser to Clinton, compared the 2024 election to 1980 in a New York Times op-ed, with Biden…",
      "url": "https://thehill.com/homenews/campaign/4461753-clinton-adviser-warns-biden-needs-to-do-more-than-focus-on-trump-in-2024/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/01/659e592f799fd8.47864667-e1706111310253.jpeg?w=1280",
      "publishedAt": "2024-02-11T20:45:24Z",
      "content": "An adviser to former President Clinton warned Sunday that President Biden must broaden his appeal to 2024 voters instead of just focusing on attacks against former President Trump if he wants to be reelected.\nDoug Sosnik, a senior adviser to Clinton,... [3294 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "US Senate advances aid bill for Ukraine despite Trump opposition",
      "description": "But a standalone aid bill for Israel fell victim in the House last week to opposition from Democrats who favor the broader Senate legislation and from hardline Republicans who wanted compensating spending cuts, in a pair of humiliating defeats for Johnson. During a visit to Kyiv on Friday, a bipartisan delegation of House lawmakers vowed to do their part to pass the measure.",
      "url": "https://www.devdiscourse.com/article/politics/2815843-us-senate-advances-aid-bill-for-ukraine-despite-trump-opposition",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_05_2019_11_50_05_8739542.jpg?width=920&format=jpeg",
      "publishedAt": "2024-02-11T20:35:43Z",
      "content": "A narrowly divided U.S. Senate moved closer to passing a $95.34 billion aid package for Ukraine, Israel and Taiwan on Sunday, showing undiminished bipartisanship despite opposition from Republican hardliners and Donald Trump. The Democratic-led Senat... [3493 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "'Tan?' Internet in uproar over flattering 'dear leader' Trump coverage in New York Times",
      "description": "The New York Times has been criticized over the past several months for its constant coverage of President Joe Biden and his age without giving Donald Trump the same treatment despite what other reports categorize as mental decline. But over the weekend, it got considerably worse when the Times did ...",
      "url": "https://www.rawstory.com/new-york-times-favorable-trump-coverage/",
      "urlToImage": "https://www.rawstory.com/media-library/an-ai-generated-image-of-a-strong-tan-donald-trump-touting-the-new-york-times-amid-favorable-coverage-photo-sarah-burris-davi.jpg?id=51444296&width=1200&height=600&coordinates=0%2C0%2C0%2C50",
      "publishedAt": "2024-02-11T20:29:12Z",
      "content": "The New York Timeshas been criticized over the past several months for its constant coverage of President Joe Biden and his age without giving Donald Trump the same treatment despite what other reports categorize as mental decline.\nBut over the weeke... [3679 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Australian Financial Review"
      },
      "author": "The Australian Financial Review",
      "title": "Trump’s Russia comments put US soldiers at ‘increased risk’",
      "description": "The head of NATO accused Donald Trump of putting American troops in danger after he encouraged Russia to attack alliance members that fail to meet defence spending targets.",
      "url": "https://www.afr.com/world/europe/donald-trump-russia-comments-put-us-soldiers-at-increased-risk-20240212-p5f43a",
      "urlToImage": "https://static.ffx.io/images/$zoom_0.3845%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_187%2C$y_32/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/3b8892f08008ef04e7735cdbfa36350c22604b31",
      "publishedAt": "2024-02-11T20:28:34Z",
      "content": "“Any suggestion that allies will not defend each other undermines all of our security, including that of the US,” Mr Stoltenberg said in a statement.\nNATO “remains ready and able to defend all allies. Any attack on NATO will be met with a united and ... [2784 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Deadline",
      "title": "Taylor Swift Attacked As Disloyal By Donald Trump Ahead Of Super Bowl",
      "description": "Taylor Swift Shouldn't Endorse Biden, Says Trump, It's Disloyal After All The Money Ex-POTUS Claims He Made Singer",
      "url": "https://deadline.com/2024/02/taylor-swift-endorsement-donald-trump-joe-biden-travis-kelce-super-bowl-1235822151/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2024/02/Donald-Trump-Taylor-Swift.jpg?w=1000",
      "publishedAt": "2024-02-11T20:17:17Z",
      "content": "Turns out Donald Trump is terrified of Taylor Swift.\nNever one to miss a ham-handed attempt to make anything about himself, the former president and almost certain 2024 GOP nominee took to his Truth Social just hours before the Super Bowl. In a swerv... [2777 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "'Made her so much money'",
      "description": "\"I signed and was responsible for the Music Modernization Act for Taylor Swift and all other Musical Artists. Joe Biden didn’t do anything for Taylor, and never will,\" Trump wrote on Truth Social.",
      "url": "https://nypost.com/2024/02/11/news/trump-credits-himself-for-taylor-swifts-fortune-made-her-so-much-money/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/02/newspress-collage-3qrfzpkhx-1707682652114.jpg?quality=75&strip=all&1707664831&w=1024",
      "publishedAt": "2024-02-11T20:08:03Z",
      "content": "Donald Trump kicked off Super Bowl Sunday by bashing Travis Kelce and Taylor Swift in a rant on social media — branding the Kansas City Chief star as a “liberal” and his singer-songwriter girlfriend “disloyal.”\nTrump took credit for Swift’s meteoric ... [2577 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Murphy says GOP voted against border bill to keep border ‘chaotic,’ help Trump campaign",
      "description": "Sen. Chris Murphy (D-Conn.) hit the GOP over the tanked bipartisan Senate border bill on Sunday, claiming House Republicans decided to kill the bill in order to help former President Trump win the 2024 election. The sweeping border security and asylum overhaul bill initially had strong bipartisan support in the Senate last week, but it…",
      "url": "https://thehill.com/homenews/senate/4461719-murphy-says-gop-voted-against-border-bill-to-keep-border-chaotic-help-trump-campaign/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/02/murphychris_020724gn01_w.jpg?w=1280",
      "publishedAt": "2024-02-11T20:06:43Z",
      "content": "Sen. Chris Murphy (D-Conn.) hit the GOP over the tanked bipartisan Senate border bill on Sunday, claiming House Republicans decided to kill the bill in order to help former President Trump win the 2024 election.\nThe sweeping border security and asylu... [1671 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "TheJournal.ie"
      },
      "author": "TheJournal.ie",
      "title": "Here's What Happened Today: Sunday",
      "description": "Ireland triumph over Italy, tributes paid to young boy in Waterford, and Trump criticised by NATO and EU leaders.",
      "url": "https://www.thejournal.ie/evening-fix-181-6296852-Feb2024/",
      "urlToImage": "https://img2.thejournal.ie/article/6296852/river/?height=400&version=6296863",
      "publishedAt": "2024-02-11T20:02:09Z",
      "content": "NEED TO CATCH up? TheJournal brings you all of today’s top stories.\nIRELAND\nThe Dragon of the Lung Ying Academy of the Shaolin Buddhist Temple Slane during the Dublin Lunar New Year Festival on Drury Street Dublin. DublinTown, Dublin City Council. An... [684 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Schiff slams Trump over NATO remarks: ‘Putin must be absolutely thrilled’",
      "description": "Rep. Adam Schiff (D-Calif.) slammed former President Trump over his recent remarks on NATO, saying Russian President Vladimir Putin must be “thrilled” about the comments. “Oh, Putin must be absolutely thrilled. If you look at it from Putin’s perspective, you know, the war isn’t going well in Ukraine for Russia. Russians keep coming back in…",
      "url": "https://thehill.com/homenews/campaign/4461722-schiff-slams-trump-over-nato-remarks-putin-must-be-absolutely-thrilled/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/09/schiffadam_092023mn01_w.jpg?w=1280",
      "publishedAt": "2024-02-11T19:58:47Z",
      "content": "Rep. Adam Schiff (D-Calif.) slammed former President Trump over his recent remarks on NATO, saying Russian President Vladimir Putin must be “thrilled” about the comments.\n“Oh, Putin must be absolutely thrilled. If you look at it from Putin’s perspect... [1581 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Variety"
      },
      "author": "Variety",
      "title": "Trump 'Did Nothing' on Music Modernization, Despite Taylor Swift Claim",
      "description": "Former President Trump 'did nothing' for the Music Modernization Act, attorney says, despite his claim to have made Taylor Swift 'so much money.'",
      "url": "https://variety.com/2024/music/news/trump-did-nothing-on-music-modernization-taylor-swift-1235907368/",
      "urlToImage": "https://variety.com/wp-content/uploads/2023/08/GettyImages-1579471628-e1691435010223.jpg?w=1000&h=563&crop=1",
      "publishedAt": "2024-02-11T19:40:33Z",
      "content": "In an apparent attempt to undercut Taylor Swift’s potential influence on the presidential election later this year, former president Donald Trump issued a statement on his Truth Social platform Sunday claiming credit for the 2018 Music Modernization ... [4043 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "GOP senators defy Trump by advancing foreign aid bill",
      "description": "The vote was a decisive 67-27.",
      "url": "https://www.politico.com/news/2024/02/11/gop-senators-defy-trump-by-advancing-foreign-aid-00140868",
      "urlToImage": "https://static.politico.com/0c/60/daf9682e4ce39b1010042c64e2cb/u-s-congress-35492.jpg",
      "publishedAt": "2024-02-11T19:24:08Z",
      "content": "“From this point forward, are you listening U.S. Senate (?),” Trump wrote on Truth Social. “No money in the form of foreign aid should be given to any country unless it is done as a loan, not just a giveaway.”\nTrump had helped tank the bipartisan bor... [2710 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "Senators push forward with Ukraine aid package as their leaders say the world is watching",
      "description": "WASHINGTON (AP) — As former President Donald Trump and a growing number of Republicans oppose U.S. aid to Ukraine, the Senate's leaders argued in strong terms on Sunday that the",
      "url": "https://www.thestar.com/news/world/united-states/senators-push-forward-with-ukraine-aid-package-as-their-leaders-say-the-world-is-watching/article_85224ee7-86fd-54cc-94ac-7a5741962124.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/8/70/870499c4-706b-53c9-9e5d-242cf5b37db6/65c91b88b12a9.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2024-02-11T19:07:00Z",
      "content": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada N... [719 chars]"
    }
  ]
}
