{
  "status": "ok",
  "totalResults": 178,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Yahoo Canada Finance"
      },
      "author": "Yahoo Canada Finance",
      "title": "Trump Files Emergency Appeal to Supreme Court on Immunity Claim",
      "description": "Donald Trump asked the Supreme Court on Monday to pause a lower court ruling that denied him presidential immunity in a federal case alleging he plotted to overturn the 2020 election results. Photo: Julia Nikhinson/AFP/Getty",
      "url": "https://ca.finance.yahoo.com/video/trump-files-emergency-appeal-supreme-232000087.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/WTl.SzBR1lsC0S.auhmvRA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/wall_street_journal_733/87b41a4e793f0fa8dfca3f3e1467967b",
      "publishedAt": "2024-02-12T23:20:00Z",
      "content": "The Canadian Press\nLOS ANGELES (AP) — Tiger Woods is starting a new year with a new look. Just not a different color. Woods makes his 2024 debut this week in the Genesis Invitational at Riviera, a signature event on the PGA Tour for which he is the t... [269 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Judge to proceed with hearing to consider motion to disqualify Fani Willis from Trump Georgia election case",
      "description": "Fulton County judge to move forward with evidentiary hearing to consider Trump co-defendant's motion to disqualify Fani Willis from Georgia election interference case.",
      "url": "https://www.cbsnews.com/news/judge-hearing-consider-motion-to-dismiss-trump-georgia-case/",
      "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/09/08/903e60d5-8893-4581-b70b-181f8e5f07ee/thumbnail/1200x630/f0d0931174a5b463cfd6ba0cb4476de4/gettyimages-1615638002.jpg?v=b776bbc665e28d385e06ef913c5ff9ae",
      "publishedAt": "2024-02-12T23:15:39Z",
      "content": "Fani Willis to admit relationship with lawyer on Trump case, but denies conflict in court filing\nFulton County Superior Court Judge Scott McAfee says he'll move forward with an evidentiary hearing Thursday to consider a Trump co-defendant's motion to... [2539 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Chairman of the Joint Chiefs says ‘US credibility is at stake’ when asked about Trump’s NATO comments",
      "description": "Chairman of the Joint Chiefs of Staff Gen. CQ Brown told NBC News in an interview Monday that “US credibility is at stake” after he was asked about comments from former President Donald Trump that he would encourage Russia to “do whatever the hell they want” to NATO partners that don’t meet spending guidelines on defense.",
      "url": "https://edition.cnn.com/2024/02/12/politics/cq-brown-nato-trump/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1241837090.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-02-12T23:13:14Z",
      "content": "CNN —\nChairman of the Joint Chiefs of Staff Gen. CQ Brown said Monday that “US credibility is at stake” in the wake of comments from former President Donald Trump that he would encourage Russia to “do whatever the hell they want” to NATO partners tha... [4587 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "What happens if a presidential candidate dies or has to leave the race?",
      "description": "While the 2024 presidential race seems set in stone as a rematch between President Joe Biden and former President Donald Trump, it’s also true that things happen.",
      "url": "https://edition.cnn.com/2024/02/12/politics/presidential-candidate-race-drop-what-matters/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-610522944.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-02-12T23:10:53Z",
      "content": "A version of this story appeared in CNN’s What Matters newsletter. To get it in your inbox, sign up for free here.\nCNN —\nWhile the 2024 presidential race seems set in stone as a rematch between President Joe Biden and former President Donald Trump, i... [8627 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBC.ca"
      },
      "author": "CBC.ca",
      "title": "Donald Trump turns to Supreme Court in bid for presidential immunity",
      "description": "Donald Trump on Monday turned to the U.S. Supreme Court as he presses his claim — rejected by lower courts — that he is immune from being prosecuted for trying to overturn his 2020 election loss because he was serving as president when he took those actions.",
      "url": "https://www.cbc.ca/news/world/trump-immunity-supreme-court-1.7112996",
      "urlToImage": "https://i.cbc.ca/1.7113008.1707778186!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/donald-trump-presidential-campaign-rally-feb-10.JPG",
      "publishedAt": "2024-02-12T23:09:52Z",
      "content": "Donald Trump on Monday turned to the U.S. Supreme Court as he presses his claim — rejected by lower courts — that he is immune from being prosecuted for trying to overturn his 2020 election loss because he was serving as president when he took those ... [4718 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump takes 11-point lead over Biden on economy: Poll",
      "description": "Former President Trump has a large lead over President Biden in a new poll released by the Financial Times that shows him ahead by 11 points on the question of who would best handle the economy, often the key issue in a presidential election. About 42 percent of respondents in the poll released Sunday said…",
      "url": "https://thehill.com/homenews/campaign/4463879-trump-takes-11-point-lead-over-biden-on-economy-poll/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/11/trumpdonald_bidenjoe_092523gn03_w.jpg?w=1280",
      "publishedAt": "2024-02-12T23:01:34Z",
      "content": "Former President Trump has a large lead over President Biden in a new poll released by the Financial Times that shows him ahead by 11 points on the question of who would best handle the economy, often the key issue in a presidential election.\nAbout 4... [1875 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "2020 'Lawyers for Trump' volunteer deemed competent to stand trial on Jan. 6 charges",
      "description": "Kellye SoRelle, who served as a lawyer for Donald Trump and the Oath Keepers, was deemed competent to stand trial last week.",
      "url": "https://www.nbcnews.com/politics/justice-department/2020-lawyers-trump-volunteer-deemed-competent-stand-trial-jan-6-charge-rcna137746",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-09/220708-Kellye-SoRelle-jan-6-capitol-mn-1121-752056.jpg",
      "publishedAt": "2024-02-12T22:55:34Z",
      "content": "WASHINGTON — A \"Lawyers for Trump\" volunteer whose election conspiracy theory video was shared by one of former President Donald Trump's sons in 2020 was ordered released from Bureau of Prisons custody last week ahead of her trial on Jan. 6 charges.\n... [3104 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "‘Everyone should be scared as hell’: Democrats call for Trump-proofing NATO",
      "description": "Trump would be barred from pulling the U.S. out of the alliance as president. But there are other ways he could undermine it.",
      "url": "https://www.politico.com/news/2024/02/12/democrats-guardrails-nato-trump-00141041",
      "urlToImage": "https://static.politico.com/b0/65/c6bb69b34302946d25e35445325e/senate-budget-committee-hearing-41574.jpg",
      "publishedAt": "2024-02-12T22:52:35Z",
      "content": "Lawmakers touted defense policy legislation signed into law in December that prevents any president from withdrawing the U.S. from NATO without approval from the Senate or an act of Congress. Yet on Monday, Democrats acknowledged that the guardrail t... [6401 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Trump asks Supreme Court to pause immunity ruling in 2020 election case",
      "description": "Former President Donald Trump asked the Supreme Court to pause a lower court's ruling that rejected his claims of presidential immunity.",
      "url": "https://www.cbsnews.com/news/trump-supreme-court-immunity-2020-election-case/",
      "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/02/12/eda38d5e-fbf4-48fc-a96b-cd76ab372945/thumbnail/1200x630g2/3eb96e60927eed087b3ea3808070f544/gettyimages-1995694336.jpg?v=b776bbc665e28d385e06ef913c5ff9ae",
      "publishedAt": "2024-02-12T22:52:00Z",
      "content": "Washington — Former President Donald Trump has asked the Supreme Court to pause a lower court's decision that rejected his broad claims of immunity from criminal prosecution in the federal case related to the 2020 election.\nIn a 39-page filing on Mon... [6824 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Trump seeks Supreme Court intervention in election subversion case",
      "description": "Former President Donald Trump is turning to the justices in a last-ditch effort to prevent his prosecution in the federal election interference case from moving closer to trial.",
      "url": "https://www.nbcnews.com/politics/supreme-court/trump-seeks-supreme-court-intervention-election-interference-case-rcna137694",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-02/240207-trump-seeks-supreme-court-intervention-ch-1201-123497.jpg",
      "publishedAt": "2024-02-12T22:46:55Z",
      "content": "WASHINGTON — Former President Donald Trump on Monday filed a last-ditch request at the Supreme Court seeking to prevent his prosecution for attempting to overturn the 2020 election from moving closer to trial.\nTrump asked the justices to put on hold ... [3820 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "Haley turns Trump’s attack on husband into centerpiece of campaign",
      "description": "Trump gave Haley an opening when he went after her husband.",
      "url": "https://www.politico.com/news/2024/02/12/nikki-haley-donald-trump-husband-attack-00141040",
      "urlToImage": "https://static.politico.com/fc/6d/f5efffa44c87ab82a74d624a660f/election-2024-haley-89133.jpg",
      "publishedAt": "2024-02-12T22:34:39Z",
      "content": "“You mock one veteran, you’re mocking all veterans,” Haley said on Fox News on Monday.\nShe twice referred to Trump’s remarks — in which he questioned her husband’s whereabouts — as “disgusting.” At a campaign stop in her state Monday, she described T... [4163 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Haley goes on the attack after Trump mocks her deployed husband",
      "description": "Former South Carolina Gov. Nikki Haley is hammering Donald Trump over his comments mocking the absence of her husband, who is deployed overseas, and using the former president’s remarks to highlight his long history of disparaging members of the military.",
      "url": "https://edition.cnn.com/2024/02/12/politics/nikki-haley-husband-trump-attack/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2005248463.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-02-12T22:32:15Z",
      "content": "CNN —\nFormer South Carolina Gov. Nikki Haley is hammering Donald Trump over his comments mocking the absence of her husband, who is deployed overseas, and using the former president’s remarks to highlight his long history of disparaging members of th... [4796 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "POLITICO"
      },
      "author": "POLITICO",
      "title": "Judge in Trump’s Georgia case will hear evidence on prosecutors’ romantic relationship",
      "description": "District Attorney Fani Willis asked the judge to cancel a Thursday hearing, but the judge denied the request.",
      "url": "https://www.politico.com/news/2024/02/12/judge-in-trumps-georgia-case-will-hear-evidence-on-prosecutors-romantic-relationship-00141055",
      "urlToImage": "https://static.politico.com/a4/38/a5fa7daa45f99d917d6309ad858b/georgia-election-indictment-13274.jpg",
      "publishedAt": "2024-02-12T22:30:17Z",
      "content": "Though the judge made clear he had not decided whether there is any merit to the allegations, his decision was a blow to prosecutors who had hoped he would call off the entire thing. Anna Cross, a deputy for Willis who has handled key proceedings in ... [3829 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "'Bizarre first sentence': Ex-prosecutor slams Trump's presidential immunity plea to SCOTUS",
      "description": "Former President Donald Trump’s request that the Supreme Court consider his presidential immunity claim managed to hit a “bizarre” and “incredibly inappropriate” tone by the end of its first sentence, former Justice Department prosecutor Andrew Weissmann said Monday. Weissmann was shocked that a...",
      "url": "https://www.rawstory.com/trump-scotus-presidential-immunity-argument/",
      "urlToImage": "https://www.rawstory.com/media-library/trump-tricking-supporters-into-believing-he-was-robbed-so-he-can-rant-and-rave-in-his-underwear-at-biden-michael-steele.jpg?id=24702770&width=1200&height=600&coordinates=0%2C15%2C0%2C15",
      "publishedAt": "2024-02-12T22:29:24Z",
      "content": "Former President Donald Trump’s request that the Supreme Court consider his presidential immunity claim managed to hit a “bizarre” and “incredibly inappropriate” tone by the end of its first sentence, former Justice Department prosecutor Andrew Weiss... [1889 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "Donald Trump will make campaign stop in Michigan this weekend",
      "description": "Former President Donald Trump will make his first Michigan campaign stop of the 2024 election year in Oakland County on Saturday. Trump's campaign announced the visit Monday. The Republican candidate will hold a \"get out the vote\" rally at 7 p.m. at a venue at the Oakland County International Airpor...",
      "url": "https://www.rawstory.com/donald-trump-will-make-campaign-stop-in-michigan-this-weekend/",
      "urlToImage": "https://www.rawstory.com/media-library/image.jpg?id=51450716&width=980",
      "publishedAt": "2024-02-12T22:16:29Z",
      "content": "Additionally, she added, Justice Clarence Thomas — whose wife was heavily involved in the effort to overturn the election — needs to bow out of this altogether.\n\"So, the former president's trying to rewrite history,\" said Cooper. \"Ludicrously now cla... [1441 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "Scholz warns against playing with Europe's security after Trump jibes",
      "description": "Following U.S. presidential candidate Donald Trump's statements on NATO support, German Chancellor Olaf Scholz has reaffirmed the alliance's common defense. \"NATO'S promise of protection applies unreservedly. All for one. One for all,\" Scholz said on Monday in Berlin at a meeting with the new, pro-E...",
      "url": "https://www.rawstory.com/scholz-warns-against-playing-with-europe-s-security-after-trump-jibes/",
      "urlToImage": "https://www.rawstory.com/media-library/image.jpg?id=51450691&width=980",
      "publishedAt": "2024-02-12T22:12:33Z",
      "content": "That's not at all accurate to how the interview really went, said Biden's personal lawyer Bob Bauer in an interview with MSNBC's Jen Psaki, herself a veteran of the Biden administration.\n\"You are in the room sitting next to him,\" said Psaki. \"I know ... [2239 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Donald Trump Starts Second Supreme Court Fight",
      "description": "Trump is asking the Supreme Court to stop his federal felony election interference case.",
      "url": "https://www.newsweek.com/donald-trump-starts-second-supreme-court-fight-1869309",
      "urlToImage": "https://d.newsweek.com/en/full/2348246/donald-trump-speaks-mar-lago.jpg",
      "publishedAt": "2024-02-12T22:08:45Z",
      "content": "Former President Donald Trump has filed a Supreme Court appeal to his previously rejected claim that presidential immunity should shield him from facing federal election interference charges.\nA decision by a Washington, D.C. federal appeals court las... [3422 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Trump asks US supreme court to keep election interference case frozen",
      "description": "Ex-president met deadline imposed by federal appeals case to keep the criminal case on hold as he prepares a last-ditch challenge",
      "url": "https://www.theguardian.com/us-news/2024/feb/12/trump-election-interference-case-stay-delay",
      "urlToImage": "https://i.guim.co.uk/img/media/951868f9668a78f339126d0b8922b7565061b5bf/0_133_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c6b490e111caf2eb175fb54613a50df2",
      "publishedAt": "2024-02-12T22:08:25Z",
      "content": "Lawyers for Donald Trump asked the US supreme court Monday to keep on hold the criminal case over his efforts to overturn the 2020 election results while he prepares to challenge a recent appeals court ruling that found he was not immune from prosecu... [5985 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "News18"
      },
      "author": "News18",
      "title": "Trump Asks Supreme Court To Put Off His Election Interference Trial, Claiming Immunity",
      "description": "Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.",
      "url": "https://www.news18.com/world/trump-asks-supreme-court-to-put-off-his-election-interference-trial-claiming-immunity-8776686.html",
      "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/10/world_section_default_image_crop-2023-10-646b43185e7dac20bd43538112f430e4-16x9.jpg?impolicy=website&width=1200&height=675",
      "publishedAt": "2024-02-12T22:00:54Z",
      "content": "WASHINGTON: Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.\nHis lawyers filed an emergenc... [4870 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Irish Times"
      },
      "author": "The Irish Times",
      "title": "Trump asks US supreme court to intervene as he presses immunity bid",
      "description": "Prosecutors argued Trump acted as a candidate when pressuring officials to overturn 2020 election and called on supporters to march on US Capitol",
      "url": "https://www.irishtimes.com/world/us/2024/02/12/trump-asks-us-supreme-court-to-intervene-as-he-presses-immunity-bid/",
      "urlToImage": "https://www.irishtimes.com/resizer/KE76F0wo-PaJbFMIfrvvyc5PNs4=/1200x630/filters:format(jpg):quality(70):focal(5155x1819:5165x1829)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/4DNAGW3GJ3S3HEJCGDKAV6VSLI.jpg",
      "publishedAt": "2024-02-12T22:00:00Z",
      "content": "Donald Trump is the first former US president to be criminally prosecuted. Photograph: Matt Rourke/AP\nFormer US president Donald Trump on Monday turned to the country’s supreme court as he presses his claim – rejected by lower courts – that he is imm... [3825 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Judge in Trump election case says it's 'possible' D.A. Fani Willis could be disqualified over misconduct allegations",
      "description": "ATLANTA — The Georgia judge presiding over the election interference case against former President Donald Trump gave the green light Monday for a hearing this week involving misconduct allegations against Fulton County District Attorney Fani Willis and said her disqualification from the case is \"possible.\"",
      "url": "https://www.nbcnews.com/politics/donald-trump/judge-trump-election-case-says-possible-d-fani-willis-disqualified-mis-rcna138477",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-02/240212-Judge-Scott-McAfee-ew-427p-d7ba10.jpg",
      "publishedAt": "2024-02-12T21:53:10Z",
      "content": "ATLANTA — The Georgia judge presiding over the election interference case against former President Donald Trump gave the green light Monday for a hearing this week involving misconduct allegations against Fulton County District Attorney Fani Willis a... [2816 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The New York Times"
      },
      "author": "The New York Times",
      "title": "Here Are the Republicans Breaking With Their Party to Back Ukraine Aid",
      "description": "Party leaders, national security institutionalists and centrists make up the 17 Republicans who joined Democrats in breaking a filibuster against the military aid, defying former President Donald J. Trump.",
      "url": "https://www.nytimes.com/2024/02/12/us/politics/republican-defectors-ukraine-aid.html",
      "urlToImage": "https://static01.nyt.com/images/2024/02/12/multimedia/12dc-senate-wjhp/12dc-senate-wjhp-facebookJumbo.jpg",
      "publishedAt": "2024-02-12T21:50:15Z",
      "content": "Seventeen Senate Republicans have bucked a majority of their party and former President Donald J. Trump in joining Democrats to push military assistance for Ukraine toward approval in the Senate, highlighting a widening foreign policy divide in the c... [844 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "WIS10"
      },
      "author": "WIS10",
      "title": "Trump asks Supreme Court to put off his election interference trial, claiming immunity",
      "description": "The former president's lawyers filed an emergency appeal with the court on Monday, just four days after the justices heard Trump’s separate appeal to remain on the presidential ballot.",
      "url": "https://www.wistv.com/2024/02/12/trump-asks-supreme-court-put-off-his-election-interference-trial-claiming-immunity/",
      "urlToImage": "https://gray-wistv-prod.cdn.arcpublishing.com/resizer/v2/2ZCVJLJVYYGPZLWSHANYN7YQXY.jpg?auth=de71de3fb6320509addac623ecba2b125178e3fdf4a5687406ac0fcebde3a668&width=1200&height=600&smart=true",
      "publishedAt": "2024-02-12T21:47:56Z",
      "content": "WASHINGTON (AP) — Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution on charges he plotted to overturn his 2020 election loss.\nHis lawyers filed an em... [5529 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "WLTX.com"
      },
      "author": "WLTX.com",
      "title": "Trump asks Supreme Court to delay election interference trial",
      "description": "Former President Donald Trump is asking the Supreme Court to extend the delay in his election interference trial, saying he is immune from prosecution.",
      "url": "https://www.wltx.com/article/news/nation-world/trump-supreme-court-election-interference-trial-immunity/507-2fa5d521-caeb-4aca-b318-968adb37ba2a",
      "urlToImage": "https://media.wltx.com/assets/CCT/images/c8c67528-4127-401f-9bd9-8c846d7aeed9/c8c67528-4127-401f-9bd9-8c846d7aeed9_1140x641.jpg",
      "publishedAt": "2024-02-12T21:47:12Z",
      "content": "His lawyers filed an emergency appeal with the court on Monday, just four days after the justices heard Trump’s separate appeal to remain on the presidential ballot.\nHis lawyers filed an emergency appeal with the court on Monday, just four days after... [4272 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The New York Times"
      },
      "author": "The New York Times",
      "title": "Senate Pushes Ukraine Aid Bill Toward Passage as G.O.P. Splinters",
      "description": "The legislation passed its final hurdle as a coalition of Republican senators, resisting pressure from the right wing and former President Donald J. Trump, joined Democrats to move it toward a final vote.",
      "url": "https://www.nytimes.com/2024/02/12/us/politics/senate-ukraine-aid.html",
      "urlToImage": "https://static01.nyt.com/images/2024/02/12/multimedia/12dc-cong-vtpf/12dc-cong-vtpf-facebookJumbo.jpg",
      "publishedAt": "2024-02-12T21:46:21Z",
      "content": "A bipartisan coalition of senators on Monday night pushed a $95 billion foreign aid package for Ukraine and Israel to the brink of passage, as Republicans fractured bitterly over the bill, with opponents threatening to fight it until the very end.\nOn... [1088 chars]"
    }
  ]
}