{
  "status": "ok",
  "totalResults": 344,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Page Six"
      },
      "author": "Page Six",
      "title": "Donald Trump Jr. says he and ex Kimberly Guilfoyle share ‘special bond’: We ‘will never stop caring for each other’",
      "description": "Donald Trump Jr. comes to Kimberly Guilfoyle's defense in an exclusive statement to Page Six, saying they \"will always keep a special bond.\"",
      "url": "https://pagesix.com/2024/12/13/gossip/donald-trump-jr-says-he-and-ex-kimberly-guilfoyle-share-special-bond-we-will-never-stop-caring-for-each-other/",
      "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2024/12/95304183.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-12-13T23:57:59Z",
      "content": "Donald Trump Jr. says he and Kimberly Guilfoyle will “never stop caring for each other.”\nThe President-elect’s son exclusively told Page Six in a statement on Friday — after we exclusively reported that the couple has parted ways — “Kimberly and I wi... [4045 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Deadline",
      "title": "Donald Trump Ordered To Sit For Deposition Next Week In His Defamation Lawsuit Against ABC",
      "description": "Trump sued the network over remarks made by George Stephanopoulos",
      "url": "https://deadline.com/2024/12/trump-abc-defamation-lawsuit-1236203554/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2024/11/GettyImages-2185178383.jpg?w=1024",
      "publishedAt": "2024-12-13T23:57:06Z",
      "content": "Donald Trump has been ordered by a federal judge to sit for a deposition next week as part of his defamation litigation against ABC.\nU.S. Magistrate Judge Lisette M. Reid wrote that the deposition should take place some time the week of Dec. 14 and s... [1473 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "U.S. News Roundup: From Daylight Saving Disputes to Supreme Court Decisions",
      "description": "The current U.S. domestic news video covers a variety of topics. Trump calls to end daylight saving time citing inconvenience. The Supreme Court will review California emission standards. Texas AG's abortion pill lawsuit, FAA streamlining, car-crash requirement recommendations, and the Supreme Court's tax exemption case also feature prominently.",
      "url": "https://www.devdiscourse.com/article/politics/3193783-us-news-roundup-from-daylight-saving-disputes-to-supreme-court-decisions",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/05_06_2024_10_03_27_677469.png?width=920&format=jpeg",
      "publishedAt": "2024-12-13T23:52:33Z",
      "content": "In a series of developments in the United States, President-elect Donald Trump has voiced his intention to eliminate daylight saving time, calling it both inconvenient and costly for the nation. This stance, supported by the Republican Party, targets... [646 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Inquisitr"
      },
      "author": "The Inquisitr",
      "title": "‘The View’ Host Whoopi Goldberg Calls Trump’s Second Term in the White House as ‘Having a Period Again'",
      "description": "“He’s the president. I’m still not going to say his name. That’s not going to change,” Goldberg remarked.",
      "url": "https://www.inquisitr.com/the-view-host-whoopi-goldberg-calls-trumps-second-term-in-the-white-house-as-having-a-period-again",
      "urlToImage": "https://dab57h0r8ahff.cloudfront.net/727230/uploads/96756220-b967-11ef-9e4d-45e99159c22e_1200_630.jpeg",
      "publishedAt": "2024-12-13T23:45:00Z",
      "content": "The View moderator Whoopi Goldberg went through a historic meltdown after former President Donald Trump was reelected on November 5. “So what happened last night?” Goldberg began on the popular daytime talk show. “He is the president. I am still not ... [3074 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Kennedy’s lawyer has asked the FDA to revoke its approval of the polio vaccine",
      "description": "President-elect Donald Trump has praised the polio vaccine as the “greatest thing,” but a lawyer affiliated with Trump’s pick to lead the country’s top health agency has petitioned the US Food and Drug Administration to revoke approval of the vaccine used in the United States.",
      "url": "https://edition.cnn.com/2024/12/13/health/kennedy-lawyer-fda-polio-vaccine/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1242560083.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-12-13T23:43:36Z",
      "content": "CNN —\nPresident-elect Donald Trump has praised the polio vaccine as the “greatest thing,” but a lawyer affiliated with Trump’s pick to lead the country’s top health agency has petitioned the US Food and Drug Administration to revoke approval of the v... [6860 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Donald Trump 'eyes deal' for Waldorf Astoria DC hotel",
      "description": "President-elect Donald Trump is weighing a bid to save the failing Waldorf-Astoria hotel in Washington, DC – and rebrand it once more as a Trump International Hotel, The Post has learned.",
      "url": "https://nypost.com/2024/12/13/business/donald-trump-eyes-deal-for-waldorf-astoria-dc-hotel/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/12/newspress-collage-6fdc8sx4e-1734132766063.jpg?quality=75&strip=all&1734114824&w=1024",
      "publishedAt": "2024-12-13T23:34:24Z",
      "content": "President-elect Donald Trump is weighing a bid to save the failing Waldorf-Astoria hotel in Washington, DC – and rebrand it once more as a Trump International Hotel, The Post has learned.\nThree sources familiar with the situation said that the incomi... [3263 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Diplomatic Movements: Trump's Envoys in the Middle East",
      "description": "Donald Trump's Middle East envoy, Steve Witkoff, visited Saudi Arabia and met with Crown Prince Mohammed Bin Salman. Separately, Massad Boulos, a senior adviser on Arab and Middle East issues, had a meeting with the Qatari prime minister in Doha. These visits signify ongoing diplomatic efforts in the region.",
      "url": "https://www.devdiscourse.com/article/politics/3193775-diplomatic-movements-trumps-envoys-in-the-middle-east",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/28_05_2024_02_16_00_7659139.png?width=920&format=jpeg",
      "publishedAt": "2024-12-13T23:26:01Z",
      "content": "Donald Trump's Middle East envoy, Steve Witkoff, made headlines by visiting Saudi Arabia for a key meeting with Crown Prince Mohammed Bin Salman. According to sources cited by Axios, the discussions took place on Wednesday, underlining significant di... [565 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo Finance"
      },
      "author": "Yahoo Finance",
      "title": "Apple CEO Tim Cook to meet with Trump on Friday",
      "description": "Apple CEO Tim Cook will meet Donald Trump on Friday night at the U.S. president-elect's Mar-a-Lago resort in Florida, a source familiar with the matter told Reuters. Business leaders have attempted to establish a positive rapport with Trump since his election win in November. Meta Platforms and Amazon have each donated $1 million to Trump's inaugural fund.",
      "url": "https://finance.yahoo.com/news/apple-ceo-tim-cook-meet-232404859.html",
      "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/64056b6fb5224383d905f9a8a3967ae9",
      "publishedAt": "2024-12-13T23:24:04Z",
      "content": "By Nandita Bose and Kanishka Singh\n(Reuters) - Apple CEO Tim Cook will meet Donald Trump on Friday night at the U.S. president-elect's Mar-a-Lago resort in Florida, a source familiar with the matter told Reuters.\nBusiness leaders have attempted to es... [1085 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump and Cook to Discuss Tech Regulations in Key Meeting",
      "description": "Apple CEO Tim Cook is set to meet with President-elect Donald Trump at Mar-a-Lago. Major businesses like Meta Platforms and Amazon are contributing to Trump's inaugural fund, highlighting the ongoing interaction between Trump's administration and tech giants amidst European regulatory scrutiny.",
      "url": "https://www.devdiscourse.com/article/technology/3193772-trump-and-cook-to-discuss-tech-regulations-in-key-meeting",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/01_08_2024_09_31_56_0434395.png?width=920&format=jpeg",
      "publishedAt": "2024-12-13T23:23:47Z",
      "content": "Apple CEO Tim Cook is scheduled to meet with U.S. President-elect Donald Trump at Mar-a-Lago, Florida, according to a source familiar with the plans. The discussion marks a significant engagement as major business leaders aim to build relationships w... [821 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Make Iran pay for its murders",
      "description": "The mullahs' regime is a terrorist mafia masquerading as a government — and a revival of President Trump's maximum pressure campaign is the only possible response.",
      "url": "https://nypost.com/2024/12/13/opinion/nova-festival-survivor-make-iran-pay-for-its-murders/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/12/iranian-supreme-leader-commander-in-94390655.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-12-13T23:23:31Z",
      "content": "The Iranian regime is obsessive: It obsessively hates Israel and the United States, it obsessively persecutes women, and it obsessively targets dissidents, Jews and politicians abroad.\nEven as the Revolutionary Islamic Government’s proxy forces falte... [3965 chars]"
    }
  ]
}