{
  "status": "ok",
  "totalResults": 553,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Washington Examiner"
      },
      "author": "Washington Examiner",
      "title": "Gaetz is not the only Trump nominee who faces ‘danger’ in confirmation: Tiana Lowe Doescher",
      "description": "Rep. Matt Gaetz's (R-FL) nomination for AG has stirred much controversy and doubt, in addition to that of RFK Jr., who was tapped for HHS secretary.",
      "url": "https://www.washingtonexaminer.com/news/3236897/gaetz-not-only-trump-nominee-faces-danger-tiana-lowe-doescher/",
      "urlToImage": "https://www.washingtonexaminer.com/wp-content/uploads/2024/11/Gaetz-and-Vance-scaled.webp",
      "publishedAt": "2024-11-20T23:55:37Z",
      "content": "The Washington Examiner’s Tiana Lowe Doescher suggested there is more than one nominee for Trump’s Cabinet who faces “danger” in his confirmation, despite the brunt of attention being given to former Rep. Matt Gaetz (R-FL).\nDoescher noted that presid... [2723 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Health Policy Picks Stir Controversy: OMB, FDA, and More",
      "description": "Donald Trump is planning to appoint Russell Vought as director of the Office of Management and Budget. Additionally, Trump is likely to choose Martin Makary for the FDA. Meanwhile, Bill Hwang was sentenced for financial fraud, and calls for higher pilot retirement age surface. Other legal proceedings and charges continue amidst Trump's transition.",
      "url": "https://www.devdiscourse.com/article/politics/3164822-trumps-health-policy-picks-stir-controversy-omb-fda-and-more",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/12_11_2024_11_54_30_0859659.jpg?width=920&format=jpeg",
      "publishedAt": "2024-11-20T23:52:59Z",
      "content": "President-elect Donald Trump is poised to designate Russell Vought, a staunch conservative ally, to lead the U.S. Office of Management and Budget (OMB). This role would provide Vought the ability to shape significant budgeting and policy decisions, a... [664 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Dallas Morning News"
      },
      "author": "The Dallas Morning News",
      "title": "U.S. House Republicans reject releasing investigative report on Matt Gaetz -- for now",
      "description": "ouse Ethics Committee Republicans voted Wednesday against releasing the panel’s long-running investigation into President-elect Donald Trump’s nominee for...",
      "url": "https://www.dallasnews.com/news/elections/2024/11/20/us-house-republicans-reject-releasing-investigative-report-on-matt-gaetz-for-now/",
      "urlToImage": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/XXL3QTVPERLFMLRMGHM3ZYFAWM.jpg?auth=322d63fde12dba6533da951e55f265024471d04e5c5366304b3c08d0cb049736&height=630&width=1200&smart=true&quality=80",
      "publishedAt": "2024-11-20T23:47:16Z",
      "content": "WASHINGTON (AP) — House Ethics Committee Republicans voted Wednesday against releasing the panel’s long-running investigation into President-elect Donald Trump’s nominee for attorney general, former Rep. Matt Gaetz, the top Democrat on the panel said... [6896 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Makary Set to Lead America's Most Powerful Drug Regulator",
      "description": "U.S. President-elect Donald Trump is expected to nominate Johns Hopkins surgeon Martin Makary to head the FDA. Makary, known for his views on natural immunity and opposition to COVID vaccine mandates, could bring unconventional changes to the influential agency responsible for overseeing drugs, food safety, and medical devices.",
      "url": "https://www.devdiscourse.com/article/health/3164820-makary-set-to-lead-americas-most-powerful-drug-regulator",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_06_2019_18_22_44_8556925.png?width=920&format=jpeg",
      "publishedAt": "2024-11-20T23:42:07Z",
      "content": "Amidst a whirlwind of political appointments, President-elect Donald Trump is reportedly set to name Martin Makary, a renowned surgeon and writer from Johns Hopkins, as the new head of the Food and Drug Administration (FDA). According to sources clos... [914 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Mexico's First Female President Aims for Diplomatic Balance with Trump",
      "description": "Mexico's new president, Claudia Sheinbaum, plans to collaborate constructively with President-elect Donald Trump on reducing migration while advocating for humanitarian policies. She aims to propose a strategy addressing root causes of migration, maintaining strong U.S.-Mexico relations, and countering potential trade tensions.",
      "url": "https://www.devdiscourse.com/article/politics/3164818-mexicos-first-female-president-aims-for-diplomatic-balance-with-trump",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/20_11_2024_20_33_43_071878.jpg?width=920&format=jpeg",
      "publishedAt": "2024-11-20T23:39:45Z",
      "content": "Mexico's new president, Claudia Sheinbaum, outlined her approach to managing the country's relationship with the incoming U.S. President, Donald Trump, focusing on collaboration and humanitarian policies. She aims to address migration's root causes, ... [680 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Snopes.com"
      },
      "author": "Snopes.com",
      "title": "Trump's Director of National Intelligence Appointee Tulsi Gabbard Is on Terror Watchlist?",
      "description": "Gabbard herself has claimed the U.S. government placed her on a \"secret terror watchlist.\"",
      "url": "https://www.snopes.com/fact-check/trump-tulsi-gabbard-terror-watchlist/",
      "urlToImage": "https://mediaproxy.snopes.com/width/1200/https://media.snopes.com/2024/11/tulsi_gabbard_watchlist_repackage.png",
      "publishedAt": "2024-11-20T23:33:48Z",
      "content": "Claim: The Transportation Security Administration, which is part of the U.S. Department of Homeland Security, placed former U.S. Rep. Tulsi Gabbard on a \"secret terror watchlist.\" Rating: About this rating Research In Progress\nAfter U.S. President-el... [7514 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Huffington Post"
      },
      "author": "The Huffington Post",
      "title": "Linda McMahon, Trump's Education Secretary Pick, Named In Sex Abuse Lawsuit",
      "description": "Educators are sounding the alarm about Donald Trump’s choice to put the former WWE chief executive at the helm of public education.",
      "url": "https://www.huffpost.com/entry/linda-mcmahon-sex-abuse-lawsuit_n_673e4a3ce4b09ddca792c4d1",
      "urlToImage": "https://img.huffingtonpost.com/asset/673e4a8a1400002600c3b9bc.jpeg?ops=1200_630",
      "publishedAt": "2024-11-20T23:30:11Z",
      "content": "LOADING ERROR LOADING\nThroughout his campaign, President-elect Donald Trump smeared educators and teachers who support the LGTBQ+ community, accusing them of being child predators. But this week, he nominated Linda McMahon, the former CEO of World Wr... [5126 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "manilastandard.net"
      },
      "author": "manilastandard.net",
      "title": "Trump names loyalist Matthew Whitaker as NATO ambassador",
      "description": "President-elect Donald Trump, who has long criticized NATO as overly reliant on American money, on Wednesday nominated loyalist Matthew Whitaker to the",
      "url": "https://manilastandard.net/news/314526208/trump-names-loyalist-matthew-whitaker-as-nato-ambassador.html",
      "urlToImage": "https://cdn.manilastandard.net/wp-content/uploads/2024/11/Whitaker-x-Trump.jpg",
      "publishedAt": "2024-11-20T23:30:00Z",
      "content": "President-elect Donald Trump, who has long criticized NATO as overly reliant on American money, on Wednesday nominated loyalist Matthew Whitaker to the crucial post of ambassador to the alliance.\n“Matt is a strong warrior and loyal Patriot, who will ... [865 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Salon"
      },
      "author": "Salon",
      "title": "Should you make major purchases before Trump's tariffs?",
      "description": "Tariffs will likely lead to price increases, though by how much remains unclear",
      "url": "https://www.salon.com/2024/11/20/should-you-make-major-purchases-before-tariffs/",
      "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media2.salon.com/2024/11/man_shocked_looking_at_receipt_in_home_kitchen_2163954702.jpg",
      "publishedAt": "2024-11-20T23:29:03Z",
      "content": "Before Donald Trump became president, tariffs were a topic largely confined to history books. But as Trump prepares to reenter the White House with a proposal to significantly expand tariffs, they seem to be on everyone's mind.\nSeveral retailers affe... [7566 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Ethical Dilemma: Gaetz's Controversial Nomination",
      "description": "A congressional ethics panel is deadlocked on whether to release a report on alleged sexual misconduct by Matt Gaetz. The controversy centers on his nomination by President-elect Trump for attorney general. The Ethics Committee remains divided, and Gaetz's confirmation hangs in the balance.",
      "url": "https://www.devdiscourse.com/article/politics/3164817-ethical-dilemma-gaetzs-controversial-nomination",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_03_2023_17_01_14_2637398.png?width=920&format=jpeg",
      "publishedAt": "2024-11-20T23:28:25Z",
      "content": "A congressional ethics panel is at an impasse regarding the release of a report on allegations of sexual misconduct against Republican Matt Gaetz. The panel split on partisan lines, delaying a decision that has significant implications for Gaetz, who... [828 chars]"
    }
  ]
}