{
  "status": "ok",
  "totalResults": 91,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Strategic Appointments and Actions: A Bold Political Agenda",
      "description": "President-elect Donald Trump announces key appointments, including billionaires and former officials, to significant advisory roles. He addresses crucial issues such as Social Security, TikTok's US presence, and drug campaigns. Meanwhile, a shocking crime in New York City marks a tragic moment in public safety news.",
      "url": "https://www.devdiscourse.com/article/politics/3203941-trumps-strategic-appointments-and-actions-a-bold-political-agenda",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_12_2024_22_41_55_8456816.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T23:52:15Z",
      "content": "President-elect Donald Trump has made headlines with a flurry of strategic appointments ahead of his term. Among the appointees is billionaire Stephen Feinberg, tapped for deputy secretary of defense, along with other significant posts, including Mau... [522 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "World Events Shaping Nations: Crisis and Conflict Unraveled",
      "description": "The latest international news includes a Brazilian plane crash killing ten, Trump's Panama Canal threats, huge protests in Belgrade, Israel's challenging hospital evacuation order in Gaza, a deliberate missile strike by Russia in Ukraine, Turkey's stance on Kurdish militants in Syria, a tragic German Christmas market attack, and accidents in Turkey and Brazil.",
      "url": "https://www.devdiscourse.com/article/law-order/3203940-world-events-shaping-nations-crisis-and-conflict-unraveled",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/04_06_2024_10_18_36_5178798.png?width=920&format=jpeg",
      "publishedAt": "2024-12-22T23:51:54Z",
      "content": "In a tragic incident in Brazil, a small plane crashed into the commercial hub of Gramado, claiming the lives of all ten occupants, including the owner-pilot Luiz Claudio Galeazzi and his family. This shocking accident has left the nation mourning the... [627 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Katie Miller Joins Trump's Government Efficiency Team",
      "description": "President-elect Donald Trump has appointed Katie Miller, a former member of his administration, to an advisory board focused on reducing government spending and regulations. The board, led by Elon Musk and Vivek Ramaswamy, aims to cut waste and restructure federal agencies significantly.",
      "url": "https://www.devdiscourse.com/article/politics/3203938-katie-miller-joins-trumps-government-efficiency-team",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_16_56_48_7796591.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T23:49:35Z",
      "content": "On Sunday, President-elect Donald Trump announced the appointment of Katie Miller to an advisory board devoted to government efficiency. Miller, who previously served in Trump's administration, is among the first selections for the board, which will ... [701 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump Nominates Controversial Figure as Latin America Envoy",
      "description": "President-elect Donald Trump has announced the nomination of Mauricio Claver-Carone as special envoy to Latin America, despite Claver-Carone's controversial past, including a dismissal from his previous position due to alleged misconduct. Trump emphasized Claver-Carone's expertise in the region and priority on American interests.",
      "url": "https://www.devdiscourse.com/article/politics/3203937-trump-nominates-controversial-figure-as-latin-america-envoy",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_09_2022_10_05_49_0505799.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T23:45:11Z",
      "content": "In a recent announcement, President-elect Donald Trump declared his intention to appoint Mauricio Claver-Carone as his special envoy to Latin America. This decision comes despite Claver-Carone's previous dismissal from a high-profile role due to alle... [733 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo Finance"
      },
      "author": "Yahoo Finance",
      "title": "Trump appoints Bo Hines, an ex-college football player, to presidential crypto council",
      "description": "Hines will work with AI and crypto czar David Sacks on driving innovation in the digital asset sector.",
      "url": "https://finance.yahoo.com/news/trump-appoints-bo-hines-ex-233740545.html",
      "urlToImage": "https://media.zenfs.com/en/thestreet_881/cd955f895a1017f180b4aa5b10b6d9bb",
      "publishedAt": "2024-12-22T23:37:40Z",
      "content": "On Sunday, President-Elect Donald Trump unveiled Bo Hines as his pick for the executive director of a presidential crypto council.\n“In his new role, Bo will work with [incoming AI and crypto czar] David [Sacks] to foster innovation and growth in the ... [1763 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Panama Canal Gambit: Political Waves Stirring",
      "description": "Donald Trump hinted at efforts to regain the Panama Canal after deeming U.S. control was 'foolishly' ceded. Panama's president, José Raúl Mulino, opposed such a stance as a violation of sovereignty. Trump's remarks came amid GOP efforts to forge political unity at a rally while facing budget tensions.",
      "url": "https://www.devdiscourse.com/article/politics/3203934-trumps-panama-canal-gambit-political-waves-stirring",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_12_2024_22_41_55_8456816.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T23:33:56Z",
      "content": "In a controversial move, Donald Trump suggested his administration might attempt to reclaim the Panama Canal, criticizing the United States for 'foolishly' ceding control. He described current passage fees as 'ridiculous,' sparking diplomatic unease ... [599 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Huffington Post"
      },
      "author": "The Huffington Post",
      "title": "Trump Addresses Rumors About Elon Musk's 'Shadow Presidency'",
      "description": "Trump also talked about the TikTok ban and Robert F. Kennedy Jr. leading the health department.",
      "url": "https://www.huffpost.com/entry/donald-trump-elon-musk-shadow-presidency_n_67688f49e4b0a0e013ac5fc4",
      "urlToImage": "https://img.huffingtonpost.com/asset/676896251700002600373a11.jpeg?cache=ovEvEMba3V&ops=1200_630",
      "publishedAt": "2024-12-22T23:20:48Z",
      "content": "LOADING ERROR LOADING\nPresident-elect Donald Trump said he has not ceded the presidency to billionaire Elon Musk, calling that accusation a “hoax.”\n“No, he’s not taking the presidency,” Trump said Sunday at Turning Point USA’s AmericaFest conference ... [2450 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Trump tapping several who served in first administration for National Security Council roles",
      "description": "Brian McCormack, a longtime energy consultant, and Andrew Peek, a seasoned Middle East adviser, will take senior roles on the NSC, according to people familiar with the matter.",
      "url": "https://www.cbsnews.com/news/trump-national-security-council-appointments/",
      "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/12/22/bf2a5da8-3272-45e3-bc4b-d90e7a819f15/thumbnail/1200x630/91ab78d1adbfb6f26ae6f9f1548bb3fa/gettyimages-2190485630.jpg?v=fa9977353833f46f40b07abcd9d5240b",
      "publishedAt": "2024-12-22T22:55:57Z",
      "content": "President-elect Donald Trump is filling out his National Security Council with several officials who served in his first administration.\nBrian McCormack, a longtime energy consultant, and Andrew Peek, a seasoned Middle East adviser, will take senior ... [2641 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump Picks Feinberg and Colby for Key Defense Roles",
      "description": "President-elect Donald Trump has announced his nominations for top defense positions, selecting billionaire investor Stephen Feinberg as deputy secretary of defense, and Elbridge Colby, a noted China hawk, as undersecretary of defense for policy. These nominations come as Trump reshapes his defense team.",
      "url": "https://www.devdiscourse.com/article/politics/3203930-trump-picks-feinberg-and-colby-for-key-defense-roles",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/11_03_2020_13_22_31_2034832.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T22:43:26Z",
      "content": "In a significant move, President-elect Donald Trump has announced his picks for two crucial defense positions. Billionaire investor Stephen Feinberg is set to become the deputy secretary of defense. Feinberg, who is the co-chief executive of Cerberus... [803 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo Finance"
      },
      "author": "Yahoo Finance",
      "title": "Trump taps pro-bitcoin Stephen Miran for key economic role",
      "description": "Miran, a pro-bitcoin advocate, will advise Trump on a range of important economic policies.",
      "url": "https://finance.yahoo.com/news/trump-taps-pro-bitcoin-stephen-223641100.html",
      "urlToImage": "https://media.zenfs.com/en/thestreet_881/b16df033e8928608a11a0dbbd83d4d80",
      "publishedAt": "2024-12-22T22:36:41Z",
      "content": "U.S. president-elect Donald Trump has named pro-bitcoin advocate Stephen Miran as chairman of the Council of Economic Advisors, an agency which advises Trump on domestic and international economic policy.\nMiran’s appointment suggests that the second ... [1766 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo Canada Finance"
      },
      "author": "Yahoo Canada Finance",
      "title": "Amazon and Starbucks workers are on strike. Trump might have something to do with it",
      "description": "Amazon delivery drivers and Starbucks baristas are on strike in a handful of U.S. cities as they seek to exert pressure on the two major companies to recognize them as unionized employees or to meet demands for an inaugural labor contract.",
      "url": "https://ca.finance.yahoo.com/news/amazon-starbucks-workers-strike-trump-220851177.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/2ehdTRzLTfTwAKLcocBNgA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/cp_finance_889/b81dd46468da9e67c499435a01b4791e",
      "publishedAt": "2024-12-22T22:08:51Z",
      "content": "Amazon delivery drivers and Starbucks baristas are on strike in a handful of U.S. cities as they seek to exert pressure on the two major companies to recognize them as unionized employees or to meet demands for an inaugural labor contract.\nThe strike... [2489 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Irish Times"
      },
      "author": "The Irish Times",
      "title": "Trump threatens to retake control of Panama Canal unless deal reached",
      "description": "The comments prompted a strong rebuke from president Jose Raul Mulino who said: ‘Every square meter of the Panama canal and the surrounding area belongs to Panama and will continue belonging so’",
      "url": "https://www.irishtimes.com/world/us/2024/12/22/trump-threatens-to-retake-control-of-panama-canal-unless-deal-reached/",
      "urlToImage": "https://www.irishtimes.com/resizer/v2/X63UY56DIRMUEKURHCMZITIFCY.jpg?smart=true&auth=e317897973337fbeb2e7e2d4753023da4d8795374c121bd28519313f91a2540a&width=1200&height=630",
      "publishedAt": "2024-12-22T21:37:00Z",
      "content": "China does not control or administer the Panama Canal, but a subsidiary of Hong Kong-based CK Hutchison Holdings has long managed two ports located on the Caribbean and Pacific entrances to the canal. Photograph: Nathalia Angarita/New York Times\nUS p... [5229 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "ThePrint"
      },
      "author": "ThePrint",
      "title": "Trump threatens to retake control of Panama Canal citing unfair fees, draws rebuke from Panamian prez",
      "description": "Speaking to a crowd of supporters in Arizona Sunday, Trump also said he would not let the canal fall into the 'wrong hands,' warning of potential Chinese influence on the passage.",
      "url": "https://theprint.in/world/trump-threatens-to-retake-control-of-panama-canal/2415677/",
      "urlToImage": "https://static.theprint.in/wp-content/uploads/2024/12/manufacturing-industry-1.png",
      "publishedAt": "2024-12-22T21:15:04Z",
      "content": "China does not control or administer the canal, but a subsidiary of Hong Kong-based CK Hutchison Holdings has long managed two ports located on the Caribbean and Pacific entrances to the canal.\nSpeaking to a crowd of supporters in Arizona on Sunday, ... [3916 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "6 key lines from Trump’s Sunday speech to conservative activists in Phoenix",
      "description": "President-elect Donald Trump on Sunday, in his first rally-like speech since the November election, threatened to retake control of the Panama Canal, pushed back on criticism of Elon Musk’s influence, and suggested he could soon meet with Russian President Vladimir Putin.",
      "url": "https://edition.cnn.com/2024/12/22/politics/trump-turning-point-rally-key-lines/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap24357638944869.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-12-22T21:08:48Z",
      "content": "CNN —\nPresident-elect Donald Trump on Sunday, in his first rally-like speech since the November election, threatened to retake control of the Panama Canal, pushed back on criticism of Elon Musk’s influence, and suggested he could soon meet with Russi... [8119 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CP24 Toronto"
      },
      "author": "CP24 Toronto",
      "title": "Trump threatens to try take back the Panama Canal. The US relinquished control years ago",
      "description": "Donald Trump suggested Sunday that his new administration could try to regain control of the Panama Canal that the United States “foolishly” ceded to its Central American ally, contending that shippers are charged “ridiculous” fees to pass through the vital transportation channel linking the Atlantic and Pacific Oceans.",
      "url": "https://www.cp24.com/news/world/2024/12/22/trump-threatens-to-try-take-back-the-panama-canal-the-us-relinquished-control-years-ago/",
      "urlToImage": "https://www.cp24.com/resizer/v2/OJJZIDJOICGH3IST2XZBMQI3MM.jpg?smart=true&auth=548ece8dfe1d068a73759058942572cf67ed9165ffb283ceb6bb54cc6f051187&width=1200&height=630",
      "publishedAt": "2024-12-22T20:57:44Z",
      "content": "PHOENIX (AP) — Donald Trump suggested Sunday that his new administration could try to regain control of the Panama Canal that the United States “foolishly” ceded to its Central American ally, contending that shippers are charged “ridiculous” fees to ... [4833 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "TechCrunch"
      },
      "author": "TechCrunch",
      "title": "Trump says he wants to keep TikTok around ‘for a little while’",
      "description": "With a US TikTok ban scheduled to take effect in less than a month, President-elect Donald Trump said Sunday that he’d like to keep the app around,",
      "url": "https://techcrunch.com/2024/12/22/trump-says-he-wants-to-keep-tiktok-around-for-a-little-while/",
      "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-2182948673-tiktok.jpg?resize=1200,800",
      "publishedAt": "2024-12-22T20:42:38Z",
      "content": "In Brief\nWith a US TikTok ban scheduled to take effect in less than a month, President-elect Donald Trump said Sunday that he’d like to keep the app around, according to Reuters.\n“We’re going to have to start thinking because, you know, we did go on ... [753 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "FreightWaves"
      },
      "author": "FreightWaves",
      "title": "Why the Panama Canal is so important to Trump",
      "description": "The Panama Canal, a marvel of engineering and a critical artery of global trade, has once again become the center of geopolitical tension.",
      "url": "https://www.freightwaves.com/news/why-the-panama-canal-is-so-important-to-trump",
      "urlToImage": "https://www.freightwaves.com/uploads/2023/10/04/shutterstock_1667042089-1.jpg",
      "publishedAt": "2024-12-22T20:39:33Z",
      "content": "The Panama Canal, a marvel of engineering and a critical artery of global trade, has once again become the center of geopolitical tension. President-elect Donald Trump has threatened to demand the canal’s return to U.S. control, citing concerns over ... [722 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Daily News"
      },
      "author": "New York Daily News",
      "title": "NY colleges urge foreign students return to campus before Trump inauguration",
      "description": "Due to concerns over the incoming administration, several universities have urged students not to wait until the first days of spring semester classes to travel back to the U.S.",
      "url": "https://www.nydailynews.com/2024/12/22/ny-colleges-urge-foreign-students-return-campus-before-trump-inauguration/",
      "urlToImage": "https://www.nydailynews.com/wp-content/uploads/2024/12/AP24052512024643copy.jpg?w=1024&h=683",
      "publishedAt": "2024-12-22T20:36:31Z",
      "content": "With the risk of a travel ban on the horizon, New York colleges and universities are urging international students to cut short their winter breaks and return to campus before President-elect Donald Trump takes office.\nCornell University, The New Sch... [4181 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Panama Canal Controversy and Rising Influence",
      "description": "Donald Trump hinted at reclaiming the Panama Canal, critiquing current tariffs on shippers. Addressing a conservative rally, he pledged economic revitalization and a cohesive Republican Party. Despite internal GOP budget conflicts, Trump's focus remained on enforcing U.S. interests and fortifying conservative unity.",
      "url": "https://www.devdiscourse.com/article/politics/3203917-trumps-panama-canal-controversy-and-rising-influence",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_12_2024_22_41_55_8456816.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T20:30:41Z",
      "content": "In a surprising move, Donald Trump has suggested that his administration may attempt to reclaim control of the Panama Canal, citing exorbitant shipping fees incurred since the U.S. relinquished control in 1999. His remarks were part of a wider speech... [730 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Panama Stands Firm on Canal Sovereignty Amid U.S. Threats",
      "description": "Panamanian President Jose Raul Mulino has emphatically declared Panama's sovereignty over the Panama Canal amid threats from U.S. President-elect Donald Trump to reclaim control. Mulino's recorded statement, shared on platform X, emphasized that the independence and sovereignty of Panama are non-negotiable.",
      "url": "https://www.devdiscourse.com/article/politics/3203916-panama-stands-firm-on-canal-sovereignty-amid-us-threats",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/27_05_2019_12_10_51_4304562.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T20:28:48Z",
      "content": "Panamanian President Jose Raul Mulino has strongly reaffirmed the country's control over the Panama Canal following remarks from U.S. President-elect Donald Trump suggesting a potential reclamation of the canal by the United States.\nIn a statement re... [411 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "Trump threatens to try to take back the Panama Canal",
      "description": "“We’re being ripped off at the Panama Canal,” the Republican president-elect said, bemoaning that his country ”foolishly gave it away.”",
      "url": "https://www.thestar.com/news/world/united-states/trump-threatens-to-try-to-take-back-the-panama-canal-the-us-relinquished-control-years/article_1b8fcb38-0e8e-5615-b24a-f39867966fef.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/4/75/47523272-9d13-5fbc-bad3-5ca18dcb6837/676876c8769ad.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2024-12-22T20:25:00Z",
      "content": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's So... [4996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "Donald Trump threatens to try to take back the Panama Canal",
      "description": "Panama’s conservative president José Raúl Mulino roundly rejected that notion as an affront to his country’s sovereignty.",
      "url": "https://www.thestar.com/news/world/united-states/trump-threatens-to-try-to-take-back-the-panama-canal-panamas-president-balks-at-the/article_1b8fcb38-0e8e-5615-b24a-f39867966fef.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/4/75/47523272-9d13-5fbc-bad3-5ca18dcb6837/676876c8769ad.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2024-12-22T20:25:00Z",
      "content": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's So... [4996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Deadline"
      },
      "author": "Deadline",
      "title": "Polio Survivor Francis Coppola Urges Caution Vaccine Skeptics Trump",
      "description": "Polio Survivor Francis Coppola Urges Caution As Vax Skeptics Take Posts In Trump Administration",
      "url": "https://deadline.com/2024/12/polio-survivor-francis-coppola-urges-caution-vax-skeptics-robert-f-kennedy-jr-take-trump-administration-posts-1236240477/",
      "urlToImage": "https://deadline.com/wp-content/uploads/2024/12/Francis-Ford-Coppola-2178515435.jpg?w=1024",
      "publishedAt": "2024-12-22T20:11:18Z",
      "content": "EXCLUSIVE: The 85-year old five-time Oscar winning director Francis Ford Coppola is spending the days before Christmas wrapping not presents, but the international rollout of Megalopolis. This week, he’s doing interviews as the film opens in South Am... [8608 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Globe and Mail"
      },
      "author": "The Globe and Mail",
      "title": "Trump says it could be worth keeping TikTok in U.S. for a little while",
      "description": "Trump’s comments before a crowd of conservative supporters in Phoenix, Arizona, were one of the strongest signals yet that he opposes a potential exit of TikTok from the U.S. market",
      "url": "https://www.theglobeandmail.com/business/article-trump-says-it-could-be-worth-keeping-tiktok-in-us-for-a-little-while/",
      "urlToImage": "https://www.theglobeandmail.com/resizer/v2/PWNG3HARMFB3XETITZMFFFQLX4.JPG?auth=72c66b3fe4549b07b9f7dbd618b38cb4917b5ddcb84eda4e56d8a0b6fe9a50de&width=1200&height=800&quality=80&smart=true",
      "publishedAt": "2024-12-22T19:58:22Z",
      "content": "Open this photo in gallery: U.S. President-elect Donald Trump during a news conference at Mar-A-Lago, in Palm Beach, Fla., on Dec. 16.MADDIE MCGARVEY/The New York Times News Service\nU.S. President-elect Donald Trump indicated on Sunday that he favour... [2027 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Bold Plan: Anti-Drug Campaign and New Designation for Cartels",
      "description": "Donald Trump plans an anti-drug campaign revealing drugs' physical effects, akin to the 1980s 'Just Say No' effort, and intends to designate Mexican cartels as terrorist organizations. He proposes spending major funds on this initiative while reviving a previously shelved plan to target cartel operations with military strategies.",
      "url": "https://www.devdiscourse.com/article/politics/3203911-trumps-bold-plan-anti-drug-campaign-and-new-designation-for-cartels",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_12_2024_22_41_55_8456816.jpg?width=920&format=jpeg",
      "publishedAt": "2024-12-22T19:43:04Z",
      "content": "Donald Trump, the U.S. President-elect, announced a new advertising campaign aimed at highlighting the detrimental physical impacts of drug use, specifically targeting substances like fentanyl. He equated the initiative to a political campaign, promi... [743 chars]"
    }
  ]
}