{
  "status": "ok",
  "totalResults": 136,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Trump co-defendant accuses Georgia prosecutors of lying about when relationship began",
      "description": "One of former President Donald Trump’s co-defendants in the Georgia election racketeering case has alleged that Fulton County District Attorney Fani Willis and her top deputy on the case aren’t being truthful about the details of their relationship.",
      "url": "https://edition.cnn.com/2024/02/09/politics/willis-wade-fulton-county/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap24026605541847.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-02-09T23:45:15Z",
      "content": "CNN —\nOne of former President Donald Trump’s co-defendants in the Georgia election racketeering case has alleged that Fulton County District Attorney Fani Willis and her top deputy on the case aren’t being truthful about the details of their relation... [2382 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Globe and Mail"
      },
      "author": "The Globe and Mail",
      "title": "Joe Biden’s stumbles provide damaging fodder for Trump campaign",
      "description": "A special counsel’s assertion this week that Joe Biden was an ‘elderly man with a poor memory’ has elevated an undercurrent of the American presidential campaign into an unavoidable issue with vast implications",
      "url": "https://www.theglobeandmail.com/world/us-politics/article-joe-bidens-stumbles-provide-damaging-fodder-for-trump-campaign/",
      "urlToImage": "https://www.theglobeandmail.com/resizer/v2/B3ZBBYOIPZDF3GB7KBUTIUHCII.jpg?auth=8f0c3e536a1ac02e58b0cff21dfac3e076c64aa00fe616ed0af626b16d8ac343&width=1200&height=800&quality=80",
      "publishedAt": "2024-02-09T23:31:35Z",
      "content": "Open this photo in gallery: U.S. President Joe Biden delivers remarks in the Diplomatic Reception Room of the White House on Feb. 8, in Washington, DC.Nathan Howard/Getty Images\nDevastating, discreditable, demeaning and not easily dismissed, a specia... [6879 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo News"
      },
      "author": "Yahoo News",
      "title": "Trump legal news brief: Citing witness death threats, Jack Smith asks Judge Cannon to reconsider ‘clear error’ in ruling",
      "description": "Government prosecutors on special counsel Jack Smith’s team file papers asking Judge Aileen Cannon to reconsider her “clear error” in granting a request from lawyers for former President Donald Trump to reveal the identity of certain witnesses in the classified documents case.",
      "url": "https://news.yahoo.com/trump-legal-news-brief-citing-witness-death-threats-jack-smith-asks-judge-cannon-to-reconsider-clear-error-in-ruling-174712462.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/GUuqoOSKqlPEkJoWuxRWJQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-02/f3ae9c50-c772-11ee-bdba-20a553fcee0d",
      "publishedAt": "2024-02-09T22:18:49Z",
      "content": "Government prosecutors on special counsel Jack Smith’s team file papers asking Judge Aileen Cannon to reconsider her “clear error” in granting a request from lawyers for former President Donald Trump to reveal the identity of certain witnesses in the... [14985 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Special counsel details threats against witnesses in Mar-a-Lago case in effort to protect their identities",
      "description": "In a fight over keeping the identity of witnesses protected in the criminal document mishandling case against Donald Trump, special counsel Jack Smith this week detailed myriad threats against prosecutors, judges and other witnesses.",
      "url": "https://edition.cnn.com/2024/02/09/politics/mar-a-lago-trump-witness-threats/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/3bd6d0ef-5593-42a0-b4e0-b00eb6499598.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2024-02-09T21:48:30Z",
      "content": "CNN —\nIn a fight over keeping the identity of witnesses protected in the criminal document mishandling case against Donald Trump, special counsel Jack Smith this week detailed myriad threats against prosecutors, judges and other witnesses.\nOne threat... [4838 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Trump backs Sheehy in Montana Senate race",
      "description": "Former President Trump on Friday endorsed businessman Tim Sheehy in Montana’s closely watched Senate race, just hours after Montana Republican Rep. Matt Rosendale filed to join the primary.  Trump called Sheehy an “American Hero” and noted his support from the GOP Senate campaign arm and its chair, Montana Sen. Steve Daines — but he stopped…",
      "url": "https://thehill.com/homenews/campaign/4459023-trump-backs-sheehy-montana-senate-race/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/01/trumpdonald_011123_ap_fraudtrial.jpg?w=1280",
      "publishedAt": "2024-02-09T20:08:10Z",
      "content": "Former President Trump on Friday endorsed businessman Tim Sheehy in Montana’s closely watched Senate race, just hours after Montana Republican Rep. Matt Rosendale filed to join the primary.\nTrump called Sheehy an “American Hero” and noted his support... [1714 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Special counsel warns of 'significant and immediate' threat to Mar-a-Lago witnesses",
      "description": "The special counsel prosecuting Donald Trump in the Mar-a-Lago classified documents case warned an order could threaten witness safety.",
      "url": "https://www.nbcnews.com/politics/donald-trump/special-counsel-warns-significant-immediate-threat-mar-lago-witnesses-rcna138140",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-07/230728-mar-a-lago-ew-1117a-1a8a56.jpg",
      "publishedAt": "2024-02-09T20:02:33Z",
      "content": "WASHINGTON — The special counsel prosecuting Donald Trump has asked the judge in the Mar-a-Lago classified documents case to reconsider an order the government argues could identify more than two dozen witnesses and threaten their safety and testimon... [3767 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "'Civil War' After Donald Trump Win May Be 'Worth It': Evangelical Preacher",
      "description": "\"Would it be worth it? To turn this nation back? I believe it would,\" Evangelical preacher Andrew Wommack said of a civil war.",
      "url": "https://www.newsweek.com/civil-war-donald-trump-worth-it-andrew-wommack-1868670",
      "urlToImage": "https://d.newsweek.com/en/full/2347260/trump-civil-war-evangelical.jpg",
      "publishedAt": "2024-02-09T19:55:41Z",
      "content": "Evangelical preacher Andrew Wommack said that a \"civil war\" would be \"worth it\" if it meant getting former President Donald Trump back into the White House.\n\"I've actually had people say that if Trump was to be elected if we got a conservative Congre... [2652 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "‘Two men three years apart’: Democrats highlight Trump’s mental lapses after Biden report",
      "description": "Trump faces less scrutiny over his age than his contemporary does. Biden’s challenge is to change that",
      "url": "https://www.theguardian.com/us-news/2024/feb/09/trump-memory-age-analysis-biden",
      "urlToImage": "https://i.guim.co.uk/img/media/b7eefbda429e4cfc08dd0f3a90b20a9f38506f6c/814_398_2656_1594/master/2656.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0a3cb2ddd327e536c59acb13d2b69344",
      "publishedAt": "2024-02-09T19:45:40Z",
      "content": "The special counsel Robert Hur’s contention that Joe Biden suffers from memory problems caused by advanced age prompted delight among the president’s Republican opponents – and pushback from Democrats pointing out how often Donald Trump has his own l... [5106 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Axelrod criticizes Biden for going after CNN reporter",
      "description": "Former White House aide and CNN contributor David Axelrod on Friday criticized President Biden for snapping at a reporter for the network who earlier asked about concerns regarding his memory and age. “Donald Trump is a gaffe-machine himself, but because he is energetic these questions are not as profound for him,” Axelrod said Friday. More…",
      "url": "https://thehill.com/homenews/media/4458835-axelrod-criticizes-biden-for-going-after-cnn-reporter/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/02/bidenjoe_diplomatic_020824_ap.jpg?w=1280",
      "publishedAt": "2024-02-09T19:00:23Z",
      "content": "Former White House aide and CNN contributor David Axelrod on Friday criticized President Biden for snapping at a reporter for the network who earlier asked about concerns regarding his memory and age.\n“Donald Trump is a gaffe-machine himself, but bec... [1445 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "Anheuser-Busch stock climbs after Trump endorses Bud Light. ‘Not a Woke company’",
      "description": "ST. LOUIS — Anheuser-Busch InBev stock prices are inching closer to what they were last year before sales tanked, thanks at least in part to a recent endorsement by former President Donald Trump. Trump praised the company on social media on Tuesday, helping push Anheuser-Busch stock prices up about ...",
      "url": "https://www.rawstory.com/anheuser-busch-stock-climbs-after-trump-endorses-bud-light-not-a-woke-company/",
      "urlToImage": "https://www.rawstory.com/media-library/image.jpg?id=51434156&width=980",
      "publishedAt": "2024-02-09T18:55:34Z",
      "content": "Kimberly Gotti, 55, and daughter Gianna, 25, both face criminal charges after a fight reportedly sparked by a woman's request they stop cursing at students from the bleachers at Locust Valley High School in Long Island, according to the report.\n“I as... [850 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "WLTX.com"
      },
      "author": "WLTX.com",
      "title": "Donald Trump, Nikki Haley now focused on South Carolina primary",
      "description": "The Republican presidential contest is shifting to a critical two-week phase ahead of the South Carolina primary between Nikki Haley and Donald Trump.",
      "url": "https://www.wltx.com/article/news/politics/nikki-haley-donald-trump-south-carolina-primary/101-c8179e1e-ecde-400d-8197-43c96da9d1d7",
      "urlToImage": "https://media.wltx.com/assets/WLTX/images/ef7abe6e-bd2e-44af-ba1e-88be890a4ca4/ef7abe6e-bd2e-44af-ba1e-88be890a4ca4_1140x641.jpg",
      "publishedAt": "2024-02-09T18:44:31Z",
      "content": "Donald Trump and Nikki Haley will hold dueling campaign events this weekend.\nCOLUMBIA, S.C. — The Republican presidential contest is shifting to a critical two-week phase ahead of the South Carolina primary, which may prove to be the last chance for ... [3251 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Expect big changes for small business under a second Trump presidency",
      "description": ". If you're running a small business, it’s probably time to start thinking how a newly elected President Trump will affect your livelihood. Because he definitely will – in both good ways and bad.",
      "url": "https://thehill.com/opinion/finance/4458737-expect-big-changes-for-small-business-under-a-second-trump-presidency/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/02/Trump-World-TrumpNevada_020324_AP_John-Locher.jpg?w=1280",
      "publishedAt": "2024-02-09T18:30:00Z",
      "content": "There are many who predict that Donald Trump may indeed be our next president. It’s too early to tell, but it’s not too early to prepare. If you’re running a small business, it’s probably time to start thinking how a newly elected President Trump wil... [5370 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Livemint"
      },
      "author": "Livemint",
      "title": "'Every single Biden attack on gun owners will be terminated', says Trump ahead of US Presidential polls",
      "description": "Former President Donald Trump, the frontrunner for the 2024 presidential race, pledged to reverse all gun restrictions enacted by President Joe Biden if re-elected.",
      "url": "https://www.livemint.com/news/world/every-single-joe-biden-attack-on-gun-owners-will-be-terminated-says-donald-trump-ahead-of-us-presidential-polls-11707528671742.html",
      "urlToImage": "https://www.livemint.com/lm-img/img/2024/02/10/1600x900/Donald_Trump_1707529680320_1707529680600.jpg",
      "publishedAt": "2024-02-09T18:30:00Z",
      "content": "Former President Donald Trump, the Republican frontrunner in the 2024 presidential race, said on Friday that if re-elected he would reverse all the gun restrictions enacted by President Joe Biden.\nSpeaking to thousands of supporters at an event organ... [1987 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Raw Story"
      },
      "author": "Raw Story",
      "title": "Endurance test looms for Biden, Trump in longest campaign",
      "description": "Joe Biden and Donald Trump face one of the longest presidential campaigns in US history, raising questions about the endurance of the oldest ever pair of nominees -- and of weary voters.Concerns about whether two men born in the 1940s are ready for a lengthy duel in 2024 were thrust back in the spot...",
      "url": "https://www.rawstory.com/endurance-test-looms-for-biden-trump-in-longest-campaign/",
      "urlToImage": "https://www.rawstory.com/media-library/president-joe-biden-and-donald-trump.jpg?id=51433375&width=1200&height=600&coordinates=0%2C0%2C0%2C113",
      "publishedAt": "2024-02-09T18:22:28Z",
      "content": "The fear that led Colorado to ban Trump from the ballot was that he’d keep his word and “suspend the Constitution” and “be a dictator on day one.” Neither were mentioned even once: the words “suspend” and “dictator” don’t appear anywhere in the trans... [5970 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Kamala Harris' Chances of Beating Donald Trump",
      "description": "Recent polling does not look good for Kamala Harris amid voter concerns over Joe Biden's age.",
      "url": "https://www.newsweek.com/kamala-harris-matchup-against-donald-trump-1868650",
      "urlToImage": "https://d.newsweek.com/en/full/2347185/kamala-harris.jpg",
      "publishedAt": "2024-02-09T18:22:22Z",
      "content": "Kamala Harris would likely face an uphill battle to convince voters in a hypothetical matchup against Donald Trump.\nQuestions from voters around President Joe Biden's age have increased pressure on the White House incumbent, who responded angrily to ... [5831 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "More voters say Trump presidency 'better than expected' compared to Biden: poll",
      "description": "Nearly three times as many registered US voters say former President Donald Trump’s term was “better than expected,” compared with those who said the same about President Biden’s term in the Oval Office, a new poll shows.",
      "url": "https://nypost.com/2024/02/09/news/hindsight-is-2020-as-more-voters-say-trump-presidency-better-than-expected-compared-to-biden-poll/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/02/republican-presidential-candidate-former-us-76205802.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-02-09T17:39:49Z",
      "content": "Hindsight really is 2020.\nA plurality of US voters say former President Donald Trump’s four years in office were “better than expected” while fewer than one in seven say the same of President Biden’s tenure, a new poll shows.\nAn NBC News national sur... [3936 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CNBC"
      },
      "author": "CNBC",
      "title": "Former Maryland Gov. Larry Hogan announces U.S. Senate run",
      "description": "The anti-Trump Republican is entering the race in the traditionally Democratic state to replace retiring Sen. Ben Cardin.",
      "url": "https://www.cnbc.com/2024/02/09/former-maryland-gov-larry-hogan-announces-us-senate-run.html",
      "urlToImage": "https://image.cnbcfm.com/api/v1/image/107371645-1707499425665-gettyimages-1442660764-030a3952_638da718-fe3e-4343-90cc-5e0349668321.jpeg?v=1707499491&w=1920&h=1080",
      "publishedAt": "2024-02-09T17:28:03Z",
      "content": "Former Maryland Gov. Larry Hogan, who left office as one of the few prominent Republican critics of former President Donald Trump, will run for U.S. Senate in his home state.\nHogan announced his plans in a video posted to social media Friday, hours b... [3764 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "PetaPixel"
      },
      "author": "PetaPixel",
      "title": "Midjourney Could Ban Trump, Biden Images for the Next Year",
      "description": "The CEO of Midjourney said the AI image generator is close to banning images of two politicians leading up to the election.",
      "url": "https://petapixel.com/2024/02/09/midjourney-close-to-banning-trump-biden-images-for-the-next-year/",
      "urlToImage": "https://petapixel.com/assets/uploads/2024/02/midjourney-trump-biden-image-ban.jpg",
      "publishedAt": "2024-02-09T17:15:07Z",
      "content": "In the wake of an already contentious election season, Midjourney might ban images of President Joe Biden and former president Donald Trump.\nDavid Holz, the CEO of AI image generator company Midjourney, said it is “close to [banning]” such images “fo... [2096 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "NYC home that appeared in 'Uncut Gems' lists for $14.99M",
      "description": "This Trump World Tower home, at 845 UN Plaza, comes with coffered ceilings and a fireplace -- but sadly not with Adam Sandler or Julia Fox as roommates.",
      "url": "https://nypost.com/2024/02/09/real-estate/nyc-home-that-appeared-in-uncut-gems-lists-for-14-99m/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/02/995m-famous-movies-like-uncut-76205649.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2024-02-09T17:12:06Z",
      "content": "This stylish New York City listing sure is a piece of “reel” estate.\nIf this condo unit at Trump World Tower, at 845 United Nations Plaza in Turtle Bay, looks familiar, it might be because it has served as a location in films, like “Uncut Gems” starr... [1437 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Former Maryland Gov. Larry Hogan announces U.S. Senate run",
      "description": "Former Maryland Gov. Larry Hogan, who left office as one of the few prominent Republican critics of former President Donald Trump, will run for U.S.",
      "url": "https://www.nbcnews.com/politics/2024-election/former-maryland-gov-larry-hogan-announces-us-senate-run-rcna138108",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-02/240209-larry-hogan-ew-1140a-4798e1.jpg",
      "publishedAt": "2024-02-09T17:03:16Z",
      "content": "Former Maryland Gov. Larry Hogan, who left office as one of the few prominent Republican critics of former President Donald Trump, will run for U.S. Senate in his home state.\nHogan announced his plans in a video posted to social media Friday, hours b... [3992 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "WLTX.com"
      },
      "author": "WLTX.com",
      "title": "Tax Cuts and Jobs Act doesn’t have built-in tax increases",
      "description": "The Tax Cuts and Jobs Act of 2017, a tax reform law signed by Trump, does not include yearly income-based tax increases like viral social media posts suggest.",
      "url": "https://www.wltx.com/article/news/verify/taxes-verify/tax-cuts-and-jobs-act-of-2017-does-not-have-built-in-tax-increases-for-2023-taxes/536-43ba4a51-bcde-46c9-8d51-25f9819462dc",
      "urlToImage": "https://media.wltx.com/assets/VERIFY/images/d5e3b4f7-6a9b-4722-91b0-fa88f3f22cdc/d5e3b4f7-6a9b-4722-91b0-fa88f3f22cdc_1140x641.jpg",
      "publishedAt": "2024-02-09T17:01:37Z",
      "content": "Viral social media posts falsely claim yearly income-based tax increases are built into a 2017 tax reform law. Here’s what the law actually means for taxpayers.\nSeveral social media posts that went viral on TikTok and X in January claimed the Tax Cut... [4128 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "talkSPORT.com"
      },
      "author": "talkSPORT.com",
      "title": "'Nasty looking guy' - Donald Trump shouts out UFC star Sean Strickland during speech after funny staredown",
      "description": "Donald Trump appears to have a new favourite UFC fighter.Welterweight rivals Jorge Masvidal and Colby Covington have been vying for affection from the",
      "url": "https://talksport.com/sport/1744009/sean-strickland-ufc-staredown-donald-trump/",
      "urlToImage": "https://talksport.com/wp-content/uploads/sites/5/2024/02/Copy-of-Untitled-Design-49.png?strip=all&quality=100&w=1500&h=1000&crop=1",
      "publishedAt": "2024-02-09T16:48:51Z",
      "content": "Donald Trump appears to have a new favourite UFC fighter.\nWelterweight rivals Jorge Masvidal and Colby Covington have been vying for affection from the former US president for several years.\n3 Trump frequently attends UFC events Credit: AFP\nHowever, ... [2137 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Hill"
      },
      "author": "The Hill",
      "title": "Special counsel fights judge’s order allowing Trump to reveal witness identities in Mar-a-Lago case",
      "description": "Special counsel Jack Smith is asking Judge Aileen Cannon to reconsider a ruling that would allow former President Trump’s legal team to publicly disclose witness identities and their testimony to the court docket. Trump’s lawyers have sought to attach evidence given to them during the discovery process in other court filings set to be publicly…",
      "url": "https://thehill.com/regulation/court-battles/4458476-special-counsel-fights-judges-order-allowing-trump-to-reveal-witness-identities-in-mar-a-lago-case/",
      "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/12/Courts-Jack-Smith_082823_AP_J.-Scott-Applewhite.jpg?w=1280",
      "publishedAt": "2024-02-09T16:45:29Z",
      "content": "Special counsel Jack Smith is asking Judge Aileen Cannon to reconsider a ruling that would allow former President Trump’s legal team to publicly disclose witness identities and their testimony to the court docket.\nTrump’s lawyers have sought to attac... [2259 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Donald Trump Just Had the Best 24 Hours in His Tumultuous Legal History",
      "description": "Thursday was \"a great, wonderful, fabulous day\" for Trump, strategists told Newsweek, with three pieces of good news for the former president.",
      "url": "https://www.newsweek.com/donald-trump-best-24-hours-legal-history-1868576",
      "urlToImage": "https://d.newsweek.com/en/full/2347097/trump-best-24-hours.jpg",
      "publishedAt": "2024-02-09T16:30:26Z",
      "content": "Thursday couldn't have gone any better for former President Donald Trump, experts told Newsweek.\nAn ethics complaint was filed against one of Trump's biggest enemies, the justices on the Supreme Court signaled they would rule in the former president'... [7764 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The New York Times"
      },
      "author": "The New York Times",
      "title": "Prosecutors Seek to Protect Witnesses in Trump Classified Documents Case",
      "description": "The move to shield the identities of several witnesses suggested a mounting sense of frustration with Judge Aileen M. Cannon, who is overseeing the case.",
      "url": "https://www.nytimes.com/2024/02/09/us/politics/witnesses-trump-classified-documents-case.html",
      "urlToImage": "https://static01.nyt.com/images/2024/02/09/multimedia/09dc-trump-documents-01-hmbz/09dc-trump-documents-01-hmbz-facebookJumbo.jpg",
      "publishedAt": "2024-02-09T16:12:37Z",
      "content": "Prosecutors have asked a federal judge to protect the identities of several witnesses involved in the criminal case accusing former President Donald J. Trump of illegally retaining classified documents, saying that if their names were revealed before... [889 chars]"
    }
  ]
}