{
  "status": "ok",
  "totalResults": 501,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Firstpost"
      },
      "author": "Firstpost",
      "title": "Trump signs memorandum directing CFIUS to restrict Chinese investments in US",
      "description": "CFIUS, which scrutinizes foreign investment in the United States for national security risks, has already overseen a sharp decrease in Chinese investment in the United States",
      "url": "https://www.firstpost.com/world/trump-signs-memorandum-directing-cfius-to-restrict-chinese-investments-in-us-13865557.html",
      "urlToImage": "https://images.firstpost.com/uploads/2025/02/Trump-2025-02-0f1d6fe778040220974018d4525cff1d-1200x675.jpg?im=FitAndFill=(1200,675)",
      "publishedAt": "2025-02-21T23:59:43Z",
      "content": "CFIUS, which scrutinizes foreign investment in the United States for national security risks, has already overseen a sharp decrease in Chinese investment in the United States read more\nPresident Donald Trump signed a memorandum on Friday directing th... [2539 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Hunter Schafer says passport now lists her gender as male after Trump order",
      "description": "Model and actress Hunter Schafer said her new passport lists her gender as male despite selecting female while filling out paperwork.",
      "url": "https://www.cbsnews.com/news/hunter-schafer-passport-gender-trump/",
      "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/02/21/f4ae8b58-0b15-4ce0-a516-ae9eacdb1c44/thumbnail/1200x630/08cf44581ab69984dba390b89de4e567/gettyimages-2153418122.jpg?v=db3d87ba7bf4d4ff13b65eabcf0d9bea",
      "publishedAt": "2025-02-21T23:59:15Z",
      "content": "Model and actress Hunter Schafer, one of the most prominent transgender women in Hollywood, said Friday that her newly issued passport lists her gender as male despite selecting female while filling out paperwork.\nSchafer, best known for her role in ... [1657 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Sweeping Job Cuts: Trump's Federal Workforce Reduction Sparks Controversy",
      "description": "President Trump's initiative to reduce the federal workforce has led to the Pentagon announcing 5,400 job cuts. Legal challenges and public backlash persist, with criticism over the impact on government services. Amid this, prominent figures like Elon Musk are playing significant roles in reshaping federal employment landscapes.",
      "url": "https://www.devdiscourse.com/article/law-order/3273785-sweeping-job-cuts-trumps-federal-workforce-reduction-sparks-controversy",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/10_06_2024_16_34_38_220246.png?width=920&format=jpeg",
      "publishedAt": "2025-02-21T23:57:25Z",
      "content": "The Pentagon has announced plans to slash 5,400 jobs as part of President Donald Trump's directive to reduce the federal workforce. This announcement comes amid public outcry and legal challenges that have been met with mixed success in courtrooms.\nT... [708 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Sports Betting Surge Sparks Concerns Over Addiction Rise",
      "description": "Highlights include a surge in U.S. sports betting hinting at rising gambling addictions, TaylorMade's endorsement of Kai Trump, Andrey Rublev's advance to Qatar Open final, and Boone Jenner's return to NHL. Updates on MLS valuations, a Yankees policy shift, and Dodgers' Bobby Miller's recovery are also reported.",
      "url": "https://www.devdiscourse.com/article/sports-games/3273784-sports-betting-surge-sparks-concerns-over-addiction-rise",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/30_05_2024_17_01_14_0800514.png?width=920&format=jpeg",
      "publishedAt": "2025-02-21T23:54:58Z",
      "content": "The surge in U.S. sports betting is raising alarms about increasing gambling addictions, the American Gaming Association revealed. A significant 23.6% rise in sports betting was reported, with Americans placing $147.9 billion in bets in 2024.\nIn golf... [452 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Global Tensions and Developments: From Amazon Sinkholes to Geopolitical Shifts",
      "description": "This compilation of world news covers various developments: dangerous sinkholes in Brazil's Amazon, protests in Slovakia, U.S.-Ukraine minerals deal developments, a freed Congo opposition leader, a conviction related to Salman Rushdie's attack, AP's legal action against Trump aides, a Berlin stabbing incident, and UN actions concerning Ukraine.",
      "url": "https://www.devdiscourse.com/article/law-order/3273783-global-tensions-and-developments-from-amazon-sinkholes-to-geopolitical-shifts",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/24_07_2024_05_00_43_2881022.png?width=920&format=jpeg",
      "publishedAt": "2025-02-21T23:54:40Z",
      "content": "In the Brazilian Amazon, the city of Buriticupu faces a natural crisis with large sinkholes threatening to engulf homes, affecting 1,200 residents. The municipal government has declared a state of emergency as they brace for the worsening situation.\n... [569 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "WEAU"
      },
      "author": "WEAU",
      "title": "Speaking out against the Trump administration in Eau Claire",
      "description": "Protestors have been gathering across the nation over the last few weeks to speak out against the Trump administration and Friday that happened in Eau Claire.",
      "url": "https://www.weau.com/2025/02/21/speaking-out-against-trump-administration-eau-claire/",
      "urlToImage": "https://gray-weau-prod.gtv-cdn.com/resizer/v2/XUWE35EYNVEB3PKCXDXVDKARTE.png?auth=d463103c2b27c391edfe66bb3ceb056b5ef31a79ef94cef769a0906d83fa2576&width=1200&height=600&smart=true",
      "publishedAt": "2025-02-21T23:54:11Z",
      "content": "EAU CLAIRE, Wis. (WEAU) - Protestors have been gathering across the nation over the last few weeks to speak out against the Trump administration and Friday that happened in Eau Claire.\nThis afternoon on Clairemont Avenue, dozens of people gathered to... [693 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Supreme Court Delays Decision on Trump’s Attempt to Remove Watchdog Chief",
      "description": "The U.S. Supreme Court has delayed action on a request to allow former President Donald Trump to immediately dismiss Hampton Dellinger, head of the Office of Special Counsel. Appointed by President Biden, Dellinger had been temporarily protected from removal by a judge's order amidst an ongoing legal battle.",
      "url": "https://www.devdiscourse.com/article/politics/3273781-supreme-court-delays-decision-on-trumps-attempt-to-remove-watchdog-chief",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/25_07_2024_17_08_14_6144537.png?width=920&format=jpeg",
      "publishedAt": "2025-02-21T23:53:58Z",
      "content": "The U.S. Supreme Court has decided to delay its decision on whether former President Donald Trump can immediately dismiss Hampton Dellinger, the leader of a federal watchdog agency. The court's action follows a judge's order temporarily blocking Trum... [855 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Supreme Court Holds the Line on Whistleblower Protector in Legal Tug-of-War",
      "description": "The Supreme Court temporarily retained Hampton Dellinger, head of the Office of Special Counsel, amidst fierce legal battles surrounding the Trump administration's agenda. The decision highlights tensions between presidential powers and federal agency independence, underscored by recent efforts to overturn precedents protecting agency heads from arbitrary firings.",
      "url": "https://www.devdiscourse.com/article/law-order/3273779-supreme-court-holds-the-line-on-whistleblower-protector-in-legal-tug-of-war",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/14_08_2024_14_31_11_2620113.png?width=920&format=jpeg",
      "publishedAt": "2025-02-21T23:50:59Z",
      "content": "In a decisive move, the Supreme Court has temporarily held onto Hampton Dellinger, the current head of the Office of Special Counsel, as legal battles simmer over President Trump's agenda.\nWith its decision, the court refrained from immediately remov... [291 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Make the DOGE cuts permanent, Europe needs an army and other commentary",
      "description": "“To make the DOGE spending cuts stick,” Sen. Rand Paul is encouraging “Vice President J.D. Vance to have the Trump administration draw up a rescission package” for Congress to pass, and so formally withdraw “spending Congress had previously authorized,” reports Reason’s Eric Boehm.",
      "url": "https://nypost.com/2025/02/21/opinion/make-the-doge-cuts-permanent-europe-needs-an-army-and-other-commentary/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/02/2025-washington-dc-confirmed-director-96754707_e1488f-e1740167377374.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-02-21T23:50:37Z",
      "content": "Libertarian: Make the DOGE Cuts Permanent\n“To make the DOGE spending cuts stick,” Sen. Rand Paul is encouraging “Vice President J.D. Vance to have the Trump administration draw up a rescission package” for Congress to pass, and so formally withdraw “... [4191 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Judge clears Trump administration to put over 2,000 USAid workers on leave",
      "description": "Order by Trump-appointed judge setback for government employee unions who have filed lawsuit against firings",
      "url": "https://www.theguardian.com/us-news/2025/feb/21/trump-administration-usaid-workers-leave",
      "urlToImage": "https://i.guim.co.uk/img/media/7c5b9e1327f0da898cee85bd9a24a31f301095b2/0_367_5500_3300/master/5500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=28561d7c6b05df7e565b0f07c64b72f6",
      "publishedAt": "2025-02-21T23:50:21Z",
      "content": "A federal judge on Friday cleared the way for the Trump administration to put more than 2,000 US Agency for International Development (USAid) workers on leave, a setback for government employee unions that are suing over what they have called an effo... [2555 chars]"
    }
  ]
}