{
  "status": "ok",
  "totalResults": 268,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "SpaceNews"
      },
      "author": "SpaceNews",
      "title": "Trump taps former Space Force commander for senior Air Force post",
      "description": "Trump taps former Space Force commander for senior Air Force post Trump taps former Space Force commander for senior Air Force post",
      "url": "https://spacenews.com/trump-taps-former-space-force-commander-for-senior-air-force-post/",
      "urlToImage": "https://jetpack.com/redirect/?source=sigenerate&query=t%3DeyJpbWciOiJodHRwczpcL1wvc3BhY2VuZXdzLmNvbVwvd3AtY29udGVudFwvdXBsb2Fkc1wvMjAyNVwvMDFcL1NjcmVlbnNob3QtMjAyNS0wMS0xOC1hdC02LjA4LjI0JWUyJTgwJWFmUE0tMTAyNHg1NzgucG5nIiwidHh0IjoiVHJ1bXAgdGFwcyBmb3JtZXIgU3BhY2UgRm9yY2UgY29tbWFuZGVyIGZvciBzZW5pb3IgQWlyIEZvcmNlIHBvc3QiLCJ0ZW1wbGF0ZSI6ImRvaXMiLCJibG9nX2lkIjo4MDY4MTk3OX0.r2SMFwD2LodCgKscsKVZVRSNW1Np5Jppfjt5-B5PrGwMQ",
      "publishedAt": "2025-01-18T23:58:07Z",
      "content": "WASHINGTON — President-elect Donald Trump announced Jan. 17 that he will nominate former U.S. Space Force commander Matthew Lohmeier to serve as the next undersecretary of the Air Force.\nLohmeier gained national attention in 2021 after being relieved... [1681 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Global News Briefs: From Trump's Plans to International Tensions",
      "description": "This summary covers significant world events, including the German ambassador's warning about Trump's constitutional changes, international police support in Haiti, Russian attacks on Ukraine, Israel's ceasefire with Gaza, protests in South Korea, and Malaysia's ASEAN leadership. It highlights global political, security, and diplomatic developments.",
      "url": "https://www.devdiscourse.com/article/politics/3230373-global-news-briefs-from-trumps-plans-to-international-tensions",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_01_2025_10_57_22_8675565.jpg?width=920&format=jpeg",
      "publishedAt": "2025-01-18T23:54:27Z",
      "content": "Germany's ambassador to the U.S. has issued a warning about President-elect Donald Trump's intention to reshape the nation's constitutional framework, a move he says would concentrate power with the presidency. The document reveals concerns over law ... [627 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Return to Power: Bold Moves and Controversies",
      "description": "President-elect Donald Trump's administration plans aggressive immigration raids across various U.S. cities, starting with Chicago. The German ambassador warns of Trump's intent to redefine the constitutional order. Additionally, California's wildfire devastation challenges the housing market, while thousands protest against Trump's inauguration and the crypto industry celebrates his presidency.",
      "url": "https://www.devdiscourse.com/article/politics/3230372-trumps-return-to-power-bold-moves-and-controversies",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_01_2025_10_57_22_8675565.jpg?width=920&format=jpeg",
      "publishedAt": "2025-01-18T23:54:12Z",
      "content": "President-elect Donald Trump is poised to launch immigration raids targeting multiple U.S. cities as soon as he assumes office, with Chicago expected to be the first hit. These sweeps are part of a broader enforcement action aimed at addressing the s... [781 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "New Donald Trump era soon begins with big stakes for Canada",
      "description": "Our country is vulnerable to an “America First” president who has an attraction to tariffs and a conviction that the U.S. is getting a raw deal from even some of its closest and friendliest partners.",
      "url": "https://www.thestar.com/news/world/the-second-donald-trump-era-is-set-to-begin-heres-why-the-stakes-for-canada/article_207f5e80-d2bd-11ef-bfa9-7779853f9f30.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/8/d3/8d378acb-15bf-58b2-9db7-b696e58ffed3/678c3c8606519.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2025-01-18T23:45:00Z",
      "content": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's So... [4996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Snoop Dogg and Nelly Face Fan Backlash Over Trump Inauguration Shows",
      "description": "Snoop Dogg and Nelly join Trump inauguration events amid fan backlash, marking a shift from Snoop's previous anti-Trump stance.",
      "url": "https://www.newsweek.com/snoop-dogg-nelly-donald-trump-inauguration-shows-backlash-fans-2017302",
      "urlToImage": "https://d.newsweek.com/en/full/2568052/snoop-dogg-donald-trump.jpg",
      "publishedAt": "2025-01-18T23:42:26Z",
      "content": "Rappers Snoop Dogg and Nelly are performing at President-elect Donald Trump's inauguration events, with Snoop popping up at the first-ever \"Crypto Ball\" on Friday night and Nelly scheduled for the official Inaugural Liberty Ball on Monday.\nThe perfor... [4392 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "The Indian Express",
      "title": "Trump’s influence spreads through state capitols in both substance and symbolism",
      "description": "Some state officials are trying to tackle concerns that propelled Trump to office such as the economy, affordable living and immigration.",
      "url": "https://indianexpress.com/article/news-today/trumps-influence-spreads-state-capitols-substance-symbolism-9786378/",
      "urlToImage": "https://images.indianexpress.com/2025/01/Trump-flag-AP.jpg",
      "publishedAt": "2025-01-18T23:41:18Z",
      "content": "A new year of lawmaking and politicking is underway in U.S. statehouses. Governors are acting quickly to outline their agendas. And in many cases, the influence of President-elect Donald Trump already is rippling through states in both symbolic and s... [7126 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "PhoneArena"
      },
      "author": "PhoneArena",
      "title": "U.S. senators demand answers for Google, Apple and Meta’s donations to Trump",
      "description": "Two U.S. senators have given major tech companies until the end of January to state their reasons for donating handsome sums of money to president elect Donald Trump's inaugural ceremony",
      "url": "https://www.phonearena.com/news/u.s.-senators-demand-answers-for-google-apple-meta-trump-donations_id166765",
      "urlToImage": "https://m-cdn.phonearena.com/images/article/166765-wide-two_1200/U.S.-senators-demand-answers-for-Google-Apple-and-Metas-donations-to-Trump.jpg",
      "publishedAt": "2025-01-18T23:26:08Z",
      "content": "Apple\nGoogle\nMicrosoft\nMeta\nAmazon\nOpenAI\nAnd Uber\nfunny, they never sent me one of these for contributing to democrats... pic.twitter.com/xjpanXSb5D — Sam Altman (@sama) January 17, 2025\nCook has already held talks with Trump about the difficulties ... [3159 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "The Indian Express",
      "title": "Trump’s return to Washington before inauguration features Elvis impersonator, Air Force plane",
      "description": "Trump is flying in an Air Force plane sent by outgoing President Joe Biden to his home in Palm Beach, where the Republican had worked on his transition to power after winning the Nov. 5 election.",
      "url": "https://indianexpress.com/article/news-today/trumps-washington-inauguration-elvis-impersonator-air-force-plane-9786370/",
      "urlToImage": "https://images.indianexpress.com/2025/01/donald-trump-AP.jpg",
      "publishedAt": "2025-01-18T23:20:39Z",
      "content": "President-elect Donald Trump is set to arrive in Washington on Saturday evening for an inauguration celebration marking his return to power that has been upended by record cold temperatures.\nTrump is flying in an Air Force plane sent by outgoing Pres... [4404 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Mass Unrest: A Nation Protests Trump's Return",
      "description": "Thousands gathered in Washington, D.C., before the inauguration of Donald Trump as the 47th President of the United States. Organized by People’s March and other nonprofit groups, the protests highlighted opposition to Trump's policies with slogans and signs, showing support for women's rights, immigration, and equality.",
      "url": "https://www.devdiscourse.com/article/law-order/3230369-mass-unrest-a-nation-protests-trumps-return",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/25_06_2024_10_13_24_7923319.png?width=920&format=jpeg",
      "publishedAt": "2025-01-18T23:16:57Z",
      "content": "Thousands descended upon Washington, D.C., this weekend ahead of Donald Trump's inauguration as the 47th President of the United States, replacing Joe Biden on January 20 at age 78.\nA coalition of nonprofit organizations, under the People's March ban... [406 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Steve Bannon says inauguration marks ‘official surrender’ of tech titans to Trump",
      "description": "Former Trump White House adviser says supplication akin to Japanese surrender to allied forces in September 1945",
      "url": "https://www.theguardian.com/us-news/2025/jan/18/steve-bannon-tech-titans-trump",
      "urlToImage": "https://i.guim.co.uk/img/media/f848ca6d1c0ebf6ce5f51e36dfd76f4ae31e1ce3/0_127_3622_2174/master/3622.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=828802f22471feef621fbfc17a47ca8e",
      "publishedAt": "2025-01-18T23:14:32Z",
      "content": "Steve Bannon, the former Trump White House chief strategist, has described the tech titans gathering at Monday’s inauguration as “supplicants” to Donald Trump making “an official surrender”, akin to the Japanese surrender to allied forces on the deck... [4871 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "TikTok's Tumultuous Turn: Navigating the 90-Day Reprieve",
      "description": "As President-elect Trump considers a 90-day reprieve for TikTok, the app's future in the U.S. hangs in the balance due to national security concerns. TikTok faces a potential ban unless it severs ties with its China-based parent ByteDance. Users and companies brace for the platform's uncertain fate.",
      "url": "https://www.devdiscourse.com/article/politics/3230367-tiktoks-tumultuous-turn-navigating-the-90-day-reprieve",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/22_08_2024_16_59_01_5324987.png?width=920&format=jpeg",
      "publishedAt": "2025-01-18T23:05:50Z",
      "content": "In a developing story highlighting rising tensions between the U.S. and digital platform giant TikTok, President-elect Donald Trump has suggested a potential 90-day reprieve for the app, delaying an anticipated shutdown. As the crucial deadline looms... [792 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Biden's Message to Americans Less Than 48 Hours Before Trump Inauguration",
      "description": "President Joe Biden looked back at his time in the Oval Office as a period of \"hope, progress, and possibility,\" he said.",
      "url": "https://www.newsweek.com/joe-biden-presidency-donald-trump-inauguration-2017267",
      "urlToImage": "https://d.newsweek.com/en/full/2568023/joe-biden.png",
      "publishedAt": "2025-01-18T23:04:51Z",
      "content": "President Joe Biden looked back at his time in the Oval Office as a period of \"hope, progress, and possibility,\" he said in a message to Americans posted on social media less than 48 hours before President-elect Donald Trump's inauguration.\nNewsweek ... [5316 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Donald Trump Returns to Washington: A Second Inauguration Amidst Protests and Celebrations",
      "description": "Donald Trump is set to return to Washington for his second inauguration. Amid Arctic temperatures, the swearing-in ceremony will be moved indoors. Protests and celebrations mark the occasion. Notable figures, including tech billionaires and celebrities, are participating in various events, highlighting a remarkable political comeback for Trump.",
      "url": "https://www.devdiscourse.com/article/politics/3230365-donald-trump-returns-to-washington-a-second-inauguration-amidst-protests-and-celebrations",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_01_2025_10_57_22_8675565.jpg?width=920&format=jpeg",
      "publishedAt": "2025-01-18T23:01:24Z",
      "content": "Donald Trump is headed to Washington for his second inauguration as President, marking an extraordinary political comeback after leaving the office in 2021 under controversial circumstances. The Saturday schedule includes a fireworks display at Trump... [575 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Donald Trump Back on Air Force One for First Time Since Leaving Office",
      "description": "Video posted to social media showed the president-elect boarding Air Force One to travel to Washington, D.C.",
      "url": "https://www.newsweek.com/donald-trump-boards-air-force-one-2017285",
      "urlToImage": "https://d.newsweek.com/en/full/2568037/donald-melania-trump.jpg",
      "publishedAt": "2025-01-18T23:00:20Z",
      "content": "President-elect Donald Trump boarded Air Force One on Saturday to return to Washington, D.C., for his second inauguration.\nNewsweek reached out to the Trump transition team for comment by email on Saturday evening.\nThe Context\nA president-elect ahead... [3712 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Concerns Over Co-Governance: Germany's Fears of Trump's Second Term",
      "description": "Germany's ambassador to the U.S. expressed concerns about potential threats to democratic principles under Trump's possible second term. The confidential document highlights fears of increased presidential power and Big Tech's influence, impacting U.S. law enforcement and media. Military involvement in domestic issues was also mentioned.",
      "url": "https://www.devdiscourse.com/article/politics/3230364-concerns-over-co-governance-germanys-fears-of-trumps-second-term",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/18_08_2024_12_37_15_471449.png?width=920&format=jpeg",
      "publishedAt": "2025-01-18T22:59:02Z",
      "content": "A confidential document by Germany's ambassador to the United States raises alarms over the incoming Trump administration's potential impact on democracy. Ambassador Andreas Michaelis warns of a redefining constitutional order, risking media and law ... [801 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump Seeks Diplomatic Bridges: Post-Inauguration China Visit Planned",
      "description": "President-elect Donald Trump plans to visit China within his first 100 days in office. Reports suggest preliminary discussions with Chinese President Xi Jinping about future meetings. Trump's inauguration will be attended by Chinese Vice President Han Zheng as an indication of China's willingness to enhance cooperation.",
      "url": "https://www.devdiscourse.com/article/politics/3230363-trump-seeks-diplomatic-bridges-post-inauguration-china-visit-planned",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_01_2025_10_57_22_8675565.jpg?width=920&format=jpeg",
      "publishedAt": "2025-01-18T22:54:30Z",
      "content": "In a move signaling a desire to open diplomatic channels with China, U.S. President-elect Donald Trump intends to visit the country shortly after taking office. The Wall Street Journal reported Saturday about Trump's intention to make the visit withi... [662 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Inauguration Reimagined Amidst Historic Cold",
      "description": "President-elect Donald Trump is set to be inaugurated amidst freezing weather, requiring the event to move indoors. Trump will attend a rally, golf club event, and inaugural ceremonies with his family, despite challenges in seating and weather. Executive orders are anticipated post-inauguration.",
      "url": "https://www.devdiscourse.com/article/politics/3230362-trumps-inauguration-reimagined-amidst-historic-cold",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/10_01_2025_10_57_22_8675565.jpg?width=920&format=jpeg",
      "publishedAt": "2025-01-18T22:51:45Z",
      "content": "In an unexpected twist, freezing temperatures have forced President-elect Donald Trump to alter inauguration plans, moving the ceremony indoors at the Capitol Rotunda. The shift marks the first indoor inauguration since Reagan in 1985.\nTrump, 78, is ... [575 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Winter Storm Warning: Snow Expected Ahead of Trump's Pre-Inaugural DC Rally",
      "description": "Several inches of snow are expected to land in the nation's capital ahead of Trump's pre-inaugural rally on Sunday.",
      "url": "https://www.newsweek.com/winter-storm-warning-snow-expected-ahead-trumps-pre-inaugural-dc-rally-2017266",
      "urlToImage": "https://d.newsweek.com/en/full/2568020/washington-dc-inauguration-weather.jpg",
      "publishedAt": "2025-01-18T22:50:00Z",
      "content": "The National Weather Service (NWS) has issued a winter storm warning for parts of Maryland and Virginia on Sunday, along with a winter weather advisory for Washington, D.C., where snow is expected the same day President-elect Donald Trump is schedule... [5044 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Know your rights before ICE raids begin",
      "description": "On Friday, the Wall Street Journal reported the incoming Trump administration was planning a large-scale immigration raid in Chicago.",
      "url": "https://www.chicagotribune.com/2025/01/18/community-leaders-tell-chicagoans-to-know-their-rights-before-ice-raids-begin-after-trumps-inauguration/",
      "urlToImage": "https://www.chicagotribune.com/wp-content/uploads/2025/01/4a6a_x144_4bfd_9.jpg?w=1024&h=683",
      "publishedAt": "2025-01-18T22:45:00Z",
      "content": "Dozens of men, women and children huddled around a podium inside a Dominican University facility Saturday morning in Pilsen brandishing signs that read “Remain Silent” and “Know Your Rights” and “Do NOT open the door.”\nPromptly at 10 a.m., Erendira R... [5688 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Australian Financial Review"
      },
      "author": "The Australian Financial Review",
      "title": "A Sheikh, a mogul and a diplomat: the unlikely trio behind Gaza truce",
      "description": "The Qatari prime minister worked with both President Biden’s envoy and President-elect Donald Trump’s representative to bring about a deal.",
      "url": "https://www.afr.com/world/middle-east/a-sheikh-a-mogul-and-a-diplomat-the-unlikely-trio-behind-gaza-truce-20250118-p5l5fu",
      "urlToImage": "https://static.ffx.io/images/$zoom_0.9289%2C$multiply_2%2C$ratio_1.777778%2C$width_1059%2C$x_602%2C$y_97/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/c2634d634e911aa124a34796fcda281f54f08bc0",
      "publishedAt": "2025-01-18T22:22:47Z",
      "content": "Patrick Kingsley, Adam Rasgon and Michael D. Shear Jan 19, 2025 – 9.22am Save Share Copy link Copied Email LinkedIn Twitter Facebook Copy link Copied Share via... Gift this article Subscribe to gift this article Gift 5 articles to anyone you choose e... [696 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump Returns: Inauguration Flight in Presidential Style",
      "description": "Donald Trump is preparing to return to Washington for his inauguration, traveling on a U.S. government plane provided by Joe Biden. This marks a departure from Trump's usual choice of private flights. The event comes as Biden's administration emphasizes cooperation during the presidential transition.",
      "url": "https://www.devdiscourse.com/article/politics/3230358-trump-returns-inauguration-flight-in-presidential-style",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/30_07_2024_14_27_53_8740569.png?width=920&format=jpeg",
      "publishedAt": "2025-01-18T22:17:39Z",
      "content": "Donald Trump is set to return to Washington in style for his inauguration, flying aboard a U.S. military plane provided by President Joe Biden. This marks a symbolic gesture of adherence to traditional transition norms.\nTrump, known for favoring his ... [606 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Crypto's Glittering Inaugural Ball: A New Era Under Trump",
      "description": "Cryptocurrency executives celebrated the incoming Trump administration's promise of favorable crypto policies at a lavish inaugural ball featuring Snoop Dogg and other performers. The event marks a hopeful shift for the crypto industry, anticipating deregulation and wider adoption of digital currencies.",
      "url": "https://www.devdiscourse.com/article/technology/3230357-cryptos-glittering-inaugural-ball-a-new-era-under-trump",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/29_02_2020_17_01_17_7363597.jpg?width=920&format=jpeg",
      "publishedAt": "2025-01-18T22:15:29Z",
      "content": "Cryptocurrency executives celebrated in style on Friday night ahead of President-elect Donald Trump's inauguration, heralding a new era for crypto policy. The event, held at the historic Andrew W. Mellon Auditorium, marked a significant shift in Wash... [578 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "TikTok's Tumultuous Future: Unpacking the Uncertain Path Ahead",
      "description": "As the US ban on TikTok looms, confusion persists about the app's future. With potential buyout offers and legal challenges, the platform faces national security scrutiny. President-elect Trump hints at a potential extension, while ByteDance navigates divestment demands amid investor interest and regulatory hurdles.",
      "url": "https://www.devdiscourse.com/article/law-order/3230355-tiktoks-tumultuous-future-unpacking-the-uncertain-path-ahead",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/05_08_2024_10_00_59_6496426.png?width=920&format=jpeg",
      "publishedAt": "2025-01-18T22:05:07Z",
      "content": "The countdown to a US ban on TikTok creates uncertainty for the app's future in America. Despite the looming deadline, neither TikTok nor the tech giants involved have provided much-needed clarity for users.\nComplicating matters, outgoing President-e... [558 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "TikTok Credits Roll as Users Howl Over Distorted Government Priorities",
      "description": "TikTok users face down the oncoming shutdown of their beloved app on January 19 unless President-elect Donald Trump steps in after taking office.",
      "url": "https://www.newsweek.com/tiktok-credits-roll-users-howl-distorted-government-priorities-2017234",
      "urlToImage": "https://d.newsweek.com/en/full/2567984/supreme-court-tiktok-ban-arguments.jpg",
      "publishedAt": "2025-01-18T22:04:12Z",
      "content": "TikTok users are trying to make the best of an increasingly dire situation as they face the shutdown of an app that has shaped their lives over the past few years ahead of the January 19 ban going into effect.\nNewsweek has reached out to the Trump tr... [14218 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Salon"
      },
      "author": "Salon",
      "title": "Nixon paved the way for Trump’s \"new standard\" of inaugural fundraising",
      "description": "Both share the same brazen approach to financing the presidency, experts say",
      "url": "https://www.salon.com/2025/01/18/nixon-paved-the-way-for-trumps-new-standard-of-inaugural-fundraising/",
      "urlToImage": "https://mediaproxy.salon.com/width/1200/https://media2.salon.com/2023/03/donald_trump_richard_nixon_514865744_858384956.jpg",
      "publishedAt": "2025-01-18T22:01:03Z",
      "content": "Much ink has been spilled over Donald Trump’s record-shattering fundraising for his second inauguration. The president-elect has collected a reported $170 million for the smattering of ceremonies and festivities in Washington, D.C. on Monday, and is ... [4114 chars]"
    }
  ]
}
