{
  "status": "ok",
  "totalResults": 593,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Washington Examiner"
      },
      "author": "Washington Examiner",
      "title": "Biden rules out pardoning himself before he leaves White House",
      "description": "Biden confirmed he was considering issuing preemptive pardons in response to Trump's rhetoric.",
      "url": "https://www.washingtonexaminer.com/news/white-house/3283812/biden-rules-out-pardoning-himself-before-leaves-white-house/",
      "urlToImage": "https://www.washingtonexaminer.com/wp-content/uploads/2025/01/biden-6-scaled.webp",
      "publishedAt": "2025-01-10T23:48:27Z",
      "content": "President Joe Biden dismissed the idea of pardoning himself as he considers using his clemency powers to protect critics of President-elect Donald Trump, who has promised to seek revenge when he returns to the White House on Jan. 20.\n“Myself? Why sho... [1583 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Trump makes misguided accusations about California water management amid wildfires",
      "description": "President-elect Donald Trump has used the devastating Los Angeles wildfires to revisit a policy disagreement with California Gov.",
      "url": "https://www.nbcnews.com/news/us-news/trump-makes-misguided-accusations-california-water-management-wildfire-rcna187219",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/240109-los-angeles-palisades-wildfire-se-406p-e01d05.jpg",
      "publishedAt": "2025-01-10T23:21:09Z",
      "content": "President-elect Donald Trump has used the devastating Los Angeles wildfires to revisit a policy disagreement with California Gov. Gavin Newsom, pushing a series of complaints that experts say are false or misleading.\nTrump this week blamed Newsom for... [5191 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Washington Examiner"
      },
      "author": "Washington Examiner",
      "title": "White House mum on whether Biden would sign Laken Riley Act",
      "description": "The White House may not have to adopt a position related to the bill, with Republicans more likely to hold it so Trump can put his signature on it.",
      "url": "https://www.washingtonexaminer.com/news/white-house/3283548/white-house-mum-biden-would-sign-laken-riley-act/",
      "urlToImage": "https://www.washingtonexaminer.com/wp-content/uploads/2025/01/joe-biden-final-days.webp",
      "publishedAt": "2025-01-10T23:16:29Z",
      "content": "The White House is reserving judgment regarding whether President Joe Biden would sign the Republican-proposed Laken Riley Act into law.\n“The process is still playing out,” press secretary Karine Jean-Pierre told reporters Friday. “We want to evaluat... [2577 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Supreme Court to review Obamacare’s no-cost coverage of cancer screenings, heart statins and HIV drugs",
      "description": "The Supreme Court said Friday it will review the constitutionality of the Affordable Care Act’s no-cost coverage mandates for certain preventive care services, putting the landmark health care law in front of the justices again just as President-elect Donald Trump – who tried to repeal the law during his first presidency – returns to the White House.",
      "url": "https://edition.cnn.com/2025/01/10/politics/obamacare-supreme-court-hiv-prep-cancer-screening-heart-statin/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2156494599.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2025-01-10T23:10:04Z",
      "content": "CNN —\nThe Supreme Court said Friday it will review the constitutionality of the Affordable Care Act’s no-cost coverage mandates for certain preventive care services, putting the landmark health care law in front of the justices again just as Presiden... [4192 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Panama Canal will remain Panamanian and open to all nations, says official",
      "description": "Administrator rejects Donald Trump’s claims that China controls canal or suggestion US could take it back",
      "url": "https://www.theguardian.com/world/2025/jan/10/panama-canal-to-be-run-by-panama-and-open-to-trade-from-all-nations-says-official",
      "urlToImage": "https://i.guim.co.uk/img/media/d316d24a0b9776cd2891d07486d020518d2d5645/0_0_3921_2353/master/3921.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fcbf468a46c6aca92055d181bd44e61d",
      "publishedAt": "2025-01-10T23:00:08Z",
      "content": "The Panama Canal will remain in Panamanian hands, and open to commerce from all countries, according to the administrator of the waterway, who rejected claims by president-elect Donald Trump that the US should take it over.\nRicaurte Vásquez denied Tr... [3091 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Amazon dials back DEI programs ahead of Trump inauguration",
      "description": "Online giant is among several companies ending diversity, equity and inclusion programs before Trump takes office",
      "url": "https://www.theguardian.com/technology/2025/jan/10/amazon-ending-dei-programs",
      "urlToImage": "https://i.guim.co.uk/img/media/62178d6cbc2315eb20ea49bd6e72ee8657732422/0_15_5412_3249/master/5412.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75f26be0b4d091a5ca5df44c7ce5c404",
      "publishedAt": "2025-01-10T22:56:54Z",
      "content": "Amazon.com is winding down diversity programs ahead of Republican Donald Trump’s return to the US presidency, amid growing conservative opposition to such initiatives.\nSome of biggest businesses in the US have been scaling back their diversity initia... [2561 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "CBS News"
      },
      "author": "CBS News",
      "title": "Greenland leader says his people don't want to be Americans amid Trump interest: \"We want to be Greenlandic\"",
      "description": "Greenland's prime minister said he hasn't spoken to President-elect Donald Trump, but that he's open to discussions about what \"unites us.\"",
      "url": "https://www.cbsnews.com/news/greenland-leader-says-his-people-dont-want-to-be-americans/",
      "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/01/10/483de9f1-651a-4803-9154-e344bc2b3972/thumbnail/1200x630/7e1e1d0ddde00f71ad868491406238e9/gettyimages-2192274023.jpg?v=c32e88638f4c371ec40100fff0bc2158",
      "publishedAt": "2025-01-10T22:54:43Z",
      "content": "Trump says he won't rule out military force to take Greenland\nGreenland's prime minister said Friday that the mineral-rich Arctic territory's people don't want to be Americans, but that he understands U.S. President-elect Donald Trump's interest in t... [3613 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Canada is preparing to strike back hard with retaliatory tariffs if Trump starts a trade war",
      "description": "Canada is preparing to retaliate with an exhaustive list of tariffs on American goods if President-elect Trump follows through with his plans to add a steep 25% import tax on Canadian exports, people familiar with the matter told CNN. The preparations show how raising tariffs could kick off a trade war that will ultimately raise prices on a number of consumer goods.",
      "url": "https://edition.cnn.com/2025/01/10/economy/canada-tarrifs-trade-war/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2183910800.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2025-01-10T22:49:18Z",
      "content": "CNN —\nCanada is preparing to retaliate with an exhaustive list of tariffs on American goods if President-elect Donald Trump follows through with his plans to add a steep 25% import tax on Canadian goods, people familiar with the matter told CNN. The ... [3835 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Yahoo Finance"
      },
      "author": "Yahoo Finance",
      "title": "The Trump Organization's foreign deals pledge leaves some wiggle room",
      "description": "Unlike in 2017, Trump's company is not agreeing to a blanket stop on new foreign business transactions.",
      "url": "https://finance.yahoo.com/news/trump-organizations-foreign-deals-pledge-211135394.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/mOipr3nJ.VF7nYVueJ_idQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://media.zenfs.com/en/business_insider_articles_888/bde2384db58f5f32fb5046cf57787ddc",
      "publishedAt": "2025-01-10T22:42:58Z",
      "content": "The Trump Organization announced its ethics plan for Donald Trump's second term.\nThe president-elect's private company said Trump would be walled off from day-to-day duties.\nUnlike in 2017, the company is leaving the door more open to some foreign tr... [2821 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Biden Extends Migrant Protection Programs Trump Promised to End",
      "description": "A Trump spokesperson vowed the president-elect \"will deliver,\" despite the outgoing administration's decision.",
      "url": "https://www.newsweek.com/biden-extends-migrant-protection-programs-trump-promised-end-2013422",
      "urlToImage": "https://d.newsweek.com/en/full/2562429/joe-biden-donald-trump-tps.jpg",
      "publishedAt": "2025-01-10T22:41:16Z",
      "content": "The Biden administration announced Friday an extension of Temporary Protected Status (TPS) for immigrants from several countries, allowing hundreds of thousands of people to remain legally in the United States. The decision expands protections to mor... [5488 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Donald Trump's Greenland push is smart geopolitics",
      "description": "To understand the world, and to a large extent the behavior of nations, you need to look at a map — which is why Donald Trump is talking up Greenland.",
      "url": "https://nypost.com/2025/01/10/opinion/donald-trumps-greenland-push-is-smart-geopolitics/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/01/2025-washington-dc-trump-visiting-96434921-e1736547951904.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-01-10T22:35:55Z",
      "content": "In business, Donald Trump was a real-estate guy.\nIn the presidency, he might be one, too.\nThe prospective foreign policy of his second term has taken an unexpected turn, with his recent talk of annexing Canada, buying Greenland and taking back the Pa... [4184 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Donald Trump is planning 100 executive orders starting Day 1 on border, deportations and other priorities",
      "description": "President-elect Donald Trump is preparing more than 100 executive orders starting Day One of the new White House, in what amounts to a shock-and-awe campaign on border security, deportations and a rush of other policy priorities.",
      "url": "https://www.chicagotribune.com/2025/01/10/trump-100-executive-orders-day-1-border-deportations/",
      "urlToImage": "https://www.chicagotribune.com/wp-content/uploads/2025/01/Trump_51087_3cf680.jpg?w=1024&h=683",
      "publishedAt": "2025-01-10T22:33:14Z",
      "content": "WASHINGTON — President-elect Donald Trump is preparing more than 100 executive orders starting Day One of the new White House, in what amounts to a shock-and-awe campaign on border security, deportations and a rush of other policy priorities.\nTrump t... [3698 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "New York Post"
      },
      "author": "New York Post",
      "title": "Biden admin announces sweeping deportation shield for nearly 1M migrants",
      "description": "The Biden administration announced Friday that nearly 1 million migrants from Sudan, Ukraine, El Salvador and Venezuela -- a breeding ground for members of the vicious gang Tren de Aragua -- will be able to stay in the US for the next year-and-a-half, dealing a blow to President-elect Donald Trump's hard-line immigration agenda.",
      "url": "https://nypost.com/2025/01/10/us-news/biden-admin-announces-sweeping-deportation-shield-for-nearly-1m-migrants/",
      "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/01/96515996.jpg?quality=75&strip=all&w=1024",
      "publishedAt": "2025-01-10T22:28:12Z",
      "content": "The Biden administration announced Friday that nearly 1 million migrants from Sudan, Ukraine, El Salvador and Venezuela — a breeding ground for members of the vicious gang Tren de Aragua — will be able to stay in the US for the next year-and-a-half, ... [4216 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Meta nixes diversity and inclusion program as it prepares for second Trump administration",
      "description": "Joining companies such as John Deere and Walmart, Facebook and Instagram’s parent company Meta Platforms Inc. is getting rid of its diversity, equity and inclusion program that includes hiring, training and picking vendors, a company spokesperson confirmed on Friday.",
      "url": "https://www.chicagotribune.com/2025/01/10/meta-nixes-diversity-and-inclusion-program-trump-administration/",
      "urlToImage": "https://www.chicagotribune.com/wp-content/uploads/2025/01/Meta_Diversity_16637.jpg?w=1024&h=682",
      "publishedAt": "2025-01-10T22:23:06Z",
      "content": "MENLO PARK, Calif. — Joining companies such as John Deere and Walmart, Facebook and Instagram’s parent company Meta Platforms Inc. is getting rid of its diversity, equity and inclusion program that includes hiring, training and picking vendors, a com... [1127 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The New York Times"
      },
      "author": "The New York Times",
      "title": "Trump’s Sentence Comes With No Penalty, but He Will Take Office as a Felon",
      "description": "Justice Juan M. Merchan gave Donald J. Trump a symbolic punishment. The judge said that leniency was due the office of the president, not the man who will soon hold the title.",
      "url": "https://www.nytimes.com/2025/01/10/nyregion/trump-hush-money-sentencing-convicted-felon.html",
      "urlToImage": "https://static01.nyt.com/images/2025/01/10/multimedia/10trump-sentencing-ledeall-mlkc/10trump-sentencing-ledeall-mlkc-facebookJumbo.jpg",
      "publishedAt": "2025-01-10T22:21:29Z",
      "content": "Arms crossed, scowl set, President-elect Donald J. Trump avoided jail, but became a felon.\nMr. Trump appeared virtually at his criminal sentencing on Friday from his Mar-a-Lago estate in Florida, more than 1,000 miles away from the chilly Manhattan c... [1046 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Globe and Mail"
      },
      "author": "The Globe and Mail",
      "title": "Panama Canal administrator pushes back against Trump’s assertions of Chinese meddling",
      "description": "Trump has gone so far as to suggest the U.S. should take control of the canal back and he would not rule out using military might to do so",
      "url": "https://www.theglobeandmail.com/business/article-panama-canal-administrator-pushes-back-against-trumps-assertions-of/",
      "urlToImage": "https://www.theglobeandmail.com/resizer/v2/7O6D36S3ERDABFCCQPS6TEJQGE.jpg?auth=8f7417383fd06d43fa543fddf7d6d99091ae4e6b34de218a6e7049d85c5ddc20&width=1200&height=800&quality=80&smart=true",
      "publishedAt": "2025-01-10T22:19:37Z",
      "content": "Open this photo in gallery: Panama Canal Administrator Ricaurte Vásquez addresses President-elect Donald Trump's suggestion that the U.S. should retake control of the Panama Canal during an interview with Associated Press in his office Friday, Jan. 1... [2821 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Mercury News"
      },
      "author": "The Mercury News",
      "title": "The Trump company is not banning private foreign deals, a break with its first term policy",
      "description": "The so-called ethics white paper bars the Trump Organization from striking deals directly with foreign governments, but allows ones with private companies abroad.",
      "url": "https://www.mercurynews.com/2025/01/10/trump-company-private-foreign-deals/",
      "urlToImage": "https://www.mercurynews.com/wp-content/uploads/2025/01/Trump_Business_Ethics_19156.jpg?w=1024&h=682",
      "publishedAt": "2025-01-10T22:15:29Z",
      "content": "By BERNARD CONDON\nNEW YORK (AP) — The Trump family business released a voluntary ethics agreement Friday that allows it to strike deals with private foreign companies, a move that could help outside actors try to buy influence with the new administra... [7275 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Newsweek"
      },
      "author": "Newsweek",
      "title": "Justice Alito's Call With Trump 'Entirely Inappropriate'-Legal Analyst",
      "description": "\"I think the answer about whether the call should have taken place is unequivocally no,\" Joyce Vance said.",
      "url": "https://www.newsweek.com/supreme-court-samuel-alito-donald-trump-call-appropriate-2013415",
      "urlToImage": "https://d.newsweek.com/en/full/2562399/alito-trump.jpg",
      "publishedAt": "2025-01-10T22:09:29Z",
      "content": "A recent call between conservative Supreme Court Justice Samuel Alito and President-elect Donald Trump has drawn sharp criticism, with former U.S. Attorney Joyce Vance calling it \"entirely inappropriate.\"\nSpeaking on MSNBC on Friday, Vance emphasized... [6253 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Globe and Mail"
      },
      "author": "The Globe and Mail",
      "title": "Meta, Amazon scale back diversity programs ahead of Trump inauguration",
      "description": "Some of America’s biggest businesses have been scaling back their diversity initiatives",
      "url": "https://www.theglobeandmail.com/business/article-meta-amazon-scale-back-diversity-programs-ahead-of-trump-inauguration/",
      "urlToImage": "https://www.theglobeandmail.com/resizer/v2/IECBH633BNC4BH4EQYM3BF6JVQ.jpg?auth=bfd06da7324c16587e3fabdcb8172a74910fc952f55e931a3f0133a4208a95b7&width=1200&height=800&quality=80&smart=true",
      "publishedAt": "2025-01-10T22:05:27Z",
      "content": "Facebook owner Meta Platforms and Amazon.com are winding down diversity programs ahead of Republican Donald Trump’s return to the U.S. presidency, amid growing conservative opposition to such initiatives.\nSome of America’s biggest businesses have bee... [1966 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "Trump is planning 100 executive orders starting Day 1 on border, deportations and other priorities",
      "description": "WASHINGTON (AP) — President-elect Donald Trump is preparing more than 100 executive orders starting Day One of the new White House, in what amounts to a shock-and-awe campaign on border",
      "url": "https://www.thestar.com/news/world/united-states/trump-is-planning-100-executive-orders-starting-day-1-on-border-deportations-and-other-priorities/article_bdc7b252-8c93-5352-be05-1ac3a4fa418f.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/7/f9/7f974523-0a33-5783-9990-094ff6e384f1/67819aba19812.image.jpg?crop=1280%2C672%2C0%2C90&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2025-01-10T22:05:21Z",
      "content": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's So... [4996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Simple Flying"
      },
      "author": "Simple Flying",
      "title": "Trump Force Two? A Look At The Boeing 737 That JD Vance Operated During The Presidential Campaign",
      "description": "Vance used a Boeing 737-800 operated by Eastern Air Express, from July 2024.",
      "url": "https://simpleflying.com/jd-vance-boeing-737-guide/",
      "urlToImage": "https://static1.simpleflyingimages.com/wordpress/wp-content/uploads/2025/01/artboard-16_9-69.jpg",
      "publishedAt": "2025-01-10T22:00:14Z",
      "content": "Summary JD Vance used a chartered Boeing 737-800, known as Trump Force Two, for the 2024 campaign.\nThe Boeing 737-800 used by Vance has a rich history and is currently operated by Eastern Air Express.\nThe Boeing 737-800 is the perfect choice for camp... [7624 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "KABC-TV"
      },
      "author": "KABC-TV",
      "title": "President Joe Biden to deliver prime-time farewell to nation on Wednesday from Oval Office",
      "description": "President Joe Biden will deliver a farewell address to the nation Wed. from the Oval Office, 5 days before President-elect Donald Trump is sworn in.",
      "url": "https://abc7.com/post/joe-biden-news-president-deliver-prime-time-farewell-nation-wednesday-oval-office-days-before-trump-sworn/15787886/",
      "urlToImage": "https://cdn.abcotvs.com/dip/images/15787891_AP25010655954921.jpg?w=1600",
      "publishedAt": "2025-01-10T21:59:48Z",
      "content": "President Joe Biden to deliver prime-time farewell to nation on Wednesday from Oval Office\nWASHINGTON -- President Joe Biden will deliver a farewell address to the nation Wednesday from the Oval Office, five days before President-elect Donald Trump i... [770 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC10 Boston"
      },
      "author": "NBC10 Boston",
      "title": "Key senators receive Pete Hegseth's FBI background check days out from confirmation hearing",
      "description": "An FBI background check for Pete Hegseth, Donald Trump’s defense secretary pick, was transmitted to the Senate Armed Services Committee's leading members,...",
      "url": "https://www.nbcboston.com/news/politics/key-senators-receive-pete-hegseth-fbi-background-check-days-out-confirmation-hearing/3598705/",
      "urlToImage": "https://media.nbcboston.com/2025/01/GettyImages-2188828941-e1736563290765.jpg?quality=85&strip=all&resize=1200%2C675",
      "publishedAt": "2025-01-10T21:59:30Z",
      "content": "An FBI background check for Pete Hegseth, President-elect Donald Trump’s pick to lead the Department of Defense, was transmitted late Friday to the leading members of the Senate Armed Services Committee, according to two sources with direct knowledge... [7840 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Chicago Tribune"
      },
      "author": "Chicago Tribune",
      "title": "Joe Biden to deliver prime-time farewell to nation on Wednesday from Oval Office",
      "description": "President Joe Biden will deliver a farewell address to the nation Wednesday from the Oval Office, five days before President-elect Donald Trump is sworn in.",
      "url": "https://www.chicagotribune.com/2025/01/10/biden-farewell-oval-office/",
      "urlToImage": "https://www.chicagotribune.com/wp-content/uploads/2025/01/Biden_54921.jpg?w=1024&h=682",
      "publishedAt": "2025-01-10T21:52:39Z",
      "content": "WASHINGTON — President Joe Biden will deliver a farewell address to the nation Wednesday from the Oval Office, five days before President-elect Donald Trump is sworn in.\nThe president’s remarks at 8 p.m. Eastern are set to be his last significant opp... [567 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "NBC News"
      },
      "author": "NBC News",
      "title": "Trump Organization to limit president-elect's involvement under new ethics plan",
      "description": "The Trump Organization unveiled a new ethics plan that it says will limit President-elect Donald Trump’s involvement in management decisions and other aspects of the business while he is in the White House.",
      "url": "https://www.nbcnews.com/politics/donald-trump/trump-organization-ethics-plan-president-white-house-rcna187214",
      "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-01/250110-donald-trump-trump-tower-ew-444p-b433ec.jpg",
      "publishedAt": "2025-01-10T21:47:54Z",
      "content": "The Trump Organization on Friday unveiled a new ethics plan that it says will limit President-elect Donald Trump’s involvement in management decisions and other aspects of the business while he is in the White House.\nTrump will have “limited access” ... [1890 chars]"
    }
  ]
}