{
  "status": "ok",
  "totalResults": 279,
  "articles": [
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Elon Musk's Chainsaw Crusade: A Bold Move to Slash Government Waste",
      "description": "Elon Musk, spearheading cost-cutting efforts in President Trump's administration, mandates federal workers to justify their weekly accomplishments, threatening non-responses as resignations. This move is part of larger efforts to reduce government size, leading to massive workforce cuts. Employee unions condemn the ultimatum as disrespectful and unlawful.",
      "url": "https://www.devdiscourse.com/article/law-order/3274685-elon-musks-chainsaw-crusade-a-bold-move-to-slash-government-waste",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/21_02_2025_10_48_48_8718295.jpg?width=920&format=jpeg",
      "publishedAt": "2025-02-22T23:41:25Z",
      "content": "In a bold and controversial move, Elon Musk, aligned with President Donald Trump's administration, is pressuring federal employees to account for their weekly work, highlighting perceived government inefficiencies.\nMusk, whose recent appointment invo... [523 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Toronto Star"
      },
      "author": "Toronto Star",
      "title": "Is Pierre Poilivre’s best strategy still Justin Trudeau?",
      "description": "The Conservative leader seems to have concluded he cannot win on a ballot question that involves negotiating with U.S. President Donald Trump.",
      "url": "https://www.thestar.com/opinion/star-columnists/a-drop-in-public-opinion-polls-has-spooked-pierre-poilievre-is-his-best-strategy-still/article_4fdd16f2-f15f-11ef-b1d1-ab61f0e96cb2.html",
      "urlToImage": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/6/6b/66b4f17b-70f0-5199-be28-48ba342827a0/67ba5df9e1ff0.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize",
      "publishedAt": "2025-02-22T23:30:00Z",
      "content": "Country\nUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's So... [4996 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Jim Chalmers Heads to Washington for High-Stakes Trade Talks",
      "description": "Australian Treasurer Jim Chalmers plans to visit the U.S. to discuss trade and tariffs with U.S. Treasury Secretary Scott Bessent. The visit follows President Trump's consideration of exempting Australia from steel and aluminium tariffs. Talks will focus on strengthening trade relationships.",
      "url": "https://www.devdiscourse.com/article/politics/3274682-jim-chalmers-heads-to-washington-for-high-stakes-trade-talks",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/05_05_2023_18_02_28_805108.jpg?width=920&format=jpeg",
      "publishedAt": "2025-02-22T23:25:35Z",
      "content": "Australian Treasurer Jim Chalmers is set to visit Washington this week for crucial trade and tariff discussions with U.S. counterpart Scott Bessent. The meetings, announced during a broadcast on Australian Broadcasting Corporation television, aim to ... [783 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "FDA Rehiring Furloughed Scientists Amid Neuralink Trial Controversy",
      "description": "The FDA is seeking to rehire some of the scientists recently fired amid pressure from Elon Musk, who has ties to Neuralink. The agency aims to bring back around 300 personnel after Trump's abrupt dismissals. The rehirings follow ongoing Neuralink trials, which the agency approved despite past safety concerns.",
      "url": "https://www.devdiscourse.com/article/health/3274681-fda-rehiring-furloughed-scientists-amid-neuralink-trial-controversy",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/aiimagegallery/31_05_2024_22_02_14_5468247.png?width=920&format=jpeg",
      "publishedAt": "2025-02-22T23:22:30Z",
      "content": "The U.S. Food and Drug Administration is actively reaching out to some scientists it laid off to consider returning to their roles, according to informed sources speaking to Reuters. Among those targeted for rehiring are staff involved with the revie... [750 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Trump's Bold First Month: Controversies and Conservative Cheers",
      "description": "President Donald Trump marked his first month in office with significant federal cuts and controversies, lauding adviser Elon Musk's efforts to streamline the government. Amid these actions, Trump hinted at a 2028 presidential run, receiving strong support from conservatives during the CPAC. International tensions and domestic policies remain focal points.",
      "url": "https://www.devdiscourse.com/article/politics/3274679-trumps-bold-first-month-controversies-and-conservative-cheers",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_02_2025_19_00_48_9458188.jpg?width=920&format=jpeg",
      "publishedAt": "2025-02-22T23:16:05Z",
      "content": "President Donald Trump highlighted his initial month in office by celebrating achievements and sparking controversies, particularly focusing on deep federal bureaucracy cuts and strategic actions.\nIn an enthusiastic address at the Conservative Politi... [395 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Devdiscourse"
      },
      "author": "Devdiscourse",
      "title": "Musk Orders Federal Employees to Justify Their Week's Work Amid Firings",
      "description": "Elon Musk, head of the Department of Government Efficiency, threatens to fire federal workers who fail to report their weekly accomplishments. This follows President Trump's call to downsize the federal workforce. The move has sparked union outrage and raised legal questions about authority and execution.",
      "url": "https://www.devdiscourse.com/article/politics/3274677-musk-orders-federal-employees-to-justify-their-weeks-work-amid-firings",
      "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_02_2025_15_41_35_7421963.jpg?width=920&format=jpeg",
      "publishedAt": "2025-02-22T23:05:46Z",
      "content": "In a controversial move that has left federal workers on edge, Elon Musk, head of the Trump administration's Department of Government Efficiency, announced that federal employees must account for their weekly accomplishments or face termination. This... [709 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Sky News"
      },
      "author": "Sky News",
      "title": "Pay back the billions of aid, Trump tells Ukraine",
      "description": "Despite US optimism, a Ukrainian source says there are \"a number of problematic issues\" as the draft deal only contains \"unilateral commitments\".",
      "url": "https://news.sky.com/story/pay-back-the-billions-of-aid-trump-tells-ukraine-13315319",
      "urlToImage": "https://e3.365dm.com/25/02/1600x900/skynews-donald-trump-cpac_6837181.jpg?20250222194955",
      "publishedAt": "2025-02-22T22:56:00Z",
      "content": "Donald Trump has said a deal for Ukraine's rare earth metals is \"pretty close\" and the US is targeting \"anything we can get\" in exchange for the aid it's provided.\nMr Trump told a conference he was determined to get payback for billions of dollars of... [4075 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Guardian"
      },
      "author": "The Guardian",
      "title": "Trump preaches to the Maga choir at CPAC in campaign-style performance",
      "description": "US president hits familiar notes about election victories, ending the war in Ukraine and border militarization",
      "url": "https://www.theguardian.com/us-news/2025/feb/22/trump-cpac-speech",
      "urlToImage": "https://i.guim.co.uk/img/media/aa74909231991d93f692b5af0e931848586963d3/0_550_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e48e20fb4609d0afbe51b92299b1863f",
      "publishedAt": "2025-02-22T22:48:04Z",
      "content": "In a campaign-style performance, Donald Trump delivered the more-than-hour-long finale at the Conservative Political Action Conference on Saturday, hitting familiar notes about his election victories, ending the war in Ukraine, US border militarizati... [2696 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Cable News Network"
      },
      "author": "Cable News Network",
      "title": "Federal employees told to justify jobs in email or Musk says they face dismissal",
      "description": "In President Donald Trump and Elon Musk’s latest move targeting the federal workforce, employees began receiving emails Saturday afternoon asking them to explain what work they did last week, as Musk announced that “failure to respond will be taken as a resignation.”",
      "url": "https://edition.cnn.com/2025/02/22/politics/elon-musk-employees-emails/index.html",
      "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198970102-copy.jpg?c=16x9&q=w_800,c_fill",
      "publishedAt": "2025-02-22T22:39:54Z",
      "content": "CNN —\nIn President Donald Trump and Elon Musk’s latest move targeting the federal workforce, employees began receiving emails Saturday afternoon asking them to explain what work they did last week, as Musk announced that “failure to respond will be t... [8931 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Huffington Post"
      },
      "author": "The Huffington Post",
      "title": "Elon Musk Demands All Federal Employees Say 'What They Got Done Last Week' Or Be Ousted",
      "description": "The billionaire working to strip the federal government of its workforce made the demand after President Donald Trump told him to \"GET MORE AGGRESSIVE.\"",
      "url": "https://www.huffpost.com/entry/elon-musk-demands-all-federal-employees-say-what-they-got-done-last-week-or-resign_n_67ba4383e4b06ee6c4833601",
      "urlToImage": "https://img.huffingtonpost.com/asset/67ba444c14000025000bcef1.jpeg?cache=BWPNlZGrbs&ops=1200_630",
      "publishedAt": "2025-02-22T22:35:06Z",
      "content": "The next four years will change America forever. But HuffPost won't back down when it comes to providing free and impartial journalism. For the first time, we're offering an ad-free experience to qualifying contributors who support our fearless newsr... [386 chars]"
    }
  ]
}